configuration.org
#+EXCLUDE_TAGS: TOC
# #+SETUPFILE: https://fniessen.github.io/org-html-themes/setup/theme-readtheorg.setup
#+EXPORT_FILE_NAME: docs/index.html
* Table of contents                                                     :TOC:
- [[#variables-and-path][Variables and PATH]]
- [[#package-management][Package management]]
- [[#various-utility-functions][Various utility functions]]
- [[#various-configurations][Various configurations]]
  - [[#emacs-ui--editing][emacs UI & editing]]
  - [[#server][server]]
  - [[#fast-recompile-minor-mode][fast recompile minor mode]]
  - [[#smartparens][Smartparens]]
  - [[#documentation--help][Documentation & help]]
  - [[#jumping-etc][Jumping etc]]
  - [[#autocompleting-etc][Autocompleting etc]]
  - [[#engine-mode][engine-mode]]
  - [[#anzu][anzu]]
  - [[#math-input][math input]]
  - [[#recentf][recentf]]
  - [[#hi-lock--symbol-overlay][hi-lock & symbol overlay]]
  - [[#aliases][aliases]]
  - [[#clean-unused-buffers][clean unused buffers]]
  - [[#indent-guides][indent guides]]
  - [[#alignment][alignment]]
  - [[#highlight-keywords-in-some-modes][highlight keywords in some modes]]
  - [[#temp-project-roots][temp project roots]]
  - [[#reformatter][reformatter]]
  - [[#edit-indirect][edit indirect]]
- [[#term-eshell-and-comint-mode][Term, eshell and comint-mode]]
  - [[#terms][Terms]]
  - [[#eshell][eshell]]
- [[#ui][UI]]
  - [[#highlight-trailing-whitespace][highlight trailing whitespace]]
- [[#theme][Theme]]
- [[#font][Font]]
- [[#vcs][VCS]]
  - [[#magit][Magit]]
  - [[#git-timemachine][git-timemachine]]
  - [[#diff-hl][Diff-hl]]
  - [[#helpers][Helpers]]
- [[#keybindings][Keybindings]]
  - [[#keybind-to-command-mapping][keybind to command mapping]]
  - [[#setup-keybindings][setup keybindings]]
- [[#evil-mode][Evil-mode]]
  - [[#evil-mode-setup][evil-mode setup]]
  - [[#evil-packages-that-can-be-used-without-evil-mode][evil packages that can be used without evil-mode]]
- [[#hybrid-input-mode][Hybrid input mode]]
- [[#spell-checking][Spell checking]]
- [[#nix][nix]]
- [[#direnv][direnv]]
- [[#haskell][Haskell]]
- [[#purescript][Purescript]]
- [[#python][Python]]
- [[#javascripttypescript][Javascript/Typescript]]
- [[#lisps][Lisps]]
  - [[#all-lisps][all lisps]]
  - [[#emacs-lisp][emacs lisp]]
- [[#markdown][Markdown]]
- [[#other-prog-modes][Other prog modes]]
  - [[#idris][Idris]]
  - [[#agda][Agda]]
  - [[#coq][Coq]]
  - [[#rust][Rust]]
  - [[#cc][c/c++]]
  - [[#html--css][html & css]]
  - [[#dhall][dhall]]
  - [[#bazel][bazel]]
  - [[#nginx][nginx]]
  - [[#terraform][terraform]]
  - [[#docker][docker]]
  - [[#elasticsearch][elasticsearch]]
  - [[#json][json]]
  - [[#yaml][yaml]]
  - [[#asciidoc][asciidoc]]
- [[#other-major-modes][Other major modes]]
  - [[#deft][deft]]
  - [[#elfeed][elfeed]]
  - [[#pdf-tools][pdf tools]]
  - [[#erc][erc]]
  - [[#restclient][restclient]]
  - [[#ledger][ledger]]
- [[#company][Company]]
- [[#flycheck][Flycheck]]
- [[#projectile][Projectile]]
- [[#searching][Searching]]
  - [[#isearch][isearch]]
  - [[#rg][rg]]
- [[#ivycounselswiper][Ivy/Counsel/Swiper]]
- [[#yasnippet][Yasnippet]]
- [[#other-window-management][Other window management]]
  - [[#dired][Dired]]
  - [[#ibuffer][ibuffer]]
  - [[#avy][Avy]]
  - [[#ace-window][Ace-window]]
  - [[#buffer-move][buffer-move]]
  - [[#zoom][zoom]]
- [[#modeline][Modeline]]
  - [[#regular-modeline][Regular modeline]]
  - [[#experimental-new-modeline][Experimental new modeline]]
  - [[#powerline][Powerline]]
- [[#org-mode][Org-mode]]
- [[#setup][Setup]]
  - [[#per-workstation-setup][Per-workstation setup]]
  - [[#performance][Performance]]
  - [[#global-setup][Global setup]]

* Variables and PATH

#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path (expand-file-name (concat user-emacs-directory "lisp")))
(add-to-list 'load-path (expand-file-name (concat user-emacs-directory "custom")))
(add-to-list 'custom-theme-load-path
             (expand-file-name (concat user-emacs-directory "custom-themes/")))

(setq my/path
      '(
        "/usr/local/bin"
        "~/bin"
        "~/.local/bin"
        "~/.ghcup/bin"
        ))

(dolist (pth my/path)
  (add-to-list 'exec-path (expand-file-name pth))
  (setenv "PATH" (concat (expand-file-name pth)
                         path-separator
                         (getenv "PATH"))))

(setq user-full-name "Alex Peitsinis"
      user-mail-address "alexpeitsinis@gmail.com")

(setq my/dropbox-dir (expand-file-name "~/Dropbox/emacs/"))

(require 'auth-source)
(add-to-list 'auth-sources (concat my/dropbox-dir "authinfo.gpg"))

(defvar is-mac (eq system-type 'darwin)
  "Whether emacs is running in mac or not")

(defvar is-gui (display-graphic-p)
  "Whether emacs is running in gui mode or not")

(defvar is-term (not is-gui)
  "Whether emacs is running in a terminal or not")
#+END_SRC

