docs/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-03-16 Mon 13:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Alex Peitsinis" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org323c7ef">1. Variables and PATH</a></li>
<li><a href="#org4ef87c9">2. Package management</a></li>
<li><a href="#org2f2e7d5">3. Various utility functions</a></li>
<li><a href="#org3e7fecc">4. Various configurations</a>
<ul>
<li><a href="#orge3a744e">4.1. emacs UI &amp; editing</a></li>
<li><a href="#org3dbe775">4.2. auth</a></li>
<li><a href="#orgd703bba">4.3. server</a></li>
<li><a href="#org55f3c88">4.4. fast recompile minor mode</a></li>
<li><a href="#orgacc9017">4.5. Smartparens</a></li>
<li><a href="#orga2ba36b">4.6. Documentation &amp; help</a></li>
<li><a href="#org05d49ac">4.7. Jumping etc</a></li>
<li><a href="#orgadff2d3">4.8. Autocompleting etc</a></li>
<li><a href="#org25a1427">4.9. engine-mode</a></li>
<li><a href="#orgf66fe4c">4.10. anzu</a></li>
<li><a href="#orgb5999cd">4.11. math input</a></li>
<li><a href="#org480d18f">4.12. recentf</a></li>
<li><a href="#orgdb49608">4.13. hi-lock &amp; symbol overlay</a></li>
<li><a href="#orgdbe864a">4.14. aliases</a></li>
<li><a href="#org46cd9bc">4.15. clean unused buffers</a></li>
<li><a href="#org71a7f27">4.16. indent guides</a></li>
<li><a href="#orgafc394c">4.17. alignment</a></li>
<li><a href="#org4b11fa5">4.18. highlight keywords in some modes</a></li>
<li><a href="#orgba05081">4.19. temp project roots</a></li>
<li><a href="#org736b2b8">4.20. edit indirect</a></li>
</ul>
</li>
<li><a href="#orgdc18042">5. Term, eshell and comint-mode</a>
<ul>
<li><a href="#org24a638e">5.1. Terms</a></li>
<li><a href="#orgdedab88">5.2. eshell</a></li>
</ul>
</li>
<li><a href="#orgce6f11a">6. UI</a>
<ul>
<li><a href="#orga130248">6.1. highlight trailing whitespace</a></li>
</ul>
</li>
<li><a href="#org17b7121">7. Theme</a></li>
<li><a href="#orgda43c91">8. Font</a></li>
<li><a href="#org69ab35d">9. VCS</a>
<ul>
<li><a href="#orga08b2b6">9.1. Magit</a></li>
<li><a href="#orgef58236">9.2. git-timemachine</a></li>
<li><a href="#org6be9a53">9.3. Diff-hl</a></li>
<li><a href="#org46b74c7">9.4. Helpers</a></li>
</ul>
</li>
<li><a href="#org427a2f6">10. Keybindings</a>
<ul>
<li><a href="#org22da121">10.1. keybind to command mapping</a></li>
<li><a href="#orgabc6035">10.2. setup keybindings</a></li>
</ul>
</li>
<li><a href="#org102d665">11. Evil-mode</a>
<ul>
<li><a href="#org668e357">11.1. evil-mode setup</a></li>
<li><a href="#org18ed4f0">11.2. evil packages that can be used without evil-mode</a></li>
</ul>
</li>
<li><a href="#org9e9a5c1">12. Hybrid input mode</a></li>
<li><a href="#org1eb2608">13. Spell checking</a></li>
<li><a href="#org2dcc4f8">14. nix</a></li>
<li><a href="#orgf3c5b39">15. direnv</a></li>
<li><a href="#org8bfd243">16. Haskell</a></li>
<li><a href="#org4908add">17. Purescript</a></li>
<li><a href="#orgb390042">18. Python</a></li>
<li><a href="#org1d0511b">19. js/ts/html/css</a></li>
<li><a href="#orgb25c436">20. Lisps</a>
<ul>
<li><a href="#org19b929f">20.1. all lisps</a></li>
<li><a href="#org10ef5b7">20.2. emacs lisp</a></li>
</ul>
</li>
<li><a href="#org789c7c3">21. Markdown</a></li>
<li><a href="#org9982d52">22. Other prog modes</a>
<ul>
<li><a href="#orgcb9c9bf">22.1. Idris</a></li>
<li><a href="#orgf6ba755">22.2. Agda</a></li>
<li><a href="#org2a53d6e">22.3. Coq</a></li>
<li><a href="#org5cde184">22.4. Rust</a></li>
<li><a href="#orgf570467">22.5. c/c++</a></li>
<li><a href="#org01c8377">22.6. dhall</a></li>
<li><a href="#org08e247e">22.7. bazel</a></li>
<li><a href="#org726e045">22.8. nginx</a></li>
<li><a href="#org004ff52">22.9. terraform</a></li>
<li><a href="#orgc380e02">22.10. docker</a></li>
<li><a href="#org29cf92a">22.11. elasticsearch</a></li>
<li><a href="#orga8f4bae">22.12. json</a></li>
<li><a href="#org4421de8">22.13. yaml</a></li>
<li><a href="#org3a806cb">22.14. asciidoc</a></li>
<li><a href="#org310028a">22.15. reStructuredText</a></li>
</ul>
</li>
<li><a href="#orgadfe4db">23. Other major modes</a>
<ul>
<li><a href="#org5f16b0d">23.1. deft</a></li>
<li><a href="#orgb88e9fa">23.2. elfeed</a></li>
<li><a href="#org6640377">23.3. pdf tools</a></li>
<li><a href="#orga926c82">23.4. erc</a></li>
<li><a href="#org6dcd2eb">23.5. restclient</a></li>
<li><a href="#org3b5c0af">23.6. ledger</a></li>
</ul>
</li>
<li><a href="#org93669ca">24. Company</a></li>
<li><a href="#org3588af7">25. Flycheck</a></li>
<li><a href="#org4e6da9b">26. Projectile</a></li>
<li><a href="#orga56d6f0">27. Searching</a>
<ul>
<li><a href="#orge56bd76">27.1. isearch</a></li>
<li><a href="#orgff98a6b">27.2. rg</a></li>
</ul>
</li>
<li><a href="#org2524774">28. Ivy/Counsel/Swiper</a></li>
<li><a href="#orgf33c03c">29. Yasnippet</a></li>
<li><a href="#org252602d">30. Other window management</a>
<ul>
<li><a href="#orgffc37a9">30.1. Dired</a></li>
<li><a href="#org46f1464">30.2. ibuffer</a></li>
<li><a href="#org10dff13">30.3. Avy</a></li>
<li><a href="#orgeeae128">30.4. Ace-window</a></li>
<li><a href="#org92016ee">30.5. buffer-move</a></li>
<li><a href="#orge426ac0">30.6. zoom</a></li>
</ul>
</li>
<li><a href="#orge5cd9ce">31. Modeline</a>
<ul>
<li><a href="#org9a035d5">31.1. Regular modeline</a></li>
<li><a href="#org1e75d04">31.2. Experimental new modeline</a></li>
<li><a href="#orgc7d86ef">31.3. Powerline</a></li>
</ul>
</li>
<li><a href="#orge575ec3">32. Org-mode</a></li>
<li><a href="#org9c2072d">33. Setup</a>
<ul>
<li><a href="#org4919423">33.1. Per-workstation setup</a></li>
<li><a href="#orgd34a5f0">33.2. Performance</a></li>
<li><a href="#org0704bbd">33.3. Global setup</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org323c7ef" class="outline-2">
<h2 id="org323c7ef"><span class="section-number-2">1</span> Variables and PATH</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-to-list 'load-path (expand-file-name (concat user-emacs-directory <span class="org-string">"lisp"</span>)))
(add-to-list 'custom-theme-load-path
             (expand-file-name (concat user-emacs-directory <span class="org-string">"custom-themes/"</span>)))

(<span class="org-keyword">setq</span> my/path
      '(
        <span class="org-string">"/usr/local/bin"</span>
        <span class="org-string">"~/bin"</span>
        <span class="org-string">"~/.local/bin"</span>
        <span class="org-string">"~/.ghcup/bin"</span>
        ))

(<span class="org-keyword">dolist</span> (pth my/path)
  (add-to-list 'exec-path (expand-file-name pth))
  (setenv <span class="org-string">"PATH"</span> (concat (expand-file-name pth)
                         path-separator
                         (getenv <span class="org-string">"PATH"</span>))))

(<span class="org-keyword">defvar</span> <span class="org-variable-name">my/dropbox-dir</span> (expand-file-name <span class="org-string">"~/Dropbox/emacs/"</span>)
  <span class="org-doc">"Private directory synced with dropbox"</span>)

(<span class="org-keyword">defvar</span> <span class="org-variable-name">is-mac</span> (eq system-type 'darwin)
  <span class="org-doc">"Whether emacs is running in mac or not"</span>)

(<span class="org-keyword">defvar</span> <span class="org-variable-name">is-gui</span> (display-graphic-p)
  <span class="org-doc">"Whether emacs is running in gui mode or not"</span>)

(<span class="org-keyword">defvar</span> <span class="org-variable-name">is-term</span> (not is-gui)
  <span class="org-doc">"Whether emacs is running in a terminal or not"</span>)

(<span class="org-keyword">setq</span> user-full-name <span class="org-string">"Alex Peitsinis"</span>
      user-mail-address <span class="org-string">"alexpeitsinis@gmail.com"</span>)
</pre>
</div>
</div>
</div>
