docs/index.html

<div id="outline-container-org4ef87c9" class="outline-2">
<h2 id="org4ef87c9"><span class="section-number-2">2</span> Package management</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">require</span> '<span class="org-constant">package</span>)
(add-to-list 'package-archives
             '(<span class="org-string">"melpa"</span> . <span class="org-string">"https://melpa.org/packages/"</span>)
             '(<span class="org-string">"MELPA Stable"</span> . <span class="org-string">"https://stable.melpa.org/packages/"</span>))
(<span class="org-keyword">when</span> (&lt; emacs-major-version <span class="org-highlight-numbers-number">24</span>)
  <span class="org-comment-delimiter">;; </span><span class="org-comment">For important compatibility libraries like cl-lib</span>
  (add-to-list 'package-archives '(<span class="org-string">"gnu"</span> . <span class="org-string">"https://elpa.gnu.org/packages/"</span>)))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Some sort of emacs bug workaround</span>
(<span class="org-keyword">when</span> (= emacs-major-version <span class="org-highlight-numbers-number">26</span>)
  (<span class="org-keyword">setq</span> gnutls-algorithm-priority <span class="org-string">"NORMAL:-VERS-TLS1.3"</span>))

<span class="org-comment-delimiter">;; </span><span class="org-comment">activate installed packages</span>
(package-initialize)
<span class="org-comment-delimiter">;; </span><span class="org-comment">(setq package-enable-at-startup nil)</span>
(<span class="org-keyword">unless</span> (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Can be used to debug slow packages</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">(setq use-package-minimum-reported-time 0.05</span>
<span class="org-comment-delimiter">;;       </span><span class="org-comment">use-package-verbose t)</span>

(<span class="org-keyword">eval-when-compile</span>
  (<span class="org-keyword">require</span> '<span class="org-constant">use-package</span>))

(<span class="org-keyword">if</span> (&lt; emacs-major-version <span class="org-highlight-numbers-number">27</span>)
    (<span class="org-keyword">require</span> '<span class="org-constant">cl</span>))
(<span class="org-keyword">use-package</span> <span class="org-constant">diminish</span> <span class="org-builtin">:ensure</span> t)

<span class="org-comment-delimiter">;; </span><span class="org-comment">`</span><span class="org-comment"><span class="org-constant">dash</span></span><span class="org-comment">' is used in various places</span>
(<span class="org-keyword">use-package</span> <span class="org-constant">dash</span> <span class="org-builtin">:ensure</span> t)
</pre>
</div>
</div>
</div>
