docs/index.html

<div id="outline-container-org2f2e7d5" class="outline-2">
<h2 id="org2f2e7d5"><span class="section-number-2">3</span> Various utility functions</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defmacro</span> <span class="org-function-name">comment</span> (<span class="org-type">&amp;rest</span> body)
  <span class="org-doc">"Comment out one or more s-expressions."</span>
  nil)

(<span class="org-keyword">defmacro</span> <span class="org-function-name">my/add-hooks</span> (hooks <span class="org-type">&amp;rest</span> body)
  `(<span class="org-keyword">dolist</span> (hook ,hooks)
     (add-hook hook (<span class="org-keyword">lambda</span> () ,@body))))

(<span class="org-keyword">defmacro</span> <span class="org-function-name">my/execute-f-with-hook</span> (f winf)
  `(<span class="org-keyword">lambda</span> (<span class="org-type">&amp;rest</span> args)
     (<span class="org-keyword">interactive</span>)
     (,winf)
     (apply (<span class="org-keyword">quote</span> ,f) args)))

(<span class="org-keyword">defmacro</span> <span class="org-function-name">my/control-function-window-split</span> (f height width)
  `(<span class="org-keyword">lambda</span> (<span class="org-type">&amp;rest</span> args)
     (<span class="org-keyword">interactive</span>)
     (<span class="org-keyword">let</span> ((split-height-threshold ,height)
           (split-width-threshold ,width))
       (apply (<span class="org-keyword">quote</span> ,f) args))))

(<span class="org-keyword">defmacro</span> <span class="org-function-name">my/case-prefix-arg</span> (without-arg with-arg)
  `(<span class="org-keyword">lambda</span> (arg)
     (<span class="org-keyword">interactive</span> <span class="org-string">"P"</span>)
     (<span class="org-keyword">if</span> arg
         (call-interactively (<span class="org-keyword">quote</span> ,with-arg))
       (call-interactively (<span class="org-keyword">quote</span> ,without-arg)))))

<span class="org-comment-delimiter">;; </span><span class="org-comment">what it says</span>
(<span class="org-keyword">defun</span> <span class="org-function-name">my/revert-all-buffers</span> (also-git)
  <span class="org-doc">"Refresh all open file buffers without confirmation.</span>

<span class="org-doc">Buffers in modified </span><span class="org-doc"><span class="org-warning">\</span></span><span class="org-doc">(not yet saved) state in EMACS will not be reverted. They</span>
<span class="org-doc">will be reverted though if they were modified outside EMACS. Buffers visiting</span>
<span class="org-doc">files which do not exist any more or are no longer readable will be killed.</span>

<span class="org-doc">With prefix argument ALSO-GIT, refresh the git state as well </span><span class="org-doc"><span class="org-warning">\</span></span><span class="org-doc">(branch status on</span>
<span class="org-doc">modeline)."</span>
  (<span class="org-keyword">interactive</span> <span class="org-string">"P"</span>)
  (<span class="org-keyword">dolist</span> (buf (buffer-list))
    (<span class="org-keyword">let</span> ((filename (buffer-file-name buf)))
      <span class="org-comment-delimiter">;; </span><span class="org-comment">Revert only buffers containing files, which are not modified;</span>
      <span class="org-comment-delimiter">;; </span><span class="org-comment">do not try to revert non-file buffers like *Messages*.</span>
      (<span class="org-keyword">when</span> (<span class="org-keyword">and</span> filename
                 (not (buffer-modified-p buf)))
        (<span class="org-keyword">if</span> (file-readable-p filename)
            <span class="org-comment-delimiter">;; </span><span class="org-comment">If the file exists and is readable, revert the buffer.</span>
            (<span class="org-keyword">with-current-buffer</span> buf
              (revert-buffer <span class="org-builtin">:ignore-auto</span> <span class="org-builtin">:noconfirm</span> <span class="org-builtin">:preserve-modes</span>)
              (<span class="org-keyword">when</span> also-git (vc-refresh-state)))
          <span class="org-comment-delimiter">;; </span><span class="org-comment">Otherwise, kill the buffer.</span>
          (<span class="org-keyword">let</span> (kill-buffer-query-functions) <span class="org-comment-delimiter">; </span><span class="org-comment">No query done when killing buffer</span>
            (kill-buffer buf)
            (message <span class="org-string">"Killed non-existing/unreadable file buffer: %s"</span> filename))))))
  (<span class="org-keyword">let</span> ((msg-end (<span class="org-keyword">if</span> also-git <span class="org-string">", and their git state."</span> <span class="org-string">"."</span>)))
    (message
     (format <span class="org-string">"Finished reverting buffers containing unmodified files%s"</span> msg-end))))

<span class="org-comment-delimiter">;; </span><span class="org-comment">read file lines into a list</span>
(<span class="org-keyword">defun</span> <span class="org-function-name">my/read-file-into-list</span> (file-path)
  <span class="org-doc">"Return a list of lines of a file at `</span><span class="org-doc"><span class="org-constant">file-path</span></span><span class="org-doc">'."</span>
  (<span class="org-keyword">with-temp-buffer</span>
    (insert-file-contents file-path)
    (split-string (buffer-string) <span class="org-string">"\n"</span> t)))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/indent-region-or-buffer</span> ()
  <span class="org-doc">"Indent a region if selected, otherwise the whole buffer."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">save-excursion</span>
    (<span class="org-keyword">if</span> (region-active-p)
        (<span class="org-keyword">progn</span>
          (indent-region (region-beginning) (region-end))
          (message <span class="org-string">"Indented selected region."</span>))
      (<span class="org-keyword">progn</span>
        (indent-region (point-min) (point-max))
        (message <span class="org-string">"Indented buffer."</span>)))))

(global-set-key (kbd <span class="org-string">"C-M-\\"</span>) #'my/indent-region-or-buffer)

(<span class="org-keyword">defun</span> <span class="org-function-name">my/line-length</span> (<span class="org-type">&amp;optional</span> line)
  <span class="org-doc">"Length of the Nth line."</span>
  (<span class="org-keyword">let</span> ((ln (<span class="org-keyword">if</span> line line (line-number-at-pos))))
    (<span class="org-keyword">save-excursion</span>
      (goto-char (point-min))
      (<span class="org-keyword">if</span> (zerop (forward-line (1- ln)))
          (- (line-end-position)
             (line-beginning-position))
        <span class="org-highlight-numbers-number">0</span>))))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/format-region-or-buffer</span> (cmd <span class="org-type">&amp;rest</span> args)
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">let</span> ((buf (current-buffer))
        (cur-point (point))
        (cur-line (line-number-at-pos))
        (cur-col (current-column))
        (cur-rel-line (- (line-number-at-pos) (line-number-at-pos (window-start)))))
    (<span class="org-keyword">with-current-buffer</span> (get-buffer-create <span class="org-string">"*codefmt*"</span>)
      (erase-buffer)
      (insert-buffer-substring buf)
      (<span class="org-keyword">if</span> (zerop (apply 'call-process-region `(,(point-min) ,(point-max) ,cmd t (t nil) nil ,@args)))
          (<span class="org-keyword">progn</span>
            (<span class="org-keyword">if</span> (not (string= (buffer-string) (<span class="org-keyword">with-current-buffer</span> buf (buffer-string))))
                (copy-to-buffer buf (point-min) (point-max)))
            (kill-buffer))
        (<span class="org-warning">error</span> (format <span class="org-string">"%s failed, see *codefmt* for details"</span> cmd))))
    (goto-line cur-line)
    (<span class="org-keyword">when</span> (&lt; cur-col (my/line-length cur-line))
      (forward-char cur-col))
    (recenter cur-rel-line)
    (message (format <span class="org-string">"Formatted with %s"</span> cmd))))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/format-and-save</span> (cmd <span class="org-type">&amp;rest</span> args)
  (<span class="org-keyword">interactive</span>)
  (apply 'my/format-region-or-buffer `(,cmd ,@args))
  (save-buffer))

(<span class="org-keyword">defvar</span> <span class="org-variable-name">my/select-a-major-mode-last-selected</span> nil)
(<span class="org-keyword">defun</span> <span class="org-function-name">my/select-a-major-mode</span> ()
  <span class="org-doc">"Interactively select a major mode and return it as a string."</span>
  (<span class="org-keyword">let*</span> ((def (<span class="org-keyword">or</span>
               my/select-a-major-mode-last-selected
               (symbol-name initial-major-mode)))
         (choice (completing-read <span class="org-string">"major mode: "</span>
                                  (apropos-internal <span class="org-string">"-mode$"</span>)
                                  nil nil nil nil
                                  def)))
    (<span class="org-keyword">setq</span> my/select-a-major-mode-last-selected choice)))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/create-scratch-buffer-with-mode</span> (other-window)
  <span class="org-doc">"Create a new scratch buffer and select major mode to use.</span>
<span class="org-doc">With a prefix argument, open the buffer using `</span><span class="org-doc"><span class="org-constant">switch-to-buffer-other-window</span></span><span class="org-doc">'."</span>
  (<span class="org-keyword">interactive</span> <span class="org-string">"P"</span>)
  (<span class="org-keyword">let*</span> ((mmode (my/select-a-major-mode))
         (buf (generate-new-buffer (concat <span class="org-string">"*scratch"</span> <span class="org-string">"-"</span> mmode <span class="org-string">"*"</span>)))
         (switch-func (<span class="org-keyword">if</span> other-window 'switch-to-buffer-other-window 'switch-to-buffer)))
    (funcall switch-func buf)
    (funcall (intern mmode))
    (<span class="org-keyword">setq</span> buffer-offer-save nil)))

<span class="org-comment-delimiter">;; </span><span class="org-comment">https://www.reddit.com/r/emacs/comments/ac9gsf/question_emacs_way_of_using_windows/</span>
(<span class="org-keyword">defun</span> <span class="org-function-name">my/window-dedicated</span> (<span class="org-type">&amp;optional</span> window)
  <span class="org-doc">"Toggle the dedicated flag on a window."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">let*</span> ((window (<span class="org-keyword">or</span> window (selected-window)))
         (dedicated (not (window-dedicated-p window))))
    (<span class="org-keyword">when</span> (called-interactively-p)
      (message (format <span class="org-string">"%s %sdedicated"</span>
                       (buffer-name (window-buffer window))
                       (<span class="org-keyword">if</span> dedicated <span class="org-string">""</span> <span class="org-string">"un"</span>))))
    (set-window-dedicated-p window dedicated)
    dedicated))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/window-fixed</span> (<span class="org-type">&amp;optional</span> window)
  <span class="org-doc">"Make a window non-resizable."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">let*</span> ((window (<span class="org-keyword">or</span> window (selected-window)))
         (new-status (<span class="org-keyword">with-selected-window</span> window (not window-size-fixed))))
    (<span class="org-keyword">when</span> (called-interactively-p)
      (message (format <span class="org-string">"%s %sfixed"</span>
                       (buffer-name (window-buffer window))
                       (<span class="org-keyword">if</span> new-status <span class="org-string">""</span> <span class="org-string">"un"</span>))))
    (<span class="org-keyword">with-selected-window</span> window
      (<span class="org-keyword">setq</span> window-size-fixed new-status))
    new-status))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/copy-file-path</span> (include-line-number)
  (<span class="org-keyword">interactive</span> <span class="org-string">"P"</span>)
  (<span class="org-keyword">let*</span> ((full-fp (buffer-file-name))
         (prefix (read-directory-name <span class="org-string">"prefix to strip: "</span> (projectile-project-root)))
         (suffix (<span class="org-keyword">if</span> include-line-number (format <span class="org-string">":%s"</span> (number-to-string (line-number-at-pos))) <span class="org-string">""</span>))
         (fp (concat (string-remove-prefix prefix full-fp) suffix))
         )
    (kill-new fp)
    (message fp)
    t))

(<span class="org-keyword">defvar</span> <span class="org-variable-name">my/useful-files</span>
  '(
    <span class="org-comment-delimiter">;; </span><span class="org-comment">haskell</span>
    <span class="org-string">"package.yaml"</span>
    <span class="org-string">"stack.yaml"</span>
    <span class="org-string">"shell.nix"</span>
    <span class="org-string">".hlint.yaml"</span>
    <span class="org-comment-delimiter">;; </span><span class="org-comment">docker</span>
    <span class="org-string">"docker-compose.yml"</span>
    <span class="org-string">"Dockerfile"</span>
    <span class="org-comment-delimiter">;; </span><span class="org-comment">bazel</span>
    <span class="org-string">"BUILD.bazel"</span>
    <span class="org-comment-delimiter">;; </span><span class="org-comment">git</span>
    <span class="org-string">"README.md"</span>
    <span class="org-comment-delimiter">;; </span><span class="org-comment">emacs</span>
    <span class="org-string">".dir-locals.el"</span>))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/try-open-dominating-file</span> (file)
  <span class="org-doc">"Search up the file path of current file a file named FILE, and open it if it</span>
<span class="org-doc">exists.</span>

<span class="org-doc">If FILE is not provided, prompt for the filename.</span>
<span class="org-doc">With a prefix argument, open using `</span><span class="org-doc"><span class="org-constant">find-file-other-window</span></span><span class="org-doc">'."</span>
  (<span class="org-keyword">interactive</span> (list (completing-read <span class="org-string">"File name: "</span>
                                      my/useful-files
                                      nil nil nil nil nil)))
  (<span class="org-keyword">let</span> ((dir (locate-dominating-file (buffer-file-name) file))
        (find-file-func (<span class="org-keyword">if</span> current-prefix-arg 'find-file-other-window 'find-file)))
    (<span class="org-keyword">if</span> dir
        (funcall find-file-func (concat (file-name-as-directory dir) file))
      (message <span class="org-string">"No matching file found"</span>))))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/line-numbers</span> (arg)
  (<span class="org-keyword">interactive</span> <span class="org-string">"P"</span>)
  (<span class="org-keyword">if</span> (&lt; emacs-major-version <span class="org-highlight-numbers-number">26</span>)
      (call-interactively 'linum-mode)
    (<span class="org-keyword">if</span> display-line-numbers
        (<span class="org-keyword">setq</span> display-line-numbers nil)
      (<span class="org-keyword">if</span> arg
          (<span class="org-keyword">setq</span> display-line-numbers 'relative)
        (<span class="org-keyword">setq</span> display-line-numbers t)))))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/shell-command-on-buffer-or-region</span> (cmd)
  (<span class="org-keyword">save-excursion</span>
    (<span class="org-keyword">unless</span> (region-active-p)
      (mark-whole-buffer))
    (shell-command-on-region (region-beginning)
                             (region-end)
                             cmd
                             nil
                             t)))
</pre>
</div>
</div>
</div>
