docs/index.html

<div id="outline-container-org3e7fecc" class="outline-2">
<h2 id="org3e7fecc"><span class="section-number-2">4</span> Various configurations</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orge3a744e" class="outline-3">
<h3 id="orge3a744e"><span class="section-number-3">4.1</span> emacs UI &amp; editing</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">remember last position</span>
(<span class="org-keyword">use-package</span> <span class="org-constant">saveplace</span>
  <span class="org-builtin">:hook</span> (after-init . save-place-mode))

<span class="org-comment-delimiter">;; </span><span class="org-comment">undo tree</span>
(<span class="org-keyword">use-package</span> <span class="org-constant">undo-tree</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:bind</span> (<span class="org-string">"C-x u"</span> . undo-tree-visualize)
  <span class="org-builtin">:diminish</span> undo-tree-mode
  <span class="org-builtin">:hook</span> (after-init . global-undo-tree-mode)
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">setq</span> undo-tree-visualizer-relative-timestamps t
        undo-tree-visualizer-diff t))

<span class="org-comment-delimiter">;; </span><span class="org-comment">use column width 80 to fill (e.g. with `</span><span class="org-comment"><span class="org-constant">M-q</span></span><span class="org-comment">'/`</span><span class="org-comment"><span class="org-constant">gq</span></span><span class="org-comment">')</span>
(<span class="org-keyword">setq-default</span> fill-column <span class="org-highlight-numbers-number">80</span>)
(<span class="org-keyword">defun</span> <span class="org-function-name">my/set-mode-fill-width</span> (mode-hook width)
  (add-hook mode-hook `(<span class="org-keyword">lambda</span> () (<span class="org-keyword">setq</span> fill-column ,width))))

(<span class="org-keyword">use-package</span> <span class="org-constant">autorevert</span>
  <span class="org-builtin">:hook</span> (after-init . global-auto-revert-mode)
  <span class="org-builtin">:diminish</span> auto-revert-mode
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">setq</span> auto-revert-verbose nil))

(<span class="org-keyword">use-package</span> <span class="org-constant">eldoc</span> <span class="org-builtin">:diminish</span> eldoc-mode)

<span class="org-comment-delimiter">;; </span><span class="org-comment">store all backup and autosave files in</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">one dir</span>
(<span class="org-keyword">setq</span> backup-directory-alist
      `((<span class="org-string">".*"</span> . ,temporary-file-directory)))
(<span class="org-keyword">setq</span> auto-save-file-name-transforms
      `((<span class="org-string">".*"</span> ,temporary-file-directory t)))

<span class="org-comment-delimiter">;; </span><span class="org-comment">only with this set to nil can org-mode export &amp; open too</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">... but it also breaks some stuff so it's disabled</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">(setq process-connection-type nil)</span>

<span class="org-comment-delimiter">;; </span><span class="org-comment">yesss</span>
(<span class="org-keyword">defalias</span> '<span class="org-function-name">yes-or-no-p</span> #'y-or-n-p)

<span class="org-comment-delimiter">;; </span><span class="org-comment">Always confirm before closing because I'm stupid</span>
(add-hook
 'kill-emacs-query-functions
 (<span class="org-keyword">lambda</span> () (y-or-n-p <span class="org-string">"Do you really want to exit Emacs? "</span>))
 'append)

<span class="org-comment-delimiter">;; </span><span class="org-comment">use spaces</span>
(<span class="org-keyword">setq-default</span> indent-tabs-mode nil)

<span class="org-comment-delimiter">;; </span><span class="org-comment">always scroll to the end of compilation buffers</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">(setq compilation-scroll-output t)</span>

<span class="org-comment-delimiter">;; </span><span class="org-comment">vim-like scrolling (emacs=0)</span>
(<span class="org-keyword">setq</span> scroll-conservatively <span class="org-highlight-numbers-number">101</span>)

<span class="org-comment-delimiter">;; </span><span class="org-comment">Supress "ad-handle-definition: x got redefined" warnings</span>
(<span class="org-keyword">setq</span> ad-redefinition-action 'accept)

<span class="org-comment-delimiter">;; </span><span class="org-comment">smooth mouse scrolling</span>
(<span class="org-keyword">setq</span> mouse-wheel-scroll-amount '(<span class="org-highlight-numbers-number">1</span> ((shift) . <span class="org-highlight-numbers-number">1</span>)) <span class="org-comment-delimiter">;; </span><span class="org-comment">one line at a time</span>
      mouse-wheel-progressive-speed t <span class="org-comment-delimiter">;; </span><span class="org-comment">don't accelerate scrolling</span>
      mouse-wheel-follow-mouse 't) <span class="org-comment-delimiter">;; </span><span class="org-comment">scroll window under mouse</span>

<span class="org-comment-delimiter">;; </span><span class="org-comment">turn off because it causes delays in some modes (e.g. coq-mode)</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment"><span class="org-myXspecial-comment-keyword">TODO</span></span><span class="org-comment">: not sure if this makes a difference</span>
(<span class="org-keyword">setq</span> smie-blink-matching-inners nil)
<span class="org-comment-delimiter">;; </span><span class="org-comment">(setq blink-matching-paren nil)</span>

<span class="org-comment-delimiter">;; </span><span class="org-comment">who in their right mind ends sentences with 2 spaces?</span>
(<span class="org-keyword">setq</span> sentence-end-double-space nil)

<span class="org-comment-delimiter">;; </span><span class="org-comment">always trim whitespace before saving</span>
(add-hook 'before-save-hook 'delete-trailing-whitespace)

<span class="org-comment-delimiter">;; </span><span class="org-comment">some keymaps</span>
(global-set-key (kbd <span class="org-string">"M-o"</span>) 'other-window)
(global-set-key (kbd <span class="org-string">"C-c j"</span>) 'previous-buffer)
(global-set-key (kbd <span class="org-string">"C-c k"</span>) 'next-buffer)
<span class="org-comment-delimiter">;; </span><span class="org-comment">I use that to switch to Greek layout</span>
(global-set-key (kbd <span class="org-string">"M-SPC"</span>) nil)
<span class="org-comment-delimiter">;; </span><span class="org-comment">Bind M-\ to just-one-space instead of delete-horizontal-space</span>
(global-set-key (kbd <span class="org-string">"M-\\"</span>) 'just-one-space)
<span class="org-comment-delimiter">;; </span><span class="org-comment">used in help</span>
(define-key 'help-command (kbd <span class="org-string">"C-l"</span>) 'find-library)
(define-key 'help-command (kbd <span class="org-string">"C-k"</span>) 'find-function-on-key)
(define-key 'help-command (kbd <span class="org-string">"C-f"</span>) 'find-function)
(define-key 'help-command (kbd <span class="org-string">"C-p"</span>) 'find-function-at-point)
(define-key 'help-command (kbd <span class="org-string">"C-v"</span>) 'find-variable)
<span class="org-comment-delimiter">;; </span><span class="org-comment">proper count-words keybinding</span>
(global-set-key (kbd <span class="org-string">"M-="</span>) 'count-words)

<span class="org-comment-delimiter">;; </span><span class="org-comment">add env files to conf-mode alist</span>
(add-to-list 'auto-mode-alist '(<span class="org-string">".env\\'"</span> . conf-mode))
(add-to-list 'auto-mode-alist '(<span class="org-string">".env.local\\'"</span> . conf-mode))
(add-to-list 'auto-mode-alist '(<span class="org-string">"env\\.example\\'"</span> . conf-mode))

<span class="org-comment-delimiter">;; </span><span class="org-comment">DocView</span>
(<span class="org-keyword">setq</span> doc-view-continuous t)

<span class="org-comment-delimiter">;; </span><span class="org-comment">shr (html rendering)</span>
(make-variable-buffer-local 'shr-width)

(<span class="org-keyword">use-package</span> <span class="org-constant">expand-region</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:bind</span> ((<span class="org-string">"C-="</span> . er/expand-region)
         (<span class="org-string">"C-M-="</span> . er/contract-region)))

(<span class="org-keyword">use-package</span> <span class="org-constant">misc</span>
  <span class="org-builtin">:bind</span> (<span class="org-string">"M-Z"</span> . zap-up-to-char))

(<span class="org-keyword">use-package</span> <span class="org-constant">subword</span>
  <span class="org-builtin">:diminish</span> subword-mode
  <span class="org-builtin">:commands</span> (subword-mode)
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">defadvice</span> <span class="org-function-name">subword-mode</span>
      (after advice-for-subword-mode activate)
    (<span class="org-keyword">setq</span> evil-symbol-word-search subword-mode)))

(<span class="org-keyword">use-package</span> <span class="org-constant">outline</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:defer</span> t
  <span class="org-builtin">:bind</span> (<span class="org-builtin">:map</span> outline-minor-mode-map
              (<span class="org-string">"&lt;tab&gt;"</span> . outline-toggle-children))
  <span class="org-builtin">:diminish</span> outline-minor-mode)

(<span class="org-keyword">use-package</span> <span class="org-constant">outshine</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:after</span> outline
  <span class="org-builtin">:bind</span> (<span class="org-builtin">:map</span> outline-minor-mode-map
              (<span class="org-string">"&lt;S-iso-lefttab&gt;"</span> . outshine-cycle-buffer))
  <span class="org-builtin">:commands</span> (outshine-mode))

(<span class="org-keyword">use-package</span> <span class="org-constant">rainbow-mode</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:commands</span> (rainbow-mode))

(<span class="org-keyword">use-package</span> <span class="org-constant">rainbow-delimiters</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:commands</span> (rainbow-delimiters-mode))
</pre>
</div>
</div>
</div>
