docs/index.html

<div id="outline-container-org05d49ac" class="outline-3">
<h3 id="org05d49ac"><span class="section-number-3">4.7</span> Jumping etc</h3>
<div class="outline-text-3" id="text-4-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">my/goto-line-show</span> ()
  <span class="org-doc">"Show line numbers temporarily, while prompting for the line number input."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">let</span> ((cur display-line-numbers))
    (<span class="org-keyword">unwind-protect</span>
        (<span class="org-keyword">progn</span>
          (<span class="org-keyword">setq</span> display-line-numbers t)
          (call-interactively #'goto-line))
      (<span class="org-keyword">setq</span> display-line-numbers cur))))

(global-set-key (kbd <span class="org-string">"M-g M-g"</span>) 'my/goto-line-show)

(define-key prog-mode-map (kbd <span class="org-string">"M-a"</span>) 'beginning-of-defun)
(define-key prog-mode-map (kbd <span class="org-string">"M-e"</span>) 'end-of-defun)

(<span class="org-keyword">defun</span> <span class="org-function-name">my/push-mark-no-activate</span> ()
  <span class="org-doc">"Pushes `</span><span class="org-doc"><span class="org-constant">point</span></span><span class="org-doc">' to `</span><span class="org-doc"><span class="org-constant">mark-ring</span></span><span class="org-doc">' and does not activate the region</span>
<span class="org-doc">   Equivalent to \\[</span><span class="org-doc"><span class="org-constant">set-mark-command</span></span><span class="org-doc">] when \\[</span><span class="org-doc"><span class="org-constant">transient-mark-mode</span></span><span class="org-doc">] is disabled"</span>
  (<span class="org-keyword">interactive</span>)
  (push-mark (point) t nil)
  (message <span class="org-string">"Pushed mark to ring"</span>))

(global-set-key (kbd <span class="org-string">"C-`"</span>) 'my/push-mark-no-activate)

(<span class="org-keyword">defun</span> <span class="org-function-name">my/jump-to-mark</span> ()
  <span class="org-doc">"Jumps to the local mark, respecting the `</span><span class="org-doc"><span class="org-constant">mark-ring</span></span><span class="org-doc">' order.</span>
<span class="org-doc">  This is the same as using \\[</span><span class="org-doc"><span class="org-constant">set-mark-command</span></span><span class="org-doc">] with the prefix argument."</span>
  (<span class="org-keyword">interactive</span>)
  (set-mark-command <span class="org-highlight-numbers-number">1</span>))

(global-set-key (kbd <span class="org-string">"M-`"</span>) 'my/jump-to-mark)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> <span class="org-constant">imenu-list</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:bind</span> (<span class="org-string">"C-|"</span> . my/imenu-list-smart-toggle)
  <span class="org-builtin">:config</span>

  (<span class="org-keyword">defun</span> <span class="org-function-name">my/imenu-list-jump-to-window</span> ()
    <span class="org-doc">"Jump to imenu-list window if visible, otherwise create it and jump."</span>
    (<span class="org-keyword">interactive</span>)
    (<span class="org-keyword">if</span> (get-buffer-window imenu-list-buffer-name)
        (select-window (get-buffer-window imenu-list-buffer-name))
      (<span class="org-keyword">progn</span>
        (imenu-list-minor-mode)
        (select-window (get-buffer-window imenu-list-buffer-name)))))

  (<span class="org-keyword">defun</span> <span class="org-function-name">my/imenu-list-smart-toggle</span> ()
    <span class="org-doc">"If imenu-list window doesn't exist, create it and jump. If if does but</span>
<span class="org-doc">it is not the current buffer, jump there. If it exists and it's the current</span>
<span class="org-doc">buffer, close it."</span>
    (<span class="org-keyword">interactive</span>)
    (<span class="org-keyword">if</span> (eq (current-buffer) (get-buffer imenu-list-buffer-name))
        (imenu-list-quit-window)
      (my/imenu-list-jump-to-window)))

  (<span class="org-keyword">setq</span> imenu-list-size <span class="org-highlight-numbers-number">40</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgadff2d3" class="outline-3">
<h3 id="orgadff2d3"><span class="section-number-3">4.8</span> Autocompleting etc</h3>
<div class="outline-text-3" id="text-4-8">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">Don't consider punctuation part of word for completion,</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">helps complete qualified symbols</span>
(add-hook
 'prog-mode-hook
 (<span class="org-keyword">lambda</span> ()
   (<span class="org-keyword">setq</span> dabbrev-abbrev-char-regexp <span class="org-string">"\\sw</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">|</span></span><span class="org-string">\\s_</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">|</span></span><span class="org-string">\\sw\\s."</span>)))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Don't autofill when pressing RET</span>
(aset auto-fill-chars ?\n nil)
</pre>
</div>
</div>
</div>

<div id="outline-container-org25a1427" class="outline-3">
<h3 id="org25a1427"><span class="section-number-3">4.9</span> engine-mode</h3>
<div class="outline-text-3" id="text-4-9">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> <span class="org-constant">engine-mode</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:hook</span> (after-init . engine-mode)
  <span class="org-builtin">:bind-keymap</span> (<span class="org-string">"C-x /"</span> . engine-mode-map)
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">defengine</span> google
    <span class="org-string">"http://www.google.com/search?ie=utf-8&amp;oe=utf-8&amp;q=%s"</span>
    <span class="org-builtin">:keybinding</span> <span class="org-string">"g"</span>)

  (<span class="org-keyword">defengine</span> google-images
    <span class="org-string">"http://www.google.com/images?hl=en&amp;source=hp&amp;biw=1440&amp;bih=795&amp;gbv=2&amp;aq=f&amp;aqi=&amp;aql=&amp;oq=&amp;q=%s"</span>
    <span class="org-builtin">:keybinding</span> <span class="org-string">"i"</span>)

  (<span class="org-keyword">defengine</span> google-maps
    <span class="org-string">"http://maps.google.com/maps?q=%s"</span>)

  (<span class="org-keyword">defengine</span> wikipedia
    <span class="org-string">"http://www.wikipedia.org/search-redirect.php?language=en&amp;go=Go&amp;search=%s"</span>
    <span class="org-builtin">:keybinding</span> <span class="org-string">"w"</span>)

  (<span class="org-keyword">defengine</span> wiktionary
    <span class="org-string">"https://www.wikipedia.org/search-redirect.php?family=wiktionary&amp;language=en&amp;go=Go&amp;search=%s"</span>
    <span class="org-builtin">:keybinding</span> <span class="org-string">"d"</span>)

  (<span class="org-keyword">defengine</span> wolfram-alpha
    <span class="org-string">"http://www.wolframalpha.com/input/?i=%s"</span>
    <span class="org-builtin">:keybinding</span> <span class="org-string">"m"</span>)

  (<span class="org-keyword">defengine</span> youtube
    <span class="org-string">"http://www.youtube.com/results?aq=f&amp;oq=&amp;search_query=%s"</span>
    <span class="org-builtin">:keybinding</span> <span class="org-string">"v"</span>)

  (<span class="org-keyword">defengine</span> hoogle
    <span class="org-string">"https://hoogle.haskell.org/?hoogle=%s"</span>
    <span class="org-builtin">:keybinding</span> <span class="org-string">"h"</span>)

  (<span class="org-keyword">defengine</span> stackage
    <span class="org-string">"https://www.stackage.org/lts/hoogle?q=%s"</span>
    <span class="org-builtin">:keybinding</span> <span class="org-string">"s"</span>)

  (<span class="org-keyword">defengine</span> haskell-language-extensions
    <span class="org-string">"https://downloads.haskell.org/~ghc/latest/docs/html/users_guide/glasgow_exts.html#extension-%s"</span>
    <span class="org-builtin">:keybinding</span> <span class="org-string">"#"</span>)

  (<span class="org-keyword">defengine</span> pursuit
    <span class="org-string">"https://pursuit.purescript.org/search?q=%s"</span>
    <span class="org-builtin">:keybinding</span> <span class="org-string">"p"</span>)
  )
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf66fe4c" class="outline-3">
<h3 id="orgf66fe4c"><span class="section-number-3">4.10</span> anzu</h3>
<div class="outline-text-3" id="text-4-10">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> <span class="org-constant">anzu</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:hook</span> (after-init . global-anzu-mode)
  <span class="org-builtin">:diminish</span>
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">setq</span> anzu-mode-lighter <span class="org-string">""</span>))

(<span class="org-keyword">use-package</span> <span class="org-constant">evil-anzu</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:after</span> (evil anzu))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb5999cd" class="outline-3">
<h3 id="orgb5999cd"><span class="section-number-3">4.11</span> math input</h3>
<div class="outline-text-3" id="text-4-11">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> <span class="org-constant">xah-math-input</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:hook</span> (after-init . global-xah-math-input-mode)
  <span class="org-builtin">:commands</span> (xah-math-input-change-to-symbol)
  <span class="org-builtin">:diminish</span> xah-math-input-mode
  <span class="org-builtin">:config</span>
  (define-key xah-math-input-keymap (kbd <span class="org-string">"S-SPC"</span> ) nil)
  (define-key xah-math-input-keymap (kbd <span class="org-string">"S-C-SPC"</span>) 'xah-math-input-change-to-symbol)

  (puthash <span class="org-string">"::"</span> <span class="org-string">"&#8759;"</span> xah-math-input-abrvs)
  (puthash <span class="org-string">"bottom"</span> <span class="org-string">"&#8869;"</span> xah-math-input-abrvs))
</pre>
</div>
</div>
</div>
