configuration.org
** recentf

#+BEGIN_SRC emacs-lisp
(use-package recentf
  :hook (after-init . recentf-mode)
  :init
  (setq recentf-max-saved-items 100))
#+END_SRC

** hi-lock & symbol overlay

#+begin_src emacs-lisp
(use-package hi-lock
  :hook (after-init . global-hi-lock-mode)
  :init
  (setq hi-lock-face-defaults
        '(
          "hi-black-b"
          "hi-red-b"
          "hi-green-b"
          "hi-blue-b"
          "hi-green"
          "hi-blue"
          "hi-pink"
          "hi-yellow"
          ))
  (setq hi-lock-auto-select-face t)
  :config
  (define-key hi-lock-map (kbd "M-H") (lookup-key hi-lock-map (kbd "C-x w")))
  ;; TODO: find out why I can't just `define-key'
  (substitute-key-definition
   'highlight-regexp 'my/highlight-regexp hi-lock-map)

  (defun my/highlight-regexp (regexp &optional face)
    (interactive
     (list
      (hi-lock-regexp-okay
       (read-regexp "Regexp to highlight" 'regexp-history-last))
      (hi-lock-read-face-name)))
    (or (facep face) (setq face 'hi-yellow))
    (unless hi-lock-mode (hi-lock-mode 1))
    (hi-lock-set-pattern regexp face nil)))

(use-package symbol-overlay
  :ensure t
  :commands (global-symbol-overlay-mode)
  :diminish
  :config
  (define-globalized-minor-mode global-symbol-overlay-mode
    symbol-overlay-mode symbol-overlay-mode)
  (let ((map (make-sparse-keymap)))
    (define-key map (kbd ",i") 'symbol-overlay-put)
    (define-key map (kbd ",d") 'symbol-overlay-remove-all)
    (define-key map (kbd "n") 'symbol-overlay-jump-next)
    (define-key map (kbd "p") 'symbol-overlay-jump-prev)
    (define-key map (kbd ",q") 'symbol-overlay-query-replace)
    (define-key map (kbd ",r") 'symbol-overlay-rename)
    (define-key map (kbd ",w") 'symbol-overlay-save-symbol)
    (define-key map (kbd ",s") 'symbol-overlay-isearch-literally)
    (setq symbol-overlay-map map)))
#+end_src

** aliases

#+begin_src emacs-lisp
(defalias 'rb 'revert-buffer)
(defalias 'rab 'my/revert-all-buffers)
(defalias 'gb 'magit-blame-addition)
(defalias 'magb 'magit-blame-addition)
(defalias 'gl 'magit-log-buffer-file)
(defalias 'magl 'magit-log-buffer-file)
#+end_src

** clean unused buffers

#+begin_src emacs-lisp
(use-package midnight
  :commands (clean-buffer-list midnight-delay-set)
  ;; :hook (after-init . midnight-mode)
  :init
  ;; (midnight-delay-set 'midnight-delay 0)
  (setq clean-buffer-list-delay-general 3  ;; 3 days
        clean-buffer-list-kill-regexps '("\\`\\*Customize .*\\*\\'")
        clean-buffer-list-never-regexps '("\\`TAGS\\'")))
#+end_src

** indent guides

#+begin_src emacs-lisp
(use-package highlight-indent-guides
  :ensure t
  :commands (highlight-indent-guides-mode)
  :init
  (setq highlight-indent-guides-method 'character)
  (setq highlight-indent-guides-responsive nil))
#+end_src

** alignment

#+begin_src emacs-lisp
(add-hook 'align-load-hook
          (lambda ()
            (add-to-list 'align-rules-list
                         '(haskell-types
                           (regexp . "\\(\\s-+\\)\\(::\\|∷\\)\\s-+")
                           (modes quote (haskell-mode purescript-mode literate-haskell-mode))))
            (add-to-list 'align-rules-list
                         '(haskell-assignment
                           (regexp . "\\(\\s-+\\)=\\s-+")
                           (modes quote (haskell-mode purescript-mode literate-haskell-mode))))
            (add-to-list 'align-rules-list
                         '(haskell-arrows
                           (regexp . "\\(\\s-+\\)\\(->\\|→\\)\\s-+")
                           (modes quote (haskell-mode purescript-mode literate-haskell-mode))))
            (add-to-list 'align-rules-list
                         '(haskell-left-arrows
                           (regexp . "\\(\\s-+\\)\\(<-\\|←\\)\\s-+")
                           (modes quote (haskell-mode purescript-mode literate-haskell-mode))))))

(global-set-key (kbd "C-c \\") 'align-regexp)
#+end_src

