docs/index.html

<div id="outline-container-org480d18f" class="outline-3">
<h3 id="org480d18f"><span class="section-number-3">4.12</span> recentf</h3>
<div class="outline-text-3" id="text-4-12">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> <span class="org-constant">recentf</span>
  <span class="org-builtin">:hook</span> (after-init . recentf-mode)
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">setq</span> recentf-max-saved-items <span class="org-highlight-numbers-number">100</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdb49608" class="outline-3">
<h3 id="orgdb49608"><span class="section-number-3">4.13</span> hi-lock &amp; symbol overlay</h3>
<div class="outline-text-3" id="text-4-13">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> <span class="org-constant">hi-lock</span>
  <span class="org-builtin">:hook</span> (after-init . global-hi-lock-mode)
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">setq</span> hi-lock-face-defaults
        '(
          <span class="org-string">"hi-black-b"</span>
          <span class="org-string">"hi-red-b"</span>
          <span class="org-string">"hi-green-b"</span>
          <span class="org-string">"hi-blue-b"</span>
          <span class="org-string">"hi-green"</span>
          <span class="org-string">"hi-blue"</span>
          <span class="org-string">"hi-pink"</span>
          <span class="org-string">"hi-yellow"</span>
          ))
  (<span class="org-keyword">setq</span> hi-lock-auto-select-face t)
  <span class="org-builtin">:config</span>
  (define-key hi-lock-map (kbd <span class="org-string">"M-H"</span>) (lookup-key hi-lock-map (kbd <span class="org-string">"C-x w"</span>)))
  <span class="org-comment-delimiter">;; </span><span class="org-comment"><span class="org-myXspecial-comment-keyword">TODO</span></span><span class="org-comment">: find out why I can't just `</span><span class="org-comment"><span class="org-constant">define-key</span></span><span class="org-comment">'</span>
  (substitute-key-definition
   'highlight-regexp 'my/highlight-regexp hi-lock-map)

  (<span class="org-keyword">defun</span> <span class="org-function-name">my/highlight-regexp</span> (regexp <span class="org-type">&amp;optional</span> face)
    (<span class="org-keyword">interactive</span>
     (list
      (hi-lock-regexp-okay
       (read-regexp <span class="org-string">"Regexp to highlight"</span> 'regexp-history-last))
      (hi-lock-read-face-name)))
    (<span class="org-keyword">or</span> (facep face) (<span class="org-keyword">setq</span> face 'hi-yellow))
    (<span class="org-keyword">unless</span> hi-lock-mode (hi-lock-mode <span class="org-highlight-numbers-number">1</span>))
    (hi-lock-set-pattern regexp face nil)))

(<span class="org-keyword">use-package</span> <span class="org-constant">symbol-overlay</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:commands</span> (global-symbol-overlay-mode)
  <span class="org-builtin">:diminish</span>
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">define-globalized-minor-mode</span> <span class="org-function-name">global-symbol-overlay-mode</span>
    symbol-overlay-mode symbol-overlay-mode)
  (<span class="org-keyword">let</span> ((map (make-sparse-keymap)))
    (define-key map (kbd <span class="org-string">",i"</span>) 'symbol-overlay-put)
    (define-key map (kbd <span class="org-string">",d"</span>) 'symbol-overlay-remove-all)
    (define-key map (kbd <span class="org-string">"n"</span>) 'symbol-overlay-jump-next)
    (define-key map (kbd <span class="org-string">"p"</span>) 'symbol-overlay-jump-prev)
    (define-key map (kbd <span class="org-string">",q"</span>) 'symbol-overlay-query-replace)
    (define-key map (kbd <span class="org-string">",r"</span>) 'symbol-overlay-rename)
    (define-key map (kbd <span class="org-string">",w"</span>) 'symbol-overlay-save-symbol)
    (define-key map (kbd <span class="org-string">",s"</span>) 'symbol-overlay-isearch-literally)
    (<span class="org-keyword">setq</span> symbol-overlay-map map)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdbe864a" class="outline-3">
<h3 id="orgdbe864a"><span class="section-number-3">4.14</span> aliases</h3>
<div class="outline-text-3" id="text-4-14">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defalias</span> '<span class="org-function-name">rb</span> 'revert-buffer)
(<span class="org-keyword">defalias</span> '<span class="org-function-name">rab</span> 'my/revert-all-buffers)
(<span class="org-keyword">defalias</span> '<span class="org-function-name">gb</span> 'magit-blame-addition)
(<span class="org-keyword">defalias</span> '<span class="org-function-name">magb</span> 'magit-blame-addition)
(<span class="org-keyword">defalias</span> '<span class="org-function-name">gl</span> 'magit-log-buffer-file)
(<span class="org-keyword">defalias</span> '<span class="org-function-name">magl</span> 'magit-log-buffer-file)
</pre>
</div>
</div>
</div>

<div id="outline-container-org46cd9bc" class="outline-3">
<h3 id="org46cd9bc"><span class="section-number-3">4.15</span> clean unused buffers</h3>
<div class="outline-text-3" id="text-4-15">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> <span class="org-constant">midnight</span>
  <span class="org-builtin">:commands</span> (clean-buffer-list midnight-delay-set)
  <span class="org-comment-delimiter">;; </span><span class="org-comment">:hook (after-init . midnight-mode)</span>
  <span class="org-builtin">:init</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">(midnight-delay-set 'midnight-delay 0)</span>
  (<span class="org-keyword">setq</span> clean-buffer-list-delay-general <span class="org-highlight-numbers-number">3</span>  <span class="org-comment-delimiter">;; </span><span class="org-comment">3 days</span>
        clean-buffer-list-kill-regexps '(<span class="org-string">"\\`\\*Customize .*\\*\\'"</span>)
        clean-buffer-list-never-regexps '(<span class="org-string">"\\`</span><span class="org-string"><span class="org-constant">TAGS\\</span></span><span class="org-string">'"</span>)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org71a7f27" class="outline-3">
<h3 id="org71a7f27"><span class="section-number-3">4.16</span> indent guides</h3>
<div class="outline-text-3" id="text-4-16">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> <span class="org-constant">highlight-indent-guides</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:commands</span> (highlight-indent-guides-mode)
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">setq</span> highlight-indent-guides-method 'character)
  (<span class="org-keyword">setq</span> highlight-indent-guides-responsive nil))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgafc394c" class="outline-3">
<h3 id="orgafc394c"><span class="section-number-3">4.17</span> alignment</h3>
<div class="outline-text-3" id="text-4-17">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-hook 'align-load-hook
          (<span class="org-keyword">lambda</span> ()
            (add-to-list 'align-rules-list
                         '(haskell-types
                           (regexp . <span class="org-string">"</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">\\s-+</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">::</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">|</span></span><span class="org-string">&#8759;</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">\\s-+"</span>)
                           (modes quote (haskell-mode purescript-mode literate-haskell-mode))))
            (add-to-list 'align-rules-list
                         '(haskell-assignment
                           (regexp . <span class="org-string">"</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">\\s-+</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">=\\s-+"</span>)
                           (modes quote (haskell-mode purescript-mode literate-haskell-mode))))
            (add-to-list 'align-rules-list
                         '(haskell-arrows
                           (regexp . <span class="org-string">"</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">\\s-+</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">-&gt;</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">|</span></span><span class="org-string">&#8594;</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">\\s-+"</span>)
                           (modes quote (haskell-mode purescript-mode literate-haskell-mode))))
            (add-to-list 'align-rules-list
                         '(haskell-left-arrows
                           (regexp . <span class="org-string">"</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">\\s-+</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">&lt;-</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">|</span></span><span class="org-string">&#8592;</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">\\s-+"</span>)
                           (modes quote (haskell-mode purescript-mode literate-haskell-mode))))))

(global-set-key (kbd <span class="org-string">"C-c \\"</span>) 'align-regexp)
</pre>
</div>
</div>
</div>
