docs/index.html

<div id="outline-container-org4b11fa5" class="outline-3">
<h3 id="org4b11fa5"><span class="section-number-3">4.18</span> highlight keywords in some modes</h3>
<div class="outline-text-3" id="text-4-18">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defface</span> <span class="org-variable-name">my/special-keyword-face</span>
  '((t (<span class="org-builtin">:inherit</span> font-lock-keyword-face)))
  <span class="org-doc">"Face for highlighting special keywords"</span>
  <span class="org-builtin">:group</span> 'my/faces)

(<span class="org-keyword">defface</span> <span class="org-variable-name">my/special-comment-keyword-face</span>
  '((t (<span class="org-builtin">:inherit</span> font-lock-doc-face)))
  <span class="org-doc">"Face for highlighting special keywords in comments"</span>
  <span class="org-builtin">:group</span> 'my/faces)

(<span class="org-keyword">defun</span> <span class="org-function-name">my/highlight-keyword-in-mode</span> (mode kw <span class="org-type">&amp;optional</span> in-comment face)
  (<span class="org-keyword">let</span> ((fc (<span class="org-keyword">or</span> face (<span class="org-keyword">if</span> in-comment 'my/special-comment-keyword-face 'my/special-keyword-face)))
        (str (format <span class="org-string">"\\&lt;</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">%s</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">\\&gt;"</span> kw)))
    (font-lock-add-keywords
     mode
     (<span class="org-keyword">if</span> in-comment
         `((,str <span class="org-highlight-numbers-number">1</span> ,`(<span class="org-keyword">quote</span> ,fc) prepend))
       `((,str . ,`(<span class="org-keyword">quote</span> ,fc)))))))

(<span class="org-keyword">defvar</span> <span class="org-variable-name">my/comment-keywords</span>
  '(<span class="org-string">"</span><span class="org-string"><span class="org-myXspecial-comment-keyword">TODO</span></span><span class="org-string">"</span> <span class="org-string">"</span><span class="org-string"><span class="org-myXspecial-comment-keyword">TO DO</span></span><span class="org-string">"</span> <span class="org-string">"</span><span class="org-string"><span class="org-myXspecial-comment-keyword">NOTE</span></span><span class="org-string">"</span> <span class="org-string">"</span><span class="org-string"><span class="org-myXspecial-comment-keyword">FIXME</span></span><span class="org-string">"</span> <span class="org-string">"</span><span class="org-string"><span class="org-myXspecial-comment-keyword">FIX ME</span></span><span class="org-string">"</span> <span class="org-string">"</span><span class="org-string"><span class="org-myXspecial-comment-keyword">WARNING</span></span><span class="org-string">"</span> <span class="org-string">"</span><span class="org-string"><span class="org-myXspecial-comment-keyword">HACK</span></span><span class="org-string">"</span> <span class="org-string">"</span><span class="org-string"><span class="org-myXspecial-comment-keyword">XXX</span></span><span class="org-string">"</span> <span class="org-string">"</span><span class="org-string"><span class="org-myXspecial-comment-keyword">DONE</span></span><span class="org-string">"</span>))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/highlight-comment-keywords</span> (mode <span class="org-type">&amp;optional</span> face)
  (<span class="org-keyword">dolist</span> (kw my/comment-keywords)
    (my/highlight-keyword-in-mode mode kw t face)))

(<span class="org-keyword">dolist</span>
    (mode '(haskell-mode
            literate-haskell-mode
            purescript-mode
            js2-mode
            html-mode
            python-mode
            idris-mode
            agda-mode
            rust-mode
            c-mode
            emacs-lisp-mode
            markdown-mode
            ))
  (my/highlight-comment-keywords mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgba05081" class="outline-3">
<h3 id="orgba05081"><span class="section-number-3">4.19</span> temp project roots</h3>
<div class="outline-text-3" id="text-4-19">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defvar</span> <span class="org-variable-name">my/temp-project-root</span> nil)

(<span class="org-keyword">defun</span> <span class="org-function-name">my/get-or-set-temp-root</span> (reset)
  (<span class="org-keyword">let*</span> ((reset-root (<span class="org-keyword">if</span> reset my/temp-project-root nil))
         (root
          (<span class="org-keyword">if</span> (<span class="org-keyword">or</span> reset
                  (null my/temp-project-root)
                  (not (file-directory-p my/temp-project-root)))
              (read-directory-name <span class="org-string">"Temp root dir: "</span> reset-root)
            my/temp-project-root)))
    (<span class="org-keyword">setq</span> my/temp-project-root root)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org736b2b8" class="outline-3">
<h3 id="org736b2b8"><span class="section-number-3">4.20</span> edit indirect</h3>
<div class="outline-text-3" id="text-4-20">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> <span class="org-constant">edit-indirect</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:commands</span> (edit-indirect-region)
  <span class="org-builtin">:bind</span> (<span class="org-string">"C-c C-'"</span> . my/edit-indirect-region)
  <span class="org-builtin">:config</span>
  (add-hook 'edit-indirect-after-creation-hook 'my/edit-indirect-dedent)
  (add-hook 'edit-indirect-before-commit-hook 'my/edit-indirect-indent))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/edit-indirect-region</span> ()
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">unless</span> (region-active-p) (<span class="org-warning">user-error</span> <span class="org-string">"No region selected"</span>))
  (<span class="org-keyword">save-excursion</span>
    (<span class="org-keyword">let*</span> ((begin (region-beginning))
           (end (region-end))
           (mode (my/select-a-major-mode))
           (edit-indirect-guess-mode-function
            (<span class="org-keyword">lambda</span> (_parent _beg _end)
              (funcall (intern mode)))))
      (edit-indirect-region begin end 'display-buffer))))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/get-buffer-min-leading-spaces</span> (<span class="org-type">&amp;optional</span> buffer)
  (<span class="org-keyword">let*</span> ((buf (<span class="org-keyword">or</span> buffer (current-buffer)))
         (ind nil)
         )
    (<span class="org-keyword">save-excursion</span>
      (goto-char (point-min))
      (<span class="org-keyword">setq</span> ind (org-get-indentation))
      (<span class="org-keyword">while</span> (not (<span class="org-keyword">or</span> (evil-eobp) (eobp)))
        (<span class="org-keyword">unless</span> (string-match-p <span class="org-string">"\\`\\s-*$"</span> (thing-at-point 'line))
          (<span class="org-keyword">setq</span> ind (min ind (org-get-indentation))))
        (<span class="org-keyword">ignore-errors</span> (next-line))
        ))
    ind))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/edit-indirect-dedent</span> ()
  (<span class="org-keyword">let</span> ((amount (my/get-buffer-min-leading-spaces)))
    (<span class="org-keyword">setq-local</span> my/edit-indirect-dedented-amount amount)
    (<span class="org-keyword">save-excursion</span>
      (indent-rigidly (point-min) (point-max) (- amount)))))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/edit-indirect-indent</span> ()
  (<span class="org-keyword">when</span> (boundp 'my/edit-indirect-dedented-amount)
    (<span class="org-keyword">save-excursion</span>
      (indent-rigidly (point-min) (point-max) my/edit-indirect-dedented-amount))))

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgdc18042" class="outline-2">
<h2 id="orgdc18042"><span class="section-number-2">5</span> Term, eshell and comint-mode</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org24a638e" class="outline-3">
<h3 id="org24a638e"><span class="section-number-3">5.1</span> Terms</h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> <span class="org-constant">term</span>
  <span class="org-builtin">:defer</span> t
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">my/add-hooks</span>
   '(term-mode-hook)
   (define-key term-raw-map (kbd <span class="org-string">"M-o"</span>) nil)
   (define-key term-raw-map (kbd <span class="org-string">"M-+"</span>) nil))

  <span class="org-comment-delimiter">;; </span><span class="org-comment">automatically close term buffers on EOF</span>
  (<span class="org-keyword">defun</span> <span class="org-function-name">my/term-exec-hook</span> ()
    (<span class="org-keyword">let*</span> ((buff (current-buffer))
           (proc (get-buffer-process buff)))
      (set-process-sentinel
       proc
       `(<span class="org-keyword">lambda</span> (process event)
          (<span class="org-keyword">if</span> (string= event <span class="org-string">"finished\n"</span>)
              (kill-buffer ,buff))))))
  (add-hook 'term-exec-hook 'my/term-exec-hook))

(<span class="org-keyword">use-package</span> <span class="org-constant">comint</span>
  <span class="org-builtin">:defer</span> t
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">setq</span> comint-prompt-read-only t)
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">defun</span> <span class="org-function-name">my/comint-clear-buffer</span> ()
    (<span class="org-keyword">interactive</span>)
    (<span class="org-keyword">let</span> ((comint-buffer-maximum-size <span class="org-highlight-numbers-number">0</span>))
      (comint-truncate-buffer)))
  (add-hook 'comint-mode-hook
            (<span class="org-keyword">lambda</span> ()
              (define-key comint-mode-map (kbd <span class="org-string">"C-l"</span>) 'my/comint-clear-buffer))))
</pre>
</div>
</div>
</div>
