configuration.org
** eshell

#+BEGIN_SRC emacs-lisp
(use-package em-hist :after eshell)

(defun eshell/clear ()
  (interactive)
  "Clear the eshell buffer."
  (let ((eshell-buffer-maximum-lines (if my/eshell-prompt-multiline 1 0)))
    (eshell-truncate-buffer)))

(defun eshell/sp ()
  "Clear the eshell buffer."
  (setq my/eshell-prompt-multiline (not my/eshell-prompt-multiline))
  nil)

(use-package eshell
  :bind (:map eshell-mode-map
              ("C-l" . eshell/clear))
  :init
  (setq eshell-destroy-buffer-when-process-dies t
        eshell-history-size 1024
        eshell-prompt-regexp "^[^#$]* [#$] ")
  (if (boundp 'eshell-save-history-on-exit)
      (setq eshell-save-history-on-exit t)) ; Don't ask, just save
  (if (boundp 'eshell-ask-to-save-history)
      (setq eshell-ask-to-save-history 'always)) ; For older(?) version
  )

(use-package em-smart
  :init
  (setq eshell-where-to-jump 'begin
        eshell-review-quick-commands nil
        eshell-smart-space-goes-to-end t))

(defun pwd-repl-home (pwd)
  (interactive)
  (let* ((home (expand-file-name (getenv "HOME")))
         (home-len (length home)))
    (if (and
         (>= (length pwd) home-len)
         (equal home (substring pwd 0 home-len)))
        (concat "~" (substring pwd home-len))
      pwd)))

(defun my/eshell-in-dir (dir-or-file)
  (interactive "DOpen eshell in: ")
  (let* ((dir (if (file-directory-p dir-or-file)
                  dir-or-file
                (file-name-directory dir-or-file)))
         (default-directory dir))
    (eshell t)))

(defun curr-dir-git-branch-string (cwd)
  "Returns current git branch as a string, or the empty string if
CWD is not in a git repo (or the git command is not found)."
  (interactive)
  (when (and (eshell-search-path "git")
             (locate-dominating-file cwd ".git"))
    (let ((git-output
           (shell-command-to-string
            (concat "cd "
                    cwd
                    " && git branch | grep '\\*' | sed -e 's/^\\* //'"))))
      (concat
       (propertize
        (concat "["
                (if (> (length git-output) 0)
                    (substring git-output 0 -1)
                  "(no branch)")
                )
        'face 'font-lock-string-face)
       (my/git-collect-status cwd)
       (propertize "]" 'face 'font-lock-string-face)
       )
      )))

;; TODO
;; https://github.com/xuchunyang/eshell-git-prompt/blob/master/eshell-git-prompt.el
(defun my/git-collect-status (cwd)
  (when (and (eshell-search-path "git")
             (locate-dominating-file cwd ".git"))
    (let ((git-output
           (split-string
            (shell-command-to-string
             (concat "cd "
                     cwd
                     " && git status --porcelain"))
            "\n" t))
          (untracked 0)
          (modified 0)
          (modified-updated 0)
          (new-added 0)
          (deleted 0)
          (deleted-updated 0)
          (renamed-updated 0)
          (commits-ahead 0) ;; TODO
          (commits-behind 0) ;; TODO
          )
      (dolist (x git-output)
        (pcase (substring x 0 2)
          ("??" (cl-incf untracked))
          ("MM" (progn (cl-incf modified)
                       (cl-incf modified-updated)))
          (" M" (cl-incf modified))
          ("M " (cl-incf modified-updated))
          ("A " (cl-incf new-added))
          (" D" (cl-incf deleted))
          ("D " (cl-incf deleted-updated))
          ("R " (cl-incf renamed-updated))
          )
        )
      (concat
       (propertize (if (> (+ untracked deleted) 0) "•" "") 'face '(:foreground "salmon3"))
       (propertize (if (> modified 0) "•" "") 'face '(:foreground "goldenrod3"))
       (propertize (if (> modified-updated 0) "•" "") 'face '(:foreground "SeaGreen4"))
       )
      )
    ))

(defvar my/eshell-prompt-multiline nil)

(setq eshell-prompt-function
      (lambda ()
        (concat
         (propertize (if my/eshell-prompt-multiline "┌─╼ " "") 'face 'font-lock-type-face)
         (propertize
          ((lambda (p-lst)
             (if (> (length p-lst) 3)
                 (concat
                  (mapconcat (lambda (elm) (if (zerop (length elm)) ""
                                             (substring elm 0 1)))
                             (butlast p-lst 3)
                             "/")
                  "/"
                  (mapconcat (lambda (elm) elm)
                             (last p-lst 3)
                             "/"))
               (mapconcat (lambda (elm) elm)
                          p-lst
                          "/")))
           (split-string (pwd-repl-home (eshell/pwd)) "/"))
          'face
          'font-lock-type-face)
         (or (curr-dir-git-branch-string (eshell/pwd)))
         (propertize (if my/eshell-prompt-multiline "\n└╼ " " ") 'face 'font-lock-type-face)
         (propertize "$" 'face 'font-lock-function-name-face)
         (propertize " " 'face 'default))))
#+END_SRC

