docs/index.html

<div id="outline-container-orgdedab88" class="outline-3">
<h3 id="orgdedab88"><span class="section-number-3">5.2</span> eshell</h3>
<div class="outline-text-3" id="text-5-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> <span class="org-constant">em-hist</span> <span class="org-builtin">:after</span> eshell)

(<span class="org-keyword">use-package</span> <span class="org-constant">eshell</span>
  <span class="org-builtin">:commands</span> (eshell)
  <span class="org-builtin">:bind</span> (<span class="org-builtin">:map</span> eshell-mode-map
              (<span class="org-string">"C-l"</span> . my/eshell-clear))
  <span class="org-builtin">:init</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">eshell/clear doesn't work anymore because eshell has its own clear function</span>
  (<span class="org-keyword">defun</span> <span class="org-function-name">my/eshell-clear</span> ()
    (<span class="org-keyword">interactive</span>)
    <span class="org-string">"Clear the eshell buffer."</span>
    (<span class="org-keyword">let</span> ((eshell-buffer-maximum-lines (<span class="org-keyword">if</span> my/eshell-prompt-multiline <span class="org-highlight-numbers-number">1</span> <span class="org-highlight-numbers-number">0</span>)))
      (eshell-truncate-buffer)))

  <span class="org-comment-delimiter">;; </span><span class="org-comment">toggle between single line/multiline prompt</span>
  (<span class="org-keyword">defun</span> <span class="org-function-name">eshell/sp</span> ()
    <span class="org-doc">"Clear the eshell buffer."</span>
    (<span class="org-keyword">setq</span> my/eshell-prompt-multiline (not my/eshell-prompt-multiline))
    nil)

  (<span class="org-keyword">setq</span> eshell-destroy-buffer-when-process-dies t
        eshell-history-size <span class="org-highlight-numbers-number">1024</span>
        eshell-prompt-regexp <span class="org-string">"^[</span><span class="org-string"><span class="org-negation-char">^</span></span><span class="org-string">#$]* [#$] "</span>)

  (<span class="org-keyword">defvar</span> <span class="org-variable-name">my/eshell-prompt-multiline</span> nil)

  (<span class="org-keyword">setq</span> eshell-prompt-function
        (<span class="org-keyword">lambda</span> ()
          (concat
           (propertize (<span class="org-keyword">if</span> my/eshell-prompt-multiline <span class="org-string">"&#9484;&#9472;&#9596; "</span> <span class="org-string">""</span>) 'face 'font-lock-type-face)
           (propertize
            ((<span class="org-keyword">lambda</span> (p-lst)
               (<span class="org-keyword">if</span> (&gt; (length p-lst) <span class="org-highlight-numbers-number">3</span>)
                   (concat
                    (mapconcat (<span class="org-keyword">lambda</span> (elm) (<span class="org-keyword">if</span> (zerop (length elm)) <span class="org-string">""</span>
                                               (substring elm <span class="org-highlight-numbers-number">0</span> <span class="org-highlight-numbers-number">1</span>)))
                               (butlast p-lst <span class="org-highlight-numbers-number">3</span>)
                               <span class="org-string">"/"</span>)
                    <span class="org-string">"/"</span>
                    (mapconcat (<span class="org-keyword">lambda</span> (elm) elm)
                               (last p-lst <span class="org-highlight-numbers-number">3</span>)
                               <span class="org-string">"/"</span>))
                 (mapconcat (<span class="org-keyword">lambda</span> (elm) elm)
                            p-lst
                            <span class="org-string">"/"</span>)))
             (split-string (pwd-repl-home (eshell/pwd)) <span class="org-string">"/"</span>))
            'face
            'font-lock-type-face)
           (<span class="org-keyword">or</span> (curr-dir-git-branch-string (eshell/pwd)))
           (propertize (<span class="org-keyword">if</span> my/eshell-prompt-multiline <span class="org-string">"\n&#9492;&#9596; "</span> <span class="org-string">" "</span>) 'face 'font-lock-type-face)
           (propertize <span class="org-string">"$"</span> 'face 'font-lock-function-name-face)
           (propertize <span class="org-string">" "</span> 'face 'default))))
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">if</span> (boundp 'eshell-save-history-on-exit)
      (<span class="org-keyword">setq</span> eshell-save-history-on-exit t)) <span class="org-comment-delimiter">; </span><span class="org-comment">Don't ask, just save</span>
  (<span class="org-keyword">if</span> (boundp 'eshell-ask-to-save-history)
      (<span class="org-keyword">setq</span> eshell-ask-to-save-history 'always)) <span class="org-comment-delimiter">; </span><span class="org-comment">For older(?) version</span>
  )

(<span class="org-keyword">use-package</span> <span class="org-constant">em-smart</span>
  <span class="org-builtin">:after</span> eshell
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">setq</span> eshell-where-to-jump 'begin
        eshell-review-quick-commands nil
        eshell-smart-space-goes-to-end t))

(<span class="org-keyword">defun</span> <span class="org-function-name">pwd-repl-home</span> (pwd)
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">let*</span> ((home (expand-file-name (getenv <span class="org-string">"HOME"</span>)))
         (home-len (length home)))
    (<span class="org-keyword">if</span> (<span class="org-keyword">and</span>
         (&gt;= (length pwd) home-len)
         (equal home (substring pwd <span class="org-highlight-numbers-number">0</span> home-len)))
        (concat <span class="org-string">"~"</span> (substring pwd home-len))
      pwd)))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/eshell-in-dir</span> (dir-or-file)
  (<span class="org-keyword">interactive</span> <span class="org-string">"DOpen eshell in: "</span>)
  (<span class="org-keyword">let*</span> ((dir (<span class="org-keyword">if</span> (file-directory-p dir-or-file)
                  dir-or-file
                (file-name-directory dir-or-file)))
         (default-directory dir))
    (eshell t)))

(<span class="org-keyword">defun</span> <span class="org-function-name">curr-dir-git-branch-string</span> (cwd)
  <span class="org-doc">"Returns current git branch as a string, or the empty string if</span>
<span class="org-doc">CWD is not in a git repo (or the git command is not found)."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">when</span> (<span class="org-keyword">and</span> (eshell-search-path <span class="org-string">"git"</span>)
             (locate-dominating-file cwd <span class="org-string">".git"</span>))
    (<span class="org-keyword">let</span> ((git-output
           (shell-command-to-string
            (concat <span class="org-string">"cd "</span>
                    cwd
                    <span class="org-string">" &amp;&amp; git branch | grep '\\*' | sed -e 's/^\\* //'"</span>))))
      (concat
       (propertize
        (concat <span class="org-string">"["</span>
                (<span class="org-keyword">if</span> (&gt; (length git-output) <span class="org-highlight-numbers-number">0</span>)
                    (substring git-output <span class="org-highlight-numbers-number">0</span> <span class="org-highlight-numbers-number">-1</span>)
                  <span class="org-string">"(no branch)"</span>)
                )
        'face 'font-lock-string-face)
       (my/git-collect-status cwd)
       (propertize <span class="org-string">"]"</span> 'face 'font-lock-string-face)
       )
      )))

<span class="org-comment-delimiter">;; </span><span class="org-comment"><span class="org-myXspecial-comment-keyword">TODO</span></span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">https://github.com/xuchunyang/eshell-git-prompt/blob/master/eshell-git-prompt.el</span>
(<span class="org-keyword">defun</span> <span class="org-function-name">my/git-collect-status</span> (cwd)
  (<span class="org-keyword">when</span> (<span class="org-keyword">and</span> (eshell-search-path <span class="org-string">"git"</span>)
             (locate-dominating-file cwd <span class="org-string">".git"</span>))
    (<span class="org-keyword">let</span> ((git-output
           (split-string
            (shell-command-to-string
             (concat <span class="org-string">"cd "</span>
                     cwd
                     <span class="org-string">" &amp;&amp; git status --porcelain"</span>))
            <span class="org-string">"\n"</span> t))
          (untracked <span class="org-highlight-numbers-number">0</span>)
          (modified <span class="org-highlight-numbers-number">0</span>)
          (modified-updated <span class="org-highlight-numbers-number">0</span>)
          (new-added <span class="org-highlight-numbers-number">0</span>)
          (deleted <span class="org-highlight-numbers-number">0</span>)
          (deleted-updated <span class="org-highlight-numbers-number">0</span>)
          (renamed-updated <span class="org-highlight-numbers-number">0</span>)
          (commits-ahead <span class="org-highlight-numbers-number">0</span>) <span class="org-comment-delimiter">;; </span><span class="org-comment"><span class="org-myXspecial-comment-keyword">TODO</span></span>
          (commits-behind <span class="org-highlight-numbers-number">0</span>) <span class="org-comment-delimiter">;; </span><span class="org-comment"><span class="org-myXspecial-comment-keyword">TODO</span></span>
          )
      (<span class="org-keyword">dolist</span> (x git-output)
        (<span class="org-keyword">pcase</span> (substring x <span class="org-highlight-numbers-number">0</span> <span class="org-highlight-numbers-number">2</span>)
          (<span class="org-string">"??"</span> (<span class="org-keyword">cl-incf</span> untracked))
          (<span class="org-string">"MM"</span> (<span class="org-keyword">progn</span> (<span class="org-keyword">cl-incf</span> modified)
                       (<span class="org-keyword">cl-incf</span> modified-updated)))
          (<span class="org-string">" M"</span> (<span class="org-keyword">cl-incf</span> modified))
          (<span class="org-string">"M "</span> (<span class="org-keyword">cl-incf</span> modified-updated))
          (<span class="org-string">"A "</span> (<span class="org-keyword">cl-incf</span> new-added))
          (<span class="org-string">" D"</span> (<span class="org-keyword">cl-incf</span> deleted))
          (<span class="org-string">"D "</span> (<span class="org-keyword">cl-incf</span> deleted-updated))
          (<span class="org-string">"R "</span> (<span class="org-keyword">cl-incf</span> renamed-updated))
          )
        )
      (concat
       (propertize (<span class="org-keyword">if</span> (&gt; (+ untracked deleted) <span class="org-highlight-numbers-number">0</span>) <span class="org-string">"&#8226;"</span> <span class="org-string">""</span>) 'face '(<span class="org-builtin">:foreground</span> <span class="org-string">"salmon3"</span>))
       (propertize (<span class="org-keyword">if</span> (&gt; modified <span class="org-highlight-numbers-number">0</span>) <span class="org-string">"&#8226;"</span> <span class="org-string">""</span>) 'face '(<span class="org-builtin">:foreground</span> <span class="org-string">"goldenrod3"</span>))
       (propertize (<span class="org-keyword">if</span> (&gt; modified-updated <span class="org-highlight-numbers-number">0</span>) <span class="org-string">"&#8226;"</span> <span class="org-string">""</span>) 'face '(<span class="org-builtin">:foreground</span> <span class="org-string">"SeaGreen4"</span>))
       )
      )
    ))
</pre>
</div>
</div>
</div>
</div>
