configuration.org
* UI

#+BEGIN_SRC emacs-lisp
;; highlight numbers
(use-package highlight-numbers
  :ensure t
  :hook ((prog-mode haskell-cabal-mode css-mode) . highlight-numbers-mode))

;; show column in modeline
(setq column-number-mode t)

;; disable annoying stuff
(setq ring-bell-function 'ignore
      inhibit-startup-message t
      inhibit-splash-screen t
      initial-scratch-message nil)
(menu-bar-mode -1)
(scroll-bar-mode -1)
(set-window-scroll-bars (minibuffer-window) nil nil)
(tool-bar-mode -1)

(use-package linum
  :if (< emacs-major-version 26)
  :init (setq linum-format 'dynamic))

(use-package hl-line
  ;; :hook (prog-mode . hl-line-mode)
  :commands (hl-line-mode global-hl-line-mode)
  :init
  (setq hl-line-sticky-flag nil)
  (defvar my/hl-line-contrast 5)
  (defun my/hl-line-set-bg (&optional light-bg th)
    (let* ((func (if light-bg 'color-darken-name 'color-lighten-name))
           (bg (face-attribute 'default :background))
           (theme (if th th my/theme)))
      (custom-theme-set-faces
       theme
       `(hl-line ((t (:background ,(funcall func bg my/hl-line-contrast)))))))))

(use-package display-fill-column-indicator
  :if (>= emacs-major-version 27)
  :commands (display-fill-column-indicator-mode)
  :hook ((python-mode markdown-mode) . display-fill-column-indicator-mode))
#+END_SRC

** highlight trailing whitespace

#+BEGIN_SRC emacs-lisp
(use-package whitespace
  :ensure t
  :diminish whitespace-mode
  :diminish global-whitespace-mode
  :hook ((prog-mode . whitespace-mode))
  :init
  (setq whitespace-line-column 80
        whitespace-style '(face trailing)))
#+END_SRC

