docs/index.html

<div id="outline-container-orgce6f11a" class="outline-2">
<h2 id="orgce6f11a"><span class="section-number-2">6</span> UI</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">highlight numbers</span>
(<span class="org-keyword">use-package</span> <span class="org-constant">highlight-numbers</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:hook</span> ((prog-mode haskell-cabal-mode css-mode) . highlight-numbers-mode))

<span class="org-comment-delimiter">;; </span><span class="org-comment">show column in modeline</span>
(<span class="org-keyword">setq</span> column-number-mode t)

<span class="org-comment-delimiter">;; </span><span class="org-comment">disable annoying stuff</span>
(<span class="org-keyword">setq</span> ring-bell-function 'ignore
      inhibit-startup-message t
      inhibit-splash-screen t
      initial-scratch-message nil)
(menu-bar-mode <span class="org-highlight-numbers-number">-1</span>)
(scroll-bar-mode <span class="org-highlight-numbers-number">-1</span>)
(set-window-scroll-bars (minibuffer-window) nil nil)
(tool-bar-mode <span class="org-highlight-numbers-number">-1</span>)

(<span class="org-keyword">use-package</span> <span class="org-constant">linum</span>
  <span class="org-builtin">:if</span> (&lt; emacs-major-version <span class="org-highlight-numbers-number">26</span>)
  <span class="org-builtin">:init</span> (<span class="org-keyword">setq</span> linum-format 'dynamic))

(<span class="org-keyword">use-package</span> <span class="org-constant">hl-line</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">:hook (prog-mode . hl-line-mode)</span>
  <span class="org-builtin">:commands</span> (hl-line-mode global-hl-line-mode)
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">setq</span> hl-line-sticky-flag nil)
  (<span class="org-keyword">defvar</span> <span class="org-variable-name">my/hl-line-contrast</span> <span class="org-highlight-numbers-number">5</span>)
  (<span class="org-keyword">defun</span> <span class="org-function-name">my/hl-line-set-bg</span> (<span class="org-type">&amp;optional</span> light-bg th)
    (<span class="org-keyword">let*</span> ((func (<span class="org-keyword">if</span> light-bg 'color-darken-name 'color-lighten-name))
           (bg (face-attribute 'default <span class="org-builtin">:background</span>))
           (theme (<span class="org-keyword">if</span> th th my/theme)))
      (custom-theme-set-faces
       theme
       `(hl-line ((t (<span class="org-builtin">:background</span> ,(funcall func bg my/hl-line-contrast)))))))))

(<span class="org-keyword">use-package</span> <span class="org-constant">display-fill-column-indicator</span>
  <span class="org-builtin">:if</span> (&gt;= emacs-major-version <span class="org-highlight-numbers-number">27</span>)
  <span class="org-builtin">:commands</span> (display-fill-column-indicator-mode)
  <span class="org-builtin">:hook</span> ((python-mode markdown-mode) . display-fill-column-indicator-mode))
</pre>
</div>
</div>

<div id="outline-container-orga130248" class="outline-3">
<h3 id="orga130248"><span class="section-number-3">6.1</span> highlight trailing whitespace</h3>
<div class="outline-text-3" id="text-6-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> <span class="org-constant">whitespace</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:diminish</span> whitespace-mode
  <span class="org-builtin">:diminish</span> global-whitespace-mode
  <span class="org-builtin">:hook</span> ((prog-mode . whitespace-mode))
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">setq</span> whitespace-line-column <span class="org-highlight-numbers-number">80</span>
        whitespace-style '(face trailing)))
</pre>
</div>
</div>
</div>
</div>
