configuration.org
* Theme

#+BEGIN_SRC emacs-lisp
(defun my/after-set-theme (&optional light-bg)
  (setq my/theme-light-bg (if light-bg t nil))
  (my/diff-hl-set-fringe-faces light-bg)
  (my/hl-line-set-bg light-bg)
  (my/org-set-src-faces light-bg))

(when (>= emacs-major-version 27)
  (setq custom--inhibit-theme-enable nil))

;; I am trying a lot of themes dammit
(setq my/all-themes
      '(
        (wombat
         (progn
           (custom-theme-set-faces
            'wombat
            '(default ((t (:foreground "#c7c7c7" :background "#1a1a1a"))))
            '(font-lock-comment-face ((t (:foreground "#828987"))))
            '(font-lock-string-face ((t (:foreground "#4096c9"))))
            '(font-lock-doc-face ((t (:foreground "#348dc1"))))
            '(region ((t (:background "#515151"))))
            '(highlight ((t (:background "#3a3a3a"))))
            '(cursor ((t (:background "#d8d8d8"))))
            '(fringe ((t (:background "#2e2e2e"))))
            '(isearch ((t (:foreground "#242424" :background "#e5786d"))))
            '(vertical-border ((t (:foreground "#b0b0b0"))))
            '(show-paren-match ((t (:background "steelblue4" :weight bold))))
            '(mode-line-buffer-id ((t (:weight bold))))
            '(persp-selected-face ((t (:inherit font-lock-string-face :weight bold))))
            '(mode-line
              ((t (:background "#454545" :foreground "#d1d1d1" :box (:line-width 1 :color "#4a4a4a")))))
            '(mode-line-inactive
              ((t (:inherit mode-line :background "#282828" :foreground "#858585"))))
            ;; '(-operator-face ((t (:foreground "#e5786d"))))
            '(haskell-constructor-face ((t (:inherit haskell-type-face :weight normal))))
            '(ivy-grep-info ((t (:foreground "#a4bd64" :weight bold))))
            '(ag-hit-face   ((t (:foreground "#a4bd64" :weight bold))))
            '(sh-quoted-exec ((t (:foreground "#72c8db"))))
            )
           (my/after-set-theme)
           ))
        (zenburn
         (progn
           (custom-theme-set-faces
            'zenburn
            '(default ((t (:foreground "#dcdccc" :background "#3b3b3b"))))
            '(linum ((t (:inherit font-lock-comment-face :background "#323232"))))
            '(region ((t (:background "#5a5a5a"))))
            '(vertical-border ((t (:foreground "#999999"))))
            '(fringe ((t (:background "#434343"))))
            '(mode-line ((t
                          (:box
                           (:line-width -1 :color nil :style released-button)
                           :foreground "#a2c6a2" :background "#454545"))))
            '(mode-line-inactive ((t
                                   (:box
                                    (:line-width -1 :color nil :style released-button)
                                    :foreground "#5F7F5F" :background "#353535"))))
            '(powerline-active0 ((t (:background "#5F5F5F" :inherit mode-line))))
            '(powerline-active1 ((t (:inherit mode-line))))
            '(powerline-active2 ((t (:background "#383838" :inherit mode-line))))
            '(powerline-inactive0 ((t (:inherit mode-line-inactive))))
            '(powerline-inactive1 ((t (:inherit mode-line-inactive))))
            '(powerline-inactive2 ((t (:inherit mode-line-inactive))))
            '(mode-line-buffer-id ((t (:weight bold))))
            '(persp-selected-face ((t (:foreground "#d0bf8f" :weight bold))))
            '(diff-hl-insert ((t (:foreground "#789c78" :background "#3c543c"))))
            '(diff-hl-change ((t (:foreground "#79b3b5" :background "#425f61"))))
            '(diff-hl-delete ((t (:foreground "#ab8080" :background "#694848"))))
            '(fill-column-indicator ((t (:foreground "#505050"))))
            )
           (my/hl-line-set-bg) (my/org-set-src-faces)
           (setq pdf-view-midnight-colors '("#dcdccc" . "#383838"))
           ))
        (darktooth
         (progn
           (custom-theme-set-faces
            'darktooth
            '(default ((t (:foreground "#ddd7b4" :background "#222222"))))
            '(fringe ((t (:background "#2d2d2d"))))
            '(persp-selected-face ((t (:foreground "#8ec07c" :weight bold))))
            ;; '(font-lock-function-name-face ((t (:foreground "#74b8bc"))))
            '(font-lock-function-name-face ((t (:foreground "#afa08b"))))
            '(font-lock-preprocessor-face ((t (:foreground "#d787af"))))
            '(purescript-constructor-face ((t (:inherit haskell-constructor-face))))
            '(mode-line ((t (:box nil :foreground "#e5dfbc" :background "#4d4845"))))
            '(mode-line-inactive ((t (:box nil :foreground "#968a79" :background "#33302d"))))
            '(vertical-border ((t (:foreground "#a89984"))))
            '(markdown-pre-face ((t (:foreground "#8ec07c"))))
            '(anzu-mode-line ((t (:foreground "magenta" :weight bold))))
            '(anzu-mode-line-no-match ((t (:foreground "red" :weight bold))))
            '(powerline-active0 ((t (:background "#696461" :foreground "#e5dfbc"))))
            '(powerline-active1 ((t (:background "#55504d" :foreground "#e5dfbc"))))
            '(powerline-active2 ((t (:background "#433f3e" :foreground "#e5dfbc"))))
            '(powerline-inactive0 ((t (:inherit mode-line-inactive))))
            '(powerline-inactive1 ((t (:inherit powerline-inactive0))))
            '(powerline-inactive2 ((t (:inherit powerline-inactive0))))
            '(fill-column-indicator ((t (:foreground "#464646"))))
            )
           (my/after-set-theme)
           (setq pdf-view-midnight-colors '("#ddd7b4" . "#3d3d3d"))
           ))
        (nord
         (progn
           (custom-theme-set-faces
            'nord
            '(default ((t (:background "#1c222b" :foreground "#b6c1d3"))))
            '(mode-line ((t (:background "#3f4758" :foreground "#9ac9d7"))))
            '(mode-line-inactive ((t (:background "#2f343f" :foreground "#5e7591"))))
            '(powerline-inactive0 ((t (:inherit mode-line-inactive))))
            '(powerline-inactive1 ((t (:inherit mode-line-inactive))))
            '(powerline-inactive2 ((t (:inherit mode-line-inactive))))
            '(font-lock-doc-face ((t (:foreground "#97aa86"))))
            '(font-lock-preprocessor-face ((t (:foreground "#D08770"))))
            '(font-lock-variable-name-face ((t (:inherit default))))
            '(font-lock-comment-face ((t (:foreground "#707c95"))))
            '(font-lock-comment-delimiter-face ((t (:inherit font-lock-comment-face))))
            '(highlight-numbers-number ((t (:foreground "#B48EAD"))))
            '(haskell-pragma-face ((t (:foreground "#B48EAD"))))
            '(persp-selected-face ((t (:foreground "#A3BE8C" :weight bold))))
            '(fringe ((t (:background "#202830"))))
            '(region ((t (:background "#3b4353"))))
            '(shadow ((t (:foreground "#545d72"))))
            '(show-paren-match ((t (:background "#465d75" :weight bold))))
            '(lazy-highlight ((t (:background "#496665"))))
            '(fill-column-indicator ((t (:foreground "#434c5e"))))
            '(markdown-code-face ((t (:inherit font-lock-string-face))))
            '(rg-match-face ((t (:background "#35535b"))))
            '(hi-green ((t (:foreground "black" :background "#859c73"))))
            '(hi-blue ((t (:foreground "black" :background "#7da9b5"))))
            '(hi-pink ((t (:foreground "black" :background "#a37f9d"))))
            '(hi-green-b ((t (:foreground "#9cb586" :background "#3b4732" :weight bold))))
            '(hi-blue-b ((t (:foreground "#97c4c3" :background "#394b4f" :weight bold))))
            '(hi-red-b ((t (:foreground "#bf95b7" :background "#453341" :weight bold))))
            )
           (my/after-set-theme)
           ))
        ))

(defvar my/avail-themes '(wombat))
(defvar my/current-theme 0)
(defvar my/theme 'wombat)
(defvar my/theme-light-bg nil)

(defvar my/after-set-theme-hook nil
  "Hook called after setting a theme")

(defun my/set-theme (&optional theme-config light-bg)
  (let* ((theme-config (if (null theme-config)
                           (elt my/avail-themes my/current-theme)
                         theme-config))
         (theme (if (listp theme-config)
                    (car theme-config)
                  theme-config))
         (config (if (listp theme-config) (cadr theme-config) nil))
         (light-bg (if (listp theme-config)
                       (caddr theme-config)
                     light-bg)))
    (mapc 'disable-theme custom-enabled-themes)
    (load-theme theme t)
    (setq my/theme theme)
    (setq my/theme-light-bg light-bg)
    (eval config)
    (run-hooks 'my/after-set-theme-hook)))

(defun my/toggle-theme ()
  (interactive)
  (let* ((next-theme (mod (1+ my/current-theme) (length my/avail-themes)))
         (theme (elt my/avail-themes next-theme)))
    (setq my/current-theme next-theme)
    (my/set-theme)))

(defun my/refresh-theme ()
  (interactive)
  (my/set-theme)
  (setq linum-format 'dynamic))
#+END_SRC

