docs/index.html

<div id="outline-container-org17b7121" class="outline-2">
<h2 id="org17b7121"><span class="section-number-2">7</span> Theme</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">my/after-set-theme</span> (<span class="org-type">&amp;optional</span> light-bg)
  (<span class="org-keyword">setq</span> my/theme-light-bg (<span class="org-keyword">if</span> light-bg t nil))
  (my/diff-hl-set-fringe-faces light-bg)
  (my/hl-line-set-bg light-bg)
  (my/org-set-src-faces light-bg))

(<span class="org-keyword">when</span> (&gt;= emacs-major-version <span class="org-highlight-numbers-number">27</span>)
  (<span class="org-keyword">setq</span> custom--inhibit-theme-enable nil))

<span class="org-comment-delimiter">;; </span><span class="org-comment">I am trying a lot of themes dammit</span>
(<span class="org-keyword">setq</span> my/all-themes
      '(
        (wombat
         (<span class="org-keyword">progn</span>
           (custom-theme-set-faces
            'wombat
            '(default ((t (<span class="org-builtin">:foreground</span> <span class="org-string">"#c7c7c7"</span> <span class="org-builtin">:background</span> <span class="org-string">"#1a1a1a"</span>))))
            '(font-lock-comment-face ((t (<span class="org-builtin">:foreground</span> <span class="org-string">"#828987"</span>))))
            '(font-lock-string-face ((t (<span class="org-builtin">:foreground</span> <span class="org-string">"#4096c9"</span>))))
            '(font-lock-doc-face ((t (<span class="org-builtin">:foreground</span> <span class="org-string">"#348dc1"</span>))))
            '(region ((t (<span class="org-builtin">:background</span> <span class="org-string">"#515151"</span>))))
            '(highlight ((t (<span class="org-builtin">:background</span> <span class="org-string">"#3a3a3a"</span>))))
            '(cursor ((t (<span class="org-builtin">:background</span> <span class="org-string">"#d8d8d8"</span>))))
            '(fringe ((t (<span class="org-builtin">:background</span> <span class="org-string">"#2e2e2e"</span>))))
            '(isearch ((t (<span class="org-builtin">:foreground</span> <span class="org-string">"#242424"</span> <span class="org-builtin">:background</span> <span class="org-string">"#e5786d"</span>))))
            '(vertical-border ((t (<span class="org-builtin">:foreground</span> <span class="org-string">"#b0b0b0"</span>))))
            '(show-paren-match ((t (<span class="org-builtin">:background</span> <span class="org-string">"steelblue4"</span> <span class="org-builtin">:weight</span> bold))))
            '(mode-line-buffer-id ((t (<span class="org-builtin">:weight</span> bold))))
            '(persp-selected-face ((t (<span class="org-builtin">:inherit</span> font-lock-string-face <span class="org-builtin">:weight</span> bold))))
            '(mode-line
              ((t (<span class="org-builtin">:background</span> <span class="org-string">"#454545"</span> <span class="org-builtin">:foreground</span> <span class="org-string">"#d1d1d1"</span> <span class="org-builtin">:box</span> (<span class="org-builtin">:line-width</span> <span class="org-highlight-numbers-number">1</span> <span class="org-builtin">:color</span> <span class="org-string">"#4a4a4a"</span>)))))
            '(mode-line-inactive
              ((t (<span class="org-builtin">:inherit</span> mode-line <span class="org-builtin">:background</span> <span class="org-string">"#282828"</span> <span class="org-builtin">:foreground</span> <span class="org-string">"#858585"</span>))))
            <span class="org-comment-delimiter">;; </span><span class="org-comment">'(-operator-face ((t (:foreground "#e5786d"))))</span>
            '(haskell-constructor-face ((t (<span class="org-builtin">:inherit</span> haskell-type-face <span class="org-builtin">:weight</span> normal))))
            '(ivy-grep-info ((t (<span class="org-builtin">:foreground</span> <span class="org-string">"#a4bd64"</span> <span class="org-builtin">:weight</span> bold))))
            '(ag-hit-face   ((t (<span class="org-builtin">:foreground</span> <span class="org-string">"#a4bd64"</span> <span class="org-builtin">:weight</span> bold))))
            '(sh-quoted-exec ((t (<span class="org-builtin">:foreground</span> <span class="org-string">"#72c8db"</span>))))
            )
           (my/after-set-theme)
           ))
        (zenburn
         (<span class="org-keyword">progn</span>
           (custom-theme-set-faces
            'zenburn
            '(default ((t (<span class="org-builtin">:foreground</span> <span class="org-string">"#dcdccc"</span> <span class="org-builtin">:background</span> <span class="org-string">"#3f3f3f"</span>))))
            '(region ((t (<span class="org-builtin">:background</span> <span class="org-string">"#5a5a5a"</span>))))
            '(vertical-border ((t (<span class="org-builtin">:foreground</span> <span class="org-string">"#a5a5a5"</span>))))
            '(fringe ((t (<span class="org-builtin">:background</span> <span class="org-string">"#454545"</span>))))
            '(mode-line ((t
                          (<span class="org-builtin">:box</span>
                           (<span class="org-builtin">:line-width</span> <span class="org-highlight-numbers-number">-1</span> <span class="org-builtin">:color</span> nil <span class="org-builtin">:style</span> released-button)
                           <span class="org-builtin">:foreground</span> <span class="org-string">"#a2c6a2"</span> <span class="org-builtin">:background</span> <span class="org-string">"#454545"</span>))))
            '(mode-line-inactive ((t
                                   (<span class="org-builtin">:box</span>
                                    (<span class="org-builtin">:line-width</span> <span class="org-highlight-numbers-number">-1</span> <span class="org-builtin">:color</span> nil <span class="org-builtin">:style</span> released-button)
                                    <span class="org-builtin">:foreground</span> <span class="org-string">"#5F7F5F"</span> <span class="org-builtin">:background</span> <span class="org-string">"#353535"</span>))))
            '(powerline-active0 ((t (<span class="org-builtin">:background</span> <span class="org-string">"#5F5F5F"</span> <span class="org-builtin">:inherit</span> mode-line))))
            '(powerline-active1 ((t (<span class="org-builtin">:inherit</span> mode-line))))
            '(powerline-active2 ((t (<span class="org-builtin">:background</span> <span class="org-string">"#383838"</span> <span class="org-builtin">:inherit</span> mode-line))))
            '(powerline-inactive0 ((t (<span class="org-builtin">:inherit</span> mode-line-inactive))))
            '(powerline-inactive1 ((t (<span class="org-builtin">:inherit</span> mode-line-inactive))))
            '(powerline-inactive2 ((t (<span class="org-builtin">:inherit</span> mode-line-inactive))))
            '(mode-line-buffer-id ((t (<span class="org-builtin">:weight</span> bold))))
            '(persp-selected-face ((t (<span class="org-builtin">:foreground</span> <span class="org-string">"#d0bf8f"</span> <span class="org-builtin">:weight</span> bold))))
            '(diff-hl-insert ((t (<span class="org-builtin">:foreground</span> <span class="org-string">"#789c78"</span> <span class="org-builtin">:background</span> <span class="org-string">"#3c543c"</span>))))
            '(diff-hl-change ((t (<span class="org-builtin">:foreground</span> <span class="org-string">"#79b3b5"</span> <span class="org-builtin">:background</span> <span class="org-string">"#425f61"</span>))))
            '(diff-hl-delete ((t (<span class="org-builtin">:foreground</span> <span class="org-string">"#ab8080"</span> <span class="org-builtin">:background</span> <span class="org-string">"#694848"</span>))))
            '(fill-column-indicator ((t (<span class="org-builtin">:foreground</span> <span class="org-string">"#505050"</span>))))
            )
           (my/hl-line-set-bg) (my/org-set-src-faces)
           (<span class="org-keyword">setq</span> pdf-view-midnight-colors '(<span class="org-string">"#dcdccc"</span> . <span class="org-string">"#383838"</span>))
           ))
        (darktooth
         (<span class="org-keyword">progn</span>
           (custom-theme-set-faces
            'darktooth
            '(default ((t (<span class="org-builtin">:foreground</span> <span class="org-string">"#ddd7b4"</span> <span class="org-builtin">:background</span> <span class="org-string">"#222222"</span>))))
            '(fringe ((t (<span class="org-builtin">:background</span> <span class="org-string">"#2d2d2d"</span>))))
            '(persp-selected-face ((t (<span class="org-builtin">:foreground</span> <span class="org-string">"#8ec07c"</span> <span class="org-builtin">:weight</span> bold))))
            <span class="org-comment-delimiter">;; </span><span class="org-comment">'(font-lock-function-name-face ((t (:foreground "#74b8bc"))))</span>
            '(font-lock-function-name-face ((t (<span class="org-builtin">:foreground</span> <span class="org-string">"#afa08b"</span>))))
            '(font-lock-preprocessor-face ((t (<span class="org-builtin">:foreground</span> <span class="org-string">"#d787af"</span>))))
            '(purescript-constructor-face ((t (<span class="org-builtin">:inherit</span> haskell-constructor-face))))
            '(mode-line ((t (<span class="org-builtin">:box</span> nil <span class="org-builtin">:foreground</span> <span class="org-string">"#e5dfbc"</span> <span class="org-builtin">:background</span> <span class="org-string">"#4d4845"</span>))))
            '(mode-line-inactive ((t (<span class="org-builtin">:box</span> nil <span class="org-builtin">:foreground</span> <span class="org-string">"#968a79"</span> <span class="org-builtin">:background</span> <span class="org-string">"#33302d"</span>))))
            '(vertical-border ((t (<span class="org-builtin">:foreground</span> <span class="org-string">"#a89984"</span>))))
            '(markdown-pre-face ((t (<span class="org-builtin">:foreground</span> <span class="org-string">"#8ec07c"</span>))))
            '(anzu-mode-line ((t (<span class="org-builtin">:foreground</span> <span class="org-string">"magenta"</span> <span class="org-builtin">:weight</span> bold))))
            '(anzu-mode-line-no-match ((t (<span class="org-builtin">:foreground</span> <span class="org-string">"red"</span> <span class="org-builtin">:weight</span> bold))))
            '(powerline-active0 ((t (<span class="org-builtin">:background</span> <span class="org-string">"#696461"</span> <span class="org-builtin">:foreground</span> <span class="org-string">"#e5dfbc"</span>))))
            '(powerline-active1 ((t (<span class="org-builtin">:background</span> <span class="org-string">"#55504d"</span> <span class="org-builtin">:foreground</span> <span class="org-string">"#e5dfbc"</span>))))
            '(powerline-active2 ((t (<span class="org-builtin">:background</span> <span class="org-string">"#433f3e"</span> <span class="org-builtin">:foreground</span> <span class="org-string">"#e5dfbc"</span>))))
            '(powerline-inactive0 ((t (<span class="org-builtin">:inherit</span> mode-line-inactive))))
            '(powerline-inactive1 ((t (<span class="org-builtin">:inherit</span> powerline-inactive0))))
            '(powerline-inactive2 ((t (<span class="org-builtin">:inherit</span> powerline-inactive0))))
            '(fill-column-indicator ((t (<span class="org-builtin">:foreground</span> <span class="org-string">"#464646"</span>))))
            )
           (my/after-set-theme)
           (<span class="org-keyword">setq</span> pdf-view-midnight-colors '(<span class="org-string">"#ddd7b4"</span> . <span class="org-string">"#3d3d3d"</span>))
           ))
        (nord
         (<span class="org-keyword">progn</span>
           (custom-theme-set-faces
            'nord
            '(default ((t (<span class="org-builtin">:background</span> <span class="org-string">"#1c222b"</span> <span class="org-builtin">:foreground</span> <span class="org-string">"#b6c1d3"</span>))))
            '(mode-line ((t (<span class="org-builtin">:background</span> <span class="org-string">"#3f4758"</span> <span class="org-builtin">:foreground</span> <span class="org-string">"#9ac9d7"</span>))))
            '(mode-line-inactive ((t (<span class="org-builtin">:background</span> <span class="org-string">"#2f343f"</span> <span class="org-builtin">:foreground</span> <span class="org-string">"#5e7591"</span>))))
            '(powerline-inactive0 ((t (<span class="org-builtin">:inherit</span> mode-line-inactive))))
            '(powerline-inactive1 ((t (<span class="org-builtin">:inherit</span> mode-line-inactive))))
            '(powerline-inactive2 ((t (<span class="org-builtin">:inherit</span> mode-line-inactive))))
            '(font-lock-doc-face ((t (<span class="org-builtin">:foreground</span> <span class="org-string">"#97aa86"</span>))))
            '(font-lock-preprocessor-face ((t (<span class="org-builtin">:foreground</span> <span class="org-string">"#D08770"</span>))))
            '(font-lock-variable-name-face ((t (<span class="org-builtin">:inherit</span> default))))
            '(font-lock-comment-face ((t (<span class="org-builtin">:foreground</span> <span class="org-string">"#707c95"</span>))))
            '(font-lock-comment-delimiter-face ((t (<span class="org-builtin">:inherit</span> font-lock-comment-face))))
            '(highlight-numbers-number ((t (<span class="org-builtin">:foreground</span> <span class="org-string">"#B48EAD"</span>))))
            '(haskell-pragma-face ((t (<span class="org-builtin">:foreground</span> <span class="org-string">"#B48EAD"</span>))))
            '(persp-selected-face ((t (<span class="org-builtin">:foreground</span> <span class="org-string">"#A3BE8C"</span> <span class="org-builtin">:weight</span> bold))))
            '(fringe ((t (<span class="org-builtin">:background</span> <span class="org-string">"#202830"</span>))))
            '(region ((t (<span class="org-builtin">:background</span> <span class="org-string">"#3b4353"</span>))))
            '(shadow ((t (<span class="org-builtin">:foreground</span> <span class="org-string">"#545d72"</span>))))
            '(show-paren-match ((t (<span class="org-builtin">:background</span> <span class="org-string">"#465d75"</span> <span class="org-builtin">:weight</span> bold))))
            '(lazy-highlight ((t (<span class="org-builtin">:background</span> <span class="org-string">"#496665"</span>))))
            '(fill-column-indicator ((t (<span class="org-builtin">:foreground</span> <span class="org-string">"#434c5e"</span>))))
            '(markdown-code-face ((t (<span class="org-builtin">:inherit</span> font-lock-string-face))))
            '(rg-match-face ((t (<span class="org-builtin">:background</span> <span class="org-string">"#35535b"</span>))))
            '(hi-green ((t (<span class="org-builtin">:foreground</span> <span class="org-string">"black"</span> <span class="org-builtin">:background</span> <span class="org-string">"#859c73"</span>))))
            '(hi-blue ((t (<span class="org-builtin">:foreground</span> <span class="org-string">"black"</span> <span class="org-builtin">:background</span> <span class="org-string">"#7da9b5"</span>))))
            '(hi-pink ((t (<span class="org-builtin">:foreground</span> <span class="org-string">"black"</span> <span class="org-builtin">:background</span> <span class="org-string">"#a37f9d"</span>))))
            '(hi-green-b ((t (<span class="org-builtin">:foreground</span> <span class="org-string">"#9cb586"</span> <span class="org-builtin">:background</span> <span class="org-string">"#3b4732"</span> <span class="org-builtin">:weight</span> bold))))
            '(hi-blue-b ((t (<span class="org-builtin">:foreground</span> <span class="org-string">"#97c4c3"</span> <span class="org-builtin">:background</span> <span class="org-string">"#394b4f"</span> <span class="org-builtin">:weight</span> bold))))
            '(hi-red-b ((t (<span class="org-builtin">:foreground</span> <span class="org-string">"#bf95b7"</span> <span class="org-builtin">:background</span> <span class="org-string">"#453341"</span> <span class="org-builtin">:weight</span> bold))))
            )
           (my/after-set-theme)
           ))
        ))

(<span class="org-keyword">defvar</span> <span class="org-variable-name">my/avail-themes</span> '(wombat))
(<span class="org-keyword">defvar</span> <span class="org-variable-name">my/current-theme</span> <span class="org-highlight-numbers-number">0</span>)
(<span class="org-keyword">defvar</span> <span class="org-variable-name">my/theme</span> 'wombat)
(<span class="org-keyword">defvar</span> <span class="org-variable-name">my/theme-light-bg</span> nil)

(<span class="org-keyword">defvar</span> <span class="org-variable-name">my/after-set-theme-hook</span> nil
  <span class="org-doc">"Hook called after setting a theme"</span>)

(<span class="org-keyword">defun</span> <span class="org-function-name">my/set-theme</span> (<span class="org-type">&amp;optional</span> theme-config light-bg)
  (<span class="org-keyword">let*</span> ((theme-config (<span class="org-keyword">if</span> (null theme-config)
                           (elt my/avail-themes my/current-theme)
                         theme-config))
         (theme (<span class="org-keyword">if</span> (listp theme-config)
                    (car theme-config)
                  theme-config))
         (config (<span class="org-keyword">if</span> (listp theme-config) (cadr theme-config) nil))
         (light-bg (<span class="org-keyword">if</span> (listp theme-config)
                       (caddr theme-config)
                     light-bg)))
    (mapc 'disable-theme custom-enabled-themes)
    (load-theme theme t)
    (<span class="org-keyword">setq</span> my/theme theme)
    (<span class="org-keyword">setq</span> my/theme-light-bg light-bg)
    (eval config)
    (run-hooks 'my/after-set-theme-hook)))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/toggle-theme</span> ()
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">let*</span> ((next-theme (mod (1+ my/current-theme) (length my/avail-themes)))
         (theme (elt my/avail-themes next-theme)))
    (<span class="org-keyword">setq</span> my/current-theme next-theme)
    (my/set-theme)))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/refresh-theme</span> ()
  (<span class="org-keyword">interactive</span>)
  (my/set-theme)
  (<span class="org-keyword">setq</span> linum-format 'dynamic))
</pre>
</div>
</div>
</div>
