docs/index.html

<div id="outline-container-org46b74c7" class="outline-3">
<h3 id="org46b74c7"><span class="section-number-3">9.4</span> Helpers</h3>
<div class="outline-text-3" id="text-9-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">my/git-blame-current-line</span> ()
  <span class="org-doc">"Runs `git blame` on the current line and</span>
<span class="org-doc">   adds the commit id to the kill ring"</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">let*</span> ((line-number (<span class="org-keyword">save-excursion</span>
                        (goto-char (point-at-bol))
                        (+ <span class="org-highlight-numbers-number">1</span> (count-lines <span class="org-highlight-numbers-number">1</span> (point)))))
         (line-arg (format <span class="org-string">"%d,%d"</span> line-number line-number))
         (commit-buf (generate-new-buffer <span class="org-string">"*git-blame-line-commit*"</span>)))
    (call-process <span class="org-string">"git"</span> nil commit-buf nil
                  <span class="org-string">"blame"</span> (buffer-file-name) <span class="org-string">"-L"</span> line-arg)
    (<span class="org-keyword">let*</span> ((commit-id (<span class="org-keyword">with-current-buffer</span> commit-buf
                        (buffer-substring <span class="org-highlight-numbers-number">1</span> <span class="org-highlight-numbers-number">9</span>)))
           (log-buf (generate-new-buffer <span class="org-string">"*git-blame-line-log*"</span>)))
      (kill-new commit-id)
      (call-process <span class="org-string">"git"</span> nil log-buf nil
                    <span class="org-string">"log"</span> <span class="org-string">"-1"</span> <span class="org-string">"--pretty=%h   %an   %s"</span> commit-id)
      (<span class="org-keyword">with-current-buffer</span> log-buf
        (message <span class="org-string">"Line %d: %s"</span>
                 line-number
                 (replace-regexp-in-string <span class="org-string">"\n\\'"</span> <span class="org-string">""</span> (buffer-string))))
      (kill-buffer log-buf))
    (kill-buffer commit-buf)))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org427a2f6" class="outline-2">
<h2 id="org427a2f6"><span class="section-number-2">10</span> Keybindings</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-org22da121" class="outline-3">
<h3 id="org22da121"><span class="section-number-3">10.1</span> keybind to command mapping</h3>
<div class="outline-text-3" id="text-10-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> my/leader-keys
      '(
        (<span class="org-string">"SPC"</span> display-fill-column-indicator-mode)

        (<span class="org-string">"a"</span> align-regexp)

        <span class="org-comment-delimiter">;; </span><span class="org-comment">dired</span>
        (<span class="org-string">"dn"</span> find-name-dired)
        (<span class="org-string">"dg"</span> find-grep-dired)
        (<span class="org-string">"dv"</span> my/git-grep-dired)

        <span class="org-comment-delimiter">;; </span><span class="org-comment">errors</span>
        (<span class="org-string">"el"</span> my/toggle-flycheck-error-list)

        <span class="org-comment-delimiter">;; </span><span class="org-comment">browsing/files</span>
        (<span class="org-string">"fc"</span> my/copy-file-path)
        (<span class="org-string">"fd"</span> pwd)
        (<span class="org-string">"fp"</span> my/try-open-dominating-file)
        (<span class="org-string">"fs"</span> my/create-scratch-buffer-with-mode)

        <span class="org-comment-delimiter">;; </span><span class="org-comment">git/vc</span>
        (<span class="org-string">"gb"</span> my/git-blame-current-line)

        (<span class="org-string">"h"</span>  help)

        <span class="org-comment-delimiter">;; </span><span class="org-comment">insert</span>
        (<span class="org-string">"iu"</span> counsel-unicode-char)

        <span class="org-comment-delimiter">;; </span><span class="org-comment">project</span>
        (<span class="org-string">"pa"</span> counsel-projectile-ag)
        (<span class="org-string">"pr"</span> counsel-projectile-rg)
        (<span class="org-string">"pt"</span> my/counsel-ag-todos-global)

        <span class="org-comment-delimiter">;; </span><span class="org-comment">show/display</span>
        (<span class="org-string">"sd"</span> pwd)
        <span class="org-comment-delimiter">;; </span><span class="org-comment">find/search</span>
        (<span class="org-string">"sa"</span> ag)
        (<span class="org-string">"sr"</span> rg)
        (<span class="org-string">"sca"</span> counsel-ag)
        (<span class="org-string">"scr"</span> counsel-rg)
        (<span class="org-string">"sr"</span> rgrep)

        <span class="org-comment-delimiter">;; </span><span class="org-comment">toggle</span>
        (<span class="org-string">"t8"</span> display-fill-column-indicator-mode)
        (<span class="org-string">"tc"</span> global-company-mode)
        (<span class="org-string">"tf"</span> my/toggle-font)
        (<span class="org-string">"tg"</span> global-diff-hl-mode)
        (<span class="org-string">"tl"</span> my/line-numbers)
        (<span class="org-string">"to"</span> global-symbol-overlay-mode)
        (<span class="org-string">"ti"</span> highlight-indent-guides-mode)
        (<span class="org-string">"th"</span> hl-line-mode)
        (<span class="org-string">"ts"</span> flycheck-mode)
        (<span class="org-string">"tt"</span> my/toggle-theme)
        (<span class="org-string">"tw"</span> toggle-truncate-lines)

        <span class="org-comment-delimiter">;; </span><span class="org-comment">ui</span>
        (<span class="org-string">"uh"</span> rainbow-mode)
        (<span class="org-string">"um"</span> (<span class="org-keyword">lambda</span> () (<span class="org-keyword">interactive</span>) (call-interactively 'tool-bar-mode) (call-interactively 'menu-bar-mode)))
        (<span class="org-string">"up"</span> rainbow-delimiters-mode)

        <span class="org-comment-delimiter">;; </span><span class="org-comment">windows</span>
        (<span class="org-string">"wf"</span> my/window-fixed)
        (<span class="org-string">"wd"</span> my/window-dedicated)

        <span class="org-comment-delimiter">;; </span><span class="org-comment">theme</span>
        (<span class="org-string">"Ts"</span> counsel-load-theme)

        (<span class="org-string">"Q"</span> evil-local-mode)
        ))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgabc6035" class="outline-3">
<h3 id="orgabc6035"><span class="section-number-3">10.2</span> setup keybindings</h3>
<div class="outline-text-3" id="text-10-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(define-prefix-command 'my/leader-map)

<span class="org-comment-delimiter">;; </span><span class="org-comment">(define-key ctl-x-map "m" 'my/leader-map)</span>
(define-prefix-command 'my/leader-map)
(global-set-key (kbd <span class="org-string">"C-c m"</span>) 'my/leader-map)

(<span class="org-keyword">dolist</span> (i my/leader-keys)
  (<span class="org-keyword">let</span> ((k (car i))
        (f (cadr i)))
    (define-key my/leader-map (kbd k) f)))

(define-prefix-command 'my/major-mode-map)

(<span class="org-keyword">if</span> is-gui
    (<span class="org-keyword">progn</span>
      <span class="org-comment-delimiter">;; </span><span class="org-comment">distinguish `C-m` from `RET`</span>
      (define-key input-decode-map [?\C-m] [C-m])
      <span class="org-comment-delimiter">;; </span><span class="org-comment">distinguish `C-i` from `TAB`</span>
      <span class="org-comment-delimiter">;; </span><span class="org-comment">(define-key input-decode-map [?\C-i] [C-i])</span>
      (global-set-key (kbd <span class="org-string">"C-c &lt;C-m&gt;"</span>) 'my/leader-map)
      (<span class="org-keyword">setq</span> my/major-mode-map-key <span class="org-string">"&lt;C-m&gt;"</span>))
  (<span class="org-keyword">setq</span> my/major-mode-map-key <span class="org-string">"C-c m m"</span>))

<span class="org-comment-delimiter">;; </span><span class="org-comment">on hold</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">(defun my/define-major-mode-keys (hook &amp;rest combinations)</span>
<span class="org-comment-delimiter">;;   </span><span class="org-comment">"Bind all pairs of (key . function) under `</span><span class="org-comment"><span class="org-constant">my/major-mode-map-key</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">The keys are bound after `</span><span class="org-comment"><span class="org-constant">hook</span></span><span class="org-comment">'."</span>
<span class="org-comment-delimiter">;;   </span><span class="org-comment">(add-hook</span>
<span class="org-comment-delimiter">;;    </span><span class="org-comment">hook</span>
<span class="org-comment-delimiter">;;    </span><span class="org-comment">`(lambda ()</span>
<span class="org-comment-delimiter">;;       </span><span class="org-comment">(let ((map (make-sparse-keymap)))</span>
<span class="org-comment-delimiter">;;         </span><span class="org-comment">(local-set-key (kbd ,my/major-mode-map-key) map)</span>
<span class="org-comment-delimiter">;;         </span><span class="org-comment">(dolist (comb (quote ,combinations))</span>
<span class="org-comment-delimiter">;;           </span><span class="org-comment">(define-key map (kbd (car comb)) (cdr comb)))))))</span>

(<span class="org-keyword">defun</span> <span class="org-function-name">my/define-major-mode-key</span> (mode key func)
  (<span class="org-keyword">let*</span> ((map-symbol (intern (format <span class="org-string">"my/%s-map"</span> mode)))
         (hook (intern (format <span class="org-string">"%s-hook"</span> mode)))
         (map
          (<span class="org-keyword">if</span> (boundp map-symbol)
              (symbol-value map-symbol)
            (<span class="org-keyword">progn</span>
              (<span class="org-keyword">let</span> ((map- (make-sparse-keymap)))
                (add-hook
                 hook
                 `(<span class="org-keyword">lambda</span> ()
                    (local-set-key (kbd ,my/major-mode-map-key) (<span class="org-keyword">quote</span> ,map-))))
                (set (intern (format <span class="org-string">"my/%s-map"</span> mode)) map-))))))
    (define-key map (kbd key) func)
    (evil-leader/set-key-for-mode mode (kbd (format <span class="org-string">"m %s"</span> key)) func)))

(<span class="org-keyword">if</span> is-gui
    (global-set-key (kbd <span class="org-string">"&lt;C-m&gt;"</span>) 'my/major-mode-map)
  (global-set-key (kbd <span class="org-string">"C-c m m"</span>) 'my/major-mode-map))
</pre>
</div>
</div>
</div>
</div>
