docs/index.html

<div id="outline-container-org102d665" class="outline-2">
<h2 id="org102d665"><span class="section-number-2">11</span> Evil-mode</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-org668e357" class="outline-3">
<h3 id="org668e357"><span class="section-number-3">11.1</span> evil-mode setup</h3>
<div class="outline-text-3" id="text-11-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> <span class="org-constant">evil-leader</span>
  <span class="org-builtin">:hook</span> (evil-local-mode . evil-leader-mode)
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">(global-evil-leader-mode)</span>
  (evil-leader/set-leader <span class="org-string">"&lt;SPC&gt;"</span>)
  (<span class="org-keyword">dolist</span> (i my/leader-keys)
    (<span class="org-keyword">let</span> ((k (car i))
          (f (cadr i)))
      (evil-leader/set-key k f))))

(<span class="org-keyword">use-package</span> <span class="org-constant">evil-visualstar</span>
  <span class="org-builtin">:hook</span> (evil-local-mode . evil-visualstar-mode)
  <span class="org-builtin">:ensure</span> t)

(<span class="org-keyword">use-package</span> <span class="org-constant">evil</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:hook</span> ((prog-mode
          text-mode
          haskell-cabal-mode
          coq-mode easycrypt-mode phox-mode
          conf-unix-mode
          conf-colon-mode
          conf-space-mode
          conf-windows-mode
          conf-toml-mode)
         . evil-local-mode)
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">setq</span> evil-want-C-i-jump nil
        evil-intercept-esc t
        evil-mode-line-format '(before . mode-line-front-space))
  <span class="org-comment-delimiter">;; </span><span class="org-comment">(setq evil-move-cursor-back nil)  ;; works better with lisp navigation</span>
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">defun</span> <span class="org-function-name">my/make-emacs-mode</span> (mode)
    <span class="org-doc">"Make `</span><span class="org-doc"><span class="org-constant">mode</span></span><span class="org-doc">' use emacs keybindings."</span>
    (delete mode evil-insert-state-modes)
    (add-to-list 'evil-emacs-state-modes mode))

  (<span class="org-keyword">defun</span> <span class="org-function-name">my/vim-navigation</span> (mode-map <span class="org-type">&amp;optional</span> extended)
    (define-key mode-map (kbd <span class="org-string">"h"</span>) #'backward-char)
    (define-key mode-map (kbd <span class="org-string">"j"</span>) #'next-line)
    (define-key mode-map (kbd <span class="org-string">"k"</span>) #'previous-line)
    (define-key mode-map (kbd <span class="org-string">"l"</span>) #'forward-char)
    (<span class="org-keyword">when</span> extended
      (define-key mode-map (kbd <span class="org-string">"w"</span>) #'forward-word)
      (define-key mode-map (kbd <span class="org-string">"b"</span>) #'backward-word)))

  <span class="org-comment-delimiter">;; </span><span class="org-comment">don't need C-n, C-p</span>
  (define-key evil-insert-state-map (kbd <span class="org-string">"C-n"</span>) nil)
  (define-key evil-insert-state-map (kbd <span class="org-string">"C-p"</span>) nil)

  <span class="org-comment-delimiter">;; </span><span class="org-comment">magit</span>
  (<span class="org-keyword">evil-define-key</span> 'normal magit-blame-mode-map (kbd <span class="org-string">"q"</span>) 'magit-blame-quit)

  <span class="org-comment-delimiter">;; </span><span class="org-comment">intercept ESC when running in terminal</span>
  (evil-esc-mode)

  <span class="org-comment-delimiter">;; </span><span class="org-comment">move search result to center of the screen</span>
  (<span class="org-keyword">defadvice</span> <span class="org-function-name">evil-search-next</span>
      (after advice-for-evil-search-next activate)
    (evil-scroll-line-to-center (line-number-at-pos)))

  (<span class="org-keyword">defadvice</span> <span class="org-function-name">evil-search-previous</span>
      (after advice-for-evil-search-previous activate)
    (evil-scroll-line-to-center (line-number-at-pos)))

  <span class="org-comment-delimiter">;; </span><span class="org-comment">this is needed to be able to use C-h</span>
  (global-set-key (kbd <span class="org-string">"C-h"</span>) 'help)
  (define-key evil-normal-state-map (kbd <span class="org-string">"C-h"</span>) 'undefined)
  (define-key evil-insert-state-map (kbd <span class="org-string">"C-h"</span>) 'undefined)
  (define-key evil-visual-state-map (kbd <span class="org-string">"C-h"</span>) 'undefined)

  (define-key evil-emacs-state-map (kbd <span class="org-string">"C-h"</span>) 'help)
  (define-key evil-insert-state-map (kbd <span class="org-string">"C-k"</span>) nil)

  (define-key evil-normal-state-map (kbd <span class="org-string">"M-."</span>) nil)

  (define-key evil-normal-state-map (kbd <span class="org-string">"C-h"</span>) 'evil-window-left)
  (define-key evil-normal-state-map (kbd <span class="org-string">"C-j"</span>) 'evil-window-down)
  (define-key evil-normal-state-map (kbd <span class="org-string">"C-k"</span>) 'evil-window-up)
  (define-key evil-normal-state-map (kbd <span class="org-string">"C-l"</span>) 'evil-window-right)

  (define-key evil-normal-state-map (kbd <span class="org-string">";"</span>) 'evil-ex)
  (define-key evil-visual-state-map (kbd <span class="org-string">";"</span>) 'evil-ex)
  (<span class="org-keyword">evil-ex-define-cmd</span> <span class="org-string">"sv"</span> 'evil-window-split)

  (define-key evil-normal-state-map (kbd <span class="org-string">"C-p"</span>) 'counsel-projectile-find-file)

  (define-key evil-insert-state-map (kbd <span class="org-string">"C-M-i"</span>) 'company-complete)

  (define-key evil-visual-state-map (kbd <span class="org-string">"&lt;"</span>) #'(lambda ()
                                                  (<span class="org-keyword">interactive</span>)
                                                  (<span class="org-keyword">progn</span>
                                                    (call-interactively 'evil-shift-left)
                                                    (execute-kbd-macro <span class="org-string">"gv"</span>))))

  (define-key evil-visual-state-map (kbd <span class="org-string">"&gt;"</span>) #'(lambda ()
                                                  (<span class="org-keyword">interactive</span>)
                                                  (<span class="org-keyword">progn</span>
                                                    (call-interactively 'evil-shift-right)
                                                    (execute-kbd-macro <span class="org-string">"gv"</span>))))

  <span class="org-comment-delimiter">;; </span><span class="org-comment">redefine so that $ doesn't include the EOL char</span>
  (<span class="org-keyword">setq</span> my/evil-$-include-eol nil)
  (<span class="org-keyword">evil-define-motion</span> <span class="org-function-name">evil-end-of-line</span> (count)
    <span class="org-doc">"Move the cursor to the end of the current line.</span>

<span class="org-doc">If COUNT is given, move COUNT - 1 lines downward first."</span>
    <span class="org-builtin">:type</span> inclusive
    (move-end-of-line count)
    (<span class="org-keyword">when</span> evil-track-eol
      (<span class="org-keyword">setq</span> temporary-goal-column most-positive-fixnum
            this-command 'next-line))
    (<span class="org-keyword">unless</span> (<span class="org-keyword">and</span> (evil-visual-state-p) my/evil-$-include-eol)
      (evil-adjust-cursor)
      (<span class="org-keyword">when</span> (eolp)
        <span class="org-comment-delimiter">;; </span><span class="org-comment">prevent "c$" and "d$" from deleting blank lines</span>
        (<span class="org-keyword">setq</span> evil-this-type 'exclusive))))

  <span class="org-comment-delimiter">;; </span><span class="org-comment">https://github.com/emacs-evil/evil-surround/issues/141</span>
  (<span class="org-keyword">defmacro</span> <span class="org-function-name">my/evil-define-text-object</span> (name key start-regex end-regex)
    (<span class="org-keyword">let</span> ((inner-name (make-symbol (concat <span class="org-string">"evil-inner-"</span> name)))
          (outer-name (make-symbol (concat <span class="org-string">"evil-a-"</span> name))))
      `(<span class="org-keyword">progn</span>
         (<span class="org-keyword">evil-define-text-object</span> ,inner-name (count <span class="org-type">&amp;optional</span> beg end type)
           (evil-select-paren ,start-regex ,end-regex beg end type count nil))
         (<span class="org-keyword">evil-define-text-object</span> ,outer-name (count <span class="org-type">&amp;optional</span> beg end type)
           (evil-select-paren ,start-regex ,end-regex beg end type count t))
         (define-key evil-inner-text-objects-map ,key #',inner-name)
         (define-key evil-outer-text-objects-map ,key #',outer-name))))
  )
</pre>
</div>
</div>
</div>
