docs/index.html

<div id="outline-container-org18ed4f0" class="outline-3">
<h3 id="org18ed4f0"><span class="section-number-3">11.2</span> evil packages that can be used without evil-mode</h3>
<div class="outline-text-3" id="text-11-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> <span class="org-constant">evil-nerd-commenter</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:bind</span> (<span class="org-string">"M-;"</span> . evilnc-comment-or-uncomment-lines)
  <span class="org-builtin">:init</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">evilnc toggles instead of commenting/uncommenting</span>
  (<span class="org-keyword">setq</span> evilnc-invert-comment-line-by-line t))

(<span class="org-keyword">use-package</span> <span class="org-constant">evil-surround</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:hook</span> (after-init . global-evil-surround-mode)
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">evil-define-key</span> 'visual evil-surround-mode-map <span class="org-string">"s"</span> 'evil-surround-region)
  (<span class="org-keyword">defconst</span> <span class="org-variable-name">my/mark-active-alist</span>
    `((mark-active
       ,@(<span class="org-keyword">let</span> ((m (make-sparse-keymap)))
           (define-key m (kbd <span class="org-string">"C-c s"</span>) 'evil-surround-region)
           m))))
  (add-to-list 'emulation-mode-map-alists 'my/mark-active-alist))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org9e9a5c1" class="outline-2">
<h2 id="org9e9a5c1"><span class="section-number-2">12</span> Hybrid input mode</h2>
<div class="outline-text-2" id="text-12">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">with-eval-after-load</span> 'evil
  (<span class="org-keyword">defcustom</span> <span class="org-variable-name">hybrid-mode-default-state</span> 'normal
    <span class="org-doc">"Value of `</span><span class="org-doc"><span class="org-constant">evil-default-state</span></span><span class="org-doc">' for hybrid-mode."</span>
    <span class="org-builtin">:group</span> 'my
    <span class="org-builtin">:type</span> 'symbol)

  (<span class="org-keyword">defcustom</span> <span class="org-variable-name">hybrid-mode-enable-evilified-state</span> t
    <span class="org-doc">"If non nil then evilified states is enabled in buffer supporting it."</span>
    <span class="org-builtin">:group</span> 'my
    <span class="org-builtin">:type</span> 'boolean)

  (<span class="org-keyword">defvar</span> <span class="org-variable-name">hybrid-mode-default-state-backup</span> evil-default-state
    <span class="org-doc">"Backup of `</span><span class="org-doc"><span class="org-constant">evil-default-state</span></span><span class="org-doc">'."</span>)

  (<span class="org-keyword">defadvice</span> <span class="org-function-name">evil-insert-state</span> (around hybrid-insert-to-hybrid-state disable)
    <span class="org-doc">"Forces Hybrid state."</span>
    (evil-hybrid-state))

  (<span class="org-keyword">defadvice</span> <span class="org-function-name">evil-evilified-state</span> (around hybrid-evilified-to-hybrid-state disable)
    <span class="org-doc">"Forces Hybrid state."</span>
    (<span class="org-keyword">if</span> (equal <span class="org-highlight-numbers-number">-1</span> (ad-get-arg <span class="org-highlight-numbers-number">0</span>))
        ad-do-it
      (<span class="org-keyword">if</span> hybrid-mode-enable-evilified-state
          ad-do-it
        <span class="org-comment-delimiter">;; </span><span class="org-comment">seems better to set the emacs state instead of hybrid for evilified</span>
        <span class="org-comment-delimiter">;; </span><span class="org-comment">buffers</span>
        (evil-emacs-state))))

<span class="org-comment-delimiter">;;;</span><span class="org-comment">###</span><span class="org-comment"><span class="org-warning">autoload</span></span>
  (<span class="org-keyword">define-minor-mode</span> <span class="org-function-name">hybrid-mode</span>
    <span class="org-doc">"Global minor mode to replace insert state by hybrid state."</span>
    <span class="org-builtin">:global</span> t
    <span class="org-builtin">:lighter</span> <span class="org-string">""</span>
    <span class="org-builtin">:group</span> 'my
    (<span class="org-keyword">if</span> hybrid-mode
        (enable-hybrid-editing-style)
      (disable-hybrid-editing-style)))

  (<span class="org-keyword">defun</span> <span class="org-function-name">enable-hybrid-editing-style</span> ()
    <span class="org-doc">"Enable the hybrid editing style."</span>
    (<span class="org-keyword">setq</span> hybrid-mode-default-state-backup evil-default-state
          evil-default-state hybrid-mode-default-state)
    <span class="org-comment-delimiter">;; </span><span class="org-comment">replace evil states by `hybrid state'</span>
    (ad-enable-advice 'evil-insert-state
                      'around 'hybrid-insert-to-hybrid-state)
    (ad-enable-advice 'evil-evilified-state
                      'around 'hybrid-evilified-to-hybrid-state)
    (ad-activate 'evil-insert-state)
    (ad-activate 'evil-evilified-state)
    <span class="org-comment-delimiter">;; </span><span class="org-comment">key bindings hooks for dynamic switching of editing styles</span>
    (run-hook-with-args 'spacemacs-editing-style-hook 'hybrid)
    <span class="org-comment-delimiter">;; </span><span class="org-comment">initiate `hybrid state'</span>
    )

  (<span class="org-keyword">defun</span> <span class="org-function-name">disable-hybrid-editing-style</span> ()
    <span class="org-doc">"Disable the hybrid editing style (reverting to 'vim style)."</span>
    (<span class="org-keyword">setq</span> evil-default-state hybrid-mode-default-state-backup)
    <span class="org-comment-delimiter">;; </span><span class="org-comment">restore evil states</span>
    (ad-disable-advice 'evil-insert-state
                       'around 'hybrid-insert-to-hybrid-state)
    (ad-disable-advice 'evil-evilified-state
                       'around 'hybrid-evilified-to-hybrid-state)
    (ad-activate 'evil-insert-state)
    (ad-activate 'evil-evilified-state)
    <span class="org-comment-delimiter">;; </span><span class="org-comment">restore key bindings</span>
    (run-hook-with-args 'spacemacs-editing-style-hook 'vim)
    <span class="org-comment-delimiter">;; </span><span class="org-comment">restore the states</span>
    )

  <span class="org-comment-delimiter">;; </span><span class="org-comment">This code is from evil insert state definition, any change upstream</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">should be reflected here</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">see https://github.com/emacs-evil/evil/blob/56e92f7cb4e04e665670460093b41f58446b7a2b/evil-states.el#L108</span>
  (<span class="org-keyword">evil-define-state</span> <span class="org-function-name">hybrid</span>
    <span class="org-doc">"Hybrid state for hybrid mode."</span>
    <span class="org-builtin">:tag</span> <span class="org-string">" &lt;I&gt; "</span>
    <span class="org-builtin">:cursor</span> (bar . <span class="org-highlight-numbers-number">2</span>)
    <span class="org-builtin">:message</span> <span class="org-string">"-- HYBRID --"</span>
    <span class="org-builtin">:entry-hook</span> (evil-start-track-last-insertion)
    <span class="org-builtin">:exit-hook</span> (evil-cleanup-insert-state evil-stop-track-last-insertion)
    <span class="org-builtin">:input-method</span> t
    (<span class="org-keyword">cond</span>
     ((evil-hybrid-state-p)
      (add-hook 'post-command-hook #'evil-maybe-remove-spaces)
      (add-hook 'pre-command-hook #'evil-insert-repeat-hook)
      (<span class="org-keyword">setq</span> evil-maybe-remove-spaces t)
      (<span class="org-keyword">unless</span> (eq evil-want-fine-undo t)
        (evil-start-undo-step)))
     (t
      (remove-hook 'post-command-hook #'evil-maybe-remove-spaces)
      (remove-hook 'pre-command-hook #'evil-insert-repeat-hook)
      (evil-maybe-remove-spaces t)
      (<span class="org-keyword">setq</span> evil-insert-repeat-info evil-repeat-info)
      (evil-set-marker ?^ nil t)
      (<span class="org-keyword">unless</span> (eq evil-want-fine-undo t)
        (evil-end-undo-step))
      (<span class="org-keyword">when</span> evil-move-cursor-back
        (<span class="org-keyword">when</span> (<span class="org-keyword">or</span> (evil-normal-state-p evil-next-state)
                  (evil-motion-state-p evil-next-state))
          (evil-move-cursor-back))))))

  (define-key evil-hybrid-state-map [escape] 'evil-normal-state)

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Override stock evil function `</span><span class="org-comment"><span class="org-constant">evil-insert-state-p</span></span><span class="org-comment">'</span>
  (<span class="org-keyword">defun</span> <span class="org-function-name">evil-insert-state-p</span> (<span class="org-type">&amp;optional</span> state)
    <span class="org-doc">"Whether the current state is insert."</span>
    (<span class="org-keyword">and</span> evil-local-mode
         (memq (<span class="org-keyword">or</span> state evil-state) '(insert hybrid))))

  (define-key evil-hybrid-state-map [escape] 'evil-normal-state)
  (define-key evil-hybrid-state-map (kbd <span class="org-string">"C-w"</span>) 'evil-delete-backward-word)
  )
</pre>
</div>
</div>
</div>

<div id="outline-container-org1eb2608" class="outline-2">
<h2 id="org1eb2608"><span class="section-number-2">13</span> Spell checking</h2>
<div class="outline-text-2" id="text-13">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> <span class="org-constant">flyspell</span>
  <span class="org-builtin">:commands</span> (flyspell-mode)
  <span class="org-builtin">:config</span>
  (add-hook 'flyspell-mode-hook
            (<span class="org-keyword">lambda</span> () (add-hook 'hack-local-variables-hook 'flyspell-buffer))))
</pre>
</div>
</div>
</div>
