docs/index.html

<div id="outline-container-org8bfd243" class="outline-2">
<h2 id="org8bfd243"><span class="section-number-2">16</span> Haskell</h2>
<div class="outline-text-2" id="text-16">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> <span class="org-constant">haskell-mode</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:mode</span> ((<span class="org-string">"\\.hs\\'"</span> . haskell-mode)
         (<span class="org-string">"\\.lhs\\'"</span> . literate-haskell-mode)
         (<span class="org-string">"\\.cabal\\'"</span> . haskell-cabal-mode)
         (<span class="org-string">"\\.c2hs\\'"</span> . haskell-c2hs-mode)
         (<span class="org-string">"\\.hcr\\'"</span> . ghc-core-mode)
         (<span class="org-string">"\\.dump-simpl\\'"</span> . ghc-core-mode))
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">setq</span> haskell-align-imports-pad-after-name t
        haskell-hoogle-command <span class="org-string">"hoogle --count=100"</span>
        haskell-interactive-popup-errors nil
        <span class="org-comment-delimiter">;; </span><span class="org-comment">choices: auto, ghci, cabal-repl, cabal-new-repl, stack-ghci</span>
        <span class="org-comment-delimiter">;; </span><span class="org-comment">cabal-new-repl is the one to use with nix-shell &amp; direnv</span>
        haskell-process-type 'cabal-new-repl
        )

  (<span class="org-keyword">with-eval-after-load</span> 'evil
    (<span class="org-keyword">my/evil-define-text-object</span> <span class="org-string">"haskell-inline-comment"</span> <span class="org-string">"#"</span> <span class="org-string">"{- "</span> <span class="org-string">" -}"</span>))

  <span class="org-comment-delimiter">;; </span><span class="org-comment"><span class="org-myXspecial-comment-keyword">TODO</span></span><span class="org-comment">: sort out this shit</span>
  (<span class="org-keyword">with-eval-after-load</span> 'smartparens
    (<span class="org-keyword">with-eval-after-load</span> 'haskell-mode
      (sp-local-pair 'haskell-mode <span class="org-string">"'"</span> nil <span class="org-builtin">:actions</span> nil)))

  <span class="org-builtin">:config</span>
  (my/highlight-keyword-in-mode 'haskell-mode <span class="org-string">"error"</span> nil 'font-lock-preprocessor-face)
  (my/highlight-keyword-in-mode 'haskell-mode <span class="org-string">"undefined"</span> nil 'font-lock-preprocessor-face)

  (my/define-major-mode-key 'haskell-mode <span class="org-string">"aa"</span> 'my/haskell-align-and-sort-everything)
  (my/define-major-mode-key 'haskell-mode <span class="org-string">"ai"</span> 'my/haskell-align-and-sort-imports)
  (my/define-major-mode-key 'haskell-mode <span class="org-string">"al"</span> 'my/haskell-align-and-sort-language-extensions)
  (my/define-major-mode-key 'haskell-mode <span class="org-string">"c"</span> 'projectile-compile-project)
  (my/define-major-mode-key 'haskell-mode <span class="org-string">"d"</span> 'my/haskell-open-haddock-documentation)
  (my/define-major-mode-key 'haskell-mode <span class="org-string">"h"</span> 'hoogle)
  (my/define-major-mode-key 'haskell-mode <span class="org-string">"i"</span> 'my/haskell-insert-import)
  (my/define-major-mode-key 'haskell-mode <span class="org-string">"l"</span> 'my/haskell-insert-language-extension)
  (my/define-major-mode-key 'haskell-mode <span class="org-string">"o"</span> 'my/haskell-insert-ghc-option)
  (my/define-major-mode-key 'haskell-mode <span class="org-string">"r"</span> 'my/haskell-insert-ghcid-repl-statement)
  (my/define-major-mode-key 'haskell-mode <span class="org-string">"s"</span> 'my/haskell-format-and-save)
  (my/define-major-mode-key 'haskell-mode <span class="org-string">"/"</span> 'engine/search-hoogle)
  (my/define-major-mode-key 'haskell-mode <span class="org-string">"?"</span> 'engine/search-stackage)
  (my/define-major-mode-key 'haskell-mode <span class="org-string">"#"</span> 'engine/search-haskell-language-extensions)

  (<span class="org-keyword">my/add-hooks</span>
   '(haskell-mode-hook)
   (<span class="org-keyword">setq</span> evil-shift-width <span class="org-highlight-numbers-number">2</span>)
   (<span class="org-keyword">push</span> '(?# . (<span class="org-string">"{- "</span> . <span class="org-string">" -}"</span>)) evil-surround-pairs-alist)
   (haskell-decl-scan-mode)
   (subword-mode <span class="org-highlight-numbers-number">1</span>)
   )
  )

(<span class="org-keyword">use-package</span> <span class="org-constant">ormolu</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:commands</span> (ormolu-format
             ormolu-format-buffer
             ormolu-format-region
             ormolu-format-on-save-mode)
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">setq</span> ormolu-extra-args
        '(<span class="org-string">"-o"</span> <span class="org-string">"-XTypeApplications"</span>
          <span class="org-string">"-o"</span> <span class="org-string">"-XInstanceSigs"</span>
          <span class="org-string">"-o"</span> <span class="org-string">"-XBangPatterns"</span>
          <span class="org-string">"-o"</span> <span class="org-string">"-XPatternSynonyms"</span>
          <span class="org-string">"-o"</span> <span class="org-string">"-XUnicodeSyntax"</span>
          )))

(<span class="org-keyword">defvar</span> <span class="org-variable-name">my/haskell-align-stuff</span> t)
(<span class="org-keyword">defvar</span> <span class="org-variable-name">my/haskell-use-ormolu</span> nil)

(<span class="org-keyword">defun</span> <span class="org-function-name">my/haskell-format-brittany</span> ()
  (<span class="org-keyword">interactive</span>)
  (my/format-and-save <span class="org-string">"brittany"</span>))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/haskell-format-and-save</span> (use-ormolu)
  <span class="org-doc">"Formats the import statements using haskell-stylish and saves</span>
<span class="org-doc">the current file."</span>
  (<span class="org-keyword">interactive</span> <span class="org-string">"P"</span>)
  (save-buffer)
  (<span class="org-keyword">if</span> (<span class="org-keyword">or</span> use-ormolu my/haskell-use-ormolu)
      (ormolu-format-buffer)
    (<span class="org-keyword">progn</span>
      (my/haskell-align-and-sort-imports)
      (my/haskell-align-and-sort-language-extensions)))
  (save-buffer))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/haskell-align-and-sort-imports</span> ()
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">save-excursion</span>
    (goto-char <span class="org-highlight-numbers-number">0</span>)
    (<span class="org-keyword">let</span> ((n-runs <span class="org-highlight-numbers-number">0</span>)
          (max-runs <span class="org-highlight-numbers-number">10</span>))
      (<span class="org-keyword">while</span> (<span class="org-keyword">and</span> (&lt; n-runs max-runs)
                  (haskell-navigate-imports))
        (<span class="org-keyword">progn</span>
          (<span class="org-keyword">setq</span> n-runs (1+ n-runs))
          (<span class="org-keyword">when</span> my/haskell-align-stuff (call-interactively 'haskell-align-imports))
          (call-interactively 'haskell-sort-imports)))
      (<span class="org-keyword">if</span> (&gt;= n-runs max-runs)
          (message <span class="org-string">"Sorting/aligning imports probably timed out"</span>)))))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/-haskell-mark-language-extensions</span> ()
  (<span class="org-keyword">interactive</span>)
  (deactivate-mark)
  (goto-char <span class="org-highlight-numbers-number">0</span>)
  (re-search-forward <span class="org-string">"^{-# LANGUAGE"</span> nil t)
  (beginning-of-line <span class="org-highlight-numbers-number">1</span>)
  (call-interactively 'set-mark-command)
  (<span class="org-keyword">while</span> (re-search-forward <span class="org-string">"^{-# LANGUAGE"</span> nil t)
    nil)
  (end-of-line <span class="org-highlight-numbers-number">1</span>))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/haskell-align-and-sort-language-extensions</span> ()
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">save-excursion</span>
    (<span class="org-keyword">when</span> my/haskell-align-stuff
      (my/-haskell-mark-language-extensions)
      (align-regexp (region-beginning) (region-end) <span class="org-string">"</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">\\s-*</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">#-"</span>))
    (my/-haskell-mark-language-extensions)
    (sort-lines nil (region-beginning) (region-end))))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/haskell-insert-language-extension</span> ()
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">let*</span> ((all-exts
          (split-string (shell-command-to-string <span class="org-string">"ghc --supported-languages"</span>)))
         (ext
          (completing-read <span class="org-string">"extension: "</span>
                           all-exts
                           nil nil nil nil nil)))
    (<span class="org-keyword">save-excursion</span>
      (goto-char <span class="org-highlight-numbers-number">0</span>)
      (re-search-forward <span class="org-string">"^{-#"</span> nil t)
      (beginning-of-line <span class="org-highlight-numbers-number">1</span>)
      (open-line <span class="org-highlight-numbers-number">1</span>)
      (insert (format <span class="org-string">"{-# LANGUAGE %s #-}"</span> ext))
      (my/haskell-align-and-sort-language-extensions))))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/haskell-insert-ghc-option</span> ()
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">let*</span> ((all-opts
          (split-string (shell-command-to-string <span class="org-string">"ghc --show-options"</span>)))
         (ext
          (completing-read <span class="org-string">"option: "</span>
                           all-opts
                           nil nil nil nil nil)))
    (<span class="org-keyword">save-excursion</span>
      (goto-char <span class="org-highlight-numbers-number">0</span>)
      (re-search-forward <span class="org-string">"^module"</span> nil t)
      (beginning-of-line <span class="org-highlight-numbers-number">1</span>)
      (open-line <span class="org-highlight-numbers-number">1</span>)
      (insert (format <span class="org-string">"{-# OPTIONS_GHC %s #-}"</span> ext)))))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/haskell-insert-import</span> (<span class="org-type">&amp;optional</span> qualified)
  (<span class="org-keyword">interactive</span> <span class="org-string">"P"</span>)
  (<span class="org-keyword">let*</span> ((prompt (format <span class="org-string">"import%s: "</span> (<span class="org-keyword">if</span> qualified <span class="org-string">" qualified"</span> <span class="org-string">""</span>)))
         (module (read-from-minibuffer
                  prompt nil nil nil
                  'my/haskell-insert-import-import-hist))
         (suff (<span class="org-keyword">if</span> qualified
                   (read-from-minibuffer
                    <span class="org-string">"as: "</span> nil nil nil
                    'my/haskell-insert-import-as-hist)
                 (read-from-minibuffer
                  <span class="org-string">"imports: "</span> nil nil nil
                  'my/haskell-insert-import-imports-hist))))
    (<span class="org-keyword">save-excursion</span>
      (goto-char <span class="org-highlight-numbers-number">0</span>)
      (<span class="org-keyword">while</span> (re-search-forward <span class="org-string">"^import"</span> nil t)
        nil)
      (next-line <span class="org-highlight-numbers-number">1</span>)
      (open-line <span class="org-highlight-numbers-number">1</span>)
      (insert
       (format <span class="org-string">"import%s%s%s"</span>
               (<span class="org-keyword">if</span> qualified <span class="org-string">" qualified "</span> <span class="org-string">" "</span>)
               module
               (<span class="org-keyword">if</span> qualified (format <span class="org-string">" as %s"</span> suff) (<span class="org-keyword">if</span> (string= <span class="org-string">""</span> suff) <span class="org-string">""</span> (format <span class="org-string">" (%s)"</span> suff)))
               )))))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/haskell-align-and-sort-everything</span> ()
  (<span class="org-keyword">interactive</span>)
  (my/haskell-align-and-sort-imports)
  (my/haskell-align-and-sort-language-extensions))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/haskell-insert-ghcid-repl-statement</span> (new-line)
  (<span class="org-keyword">interactive</span> <span class="org-string">"P"</span>)
  (<span class="org-keyword">setq</span> current-prefix-arg nil)
  (<span class="org-keyword">when</span> new-line
    (end-of-line <span class="org-highlight-numbers-number">1</span>)
    (call-interactively 'newline))
  (beginning-of-line <span class="org-highlight-numbers-number">1</span>)
  (call-interactively 'delete-horizontal-space)
  (insert <span class="org-string">"-- $&gt; "</span>))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/haskell-open-haddock-documentation</span> (use-eww)
  (<span class="org-keyword">interactive</span> <span class="org-string">"P"</span>)
  (<span class="org-keyword">let</span> ((url <span class="org-string">"https://haskell-haddock.readthedocs.io/en/latest/markup.html"</span>))
    (<span class="org-keyword">if</span> use-eww
        (eww url)
      (browse-url url))))

(<span class="org-keyword">defvar</span> <span class="org-variable-name">my/ghc-source-path</span> (expand-file-name <span class="org-string">"~/sources/ghc/"</span>))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/visit-ghc-tags-table</span> ()
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">let</span> ((tags (concat my/ghc-source-path <span class="org-string">"TAGS"</span>)))
    (<span class="org-keyword">if</span> (file-exists-p tags)
        (visit-tags-table tags)
      (<span class="org-warning">error</span> <span class="org-string">"No TAGS file found in ghc source directory"</span>))))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> <span class="org-constant">intero</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:after</span> haskell-mode
  <span class="org-builtin">:commands</span> (intero-mode-blacklist)
  <span class="org-builtin">:hook</span> (haskell-mode . intero-mode-blacklist)
  <span class="org-builtin">:diminish</span> intero-mode
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">setq</span> intero-blacklist '(<span class="org-string">"~/.xmonad"</span>))
  <span class="org-builtin">:config</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">pretty print (use :pretty, :prettyl, :no-pretty in ghci)</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">this has to be installed in every repo until I find a solution</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">(setq intero-extra-ghci-options '("-package" "pretty-simple"))</span>

  <span class="org-comment-delimiter">;; </span><span class="org-comment">don't auto insert matching single quotes in haskell mode, since I</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">mostly use them for promoted data types</span>
  (define-key intero-mode-map (kbd <span class="org-string">"M-."</span>) nil)
  (sp-local-pair 'intero-repl-mode <span class="org-string">"'"</span> nil <span class="org-builtin">:actions</span> nil)

  (flycheck-add-next-checker 'intero '(t . haskell-hlint)))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> <span class="org-constant">dante</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:after</span> haskell-mode
  <span class="org-builtin">:commands</span> (dante-mode)
  <span class="org-builtin">:hook</span> (haskell-mode . dante-mode)
  <span class="org-builtin">:init</span>
  (add-hook 'dante-mode-hook
            '(lambda () (flycheck-add-next-checker
                         'haskell-dante
                         '(warning . haskell-hlint)))))
</pre>
</div>
</div>
</div>
