configuration.org
* Purescript

#+BEGIN_SRC emacs-lisp
(defvar my/purescript-align-stuff t)

(defun my/purescript-sort-and-align-imports ()
  (interactive)
  (save-excursion
    (goto-line 1)
    (while (purescript-navigate-imports)
      (progn
        (purescript-sort-imports)
        (when my/purescript-align-stuff (purescript-align-imports))))
    (purescript-navigate-imports-return)))

(defun my/purescript-format-and-save ()
  "Formats the import statements using haskell-stylish and saves
the current file."
  (interactive)
  (my/purescript-sort-and-align-imports)
  (save-buffer))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(use-package purescript-mode
  :ensure t
  :mode ("\\.purs\\'" . purescript-mode)
  :init
  (setq purescript-indent-offset 2
        purescript-align-imports-pad-after-name t)
  :config
  (my/define-major-mode-key 'purescript-mode "a" 'my/purescript-sort-and-align-imports)
  (my/define-major-mode-key 'purescript-mode "i" 'purescript-navigate-imports)
  (my/define-major-mode-key 'purescript-mode "s" 'my/purescript-format-and-save)
  (my/define-major-mode-key 'purescript-mode "/" 'engine/search-pursuit)
  (add-hook
   'purescript-mode-hook
   (lambda ()
     (setq evil-shift-width 2)
     (turn-on-purescript-indentation)
     (turn-on-purescript-decl-scan)
     ;; (turn-on-purescript-font-lock)
     (push '(?# . ("{- " . " -}")) evil-surround-pairs-alist)
     (my/subword-mode 1)
     (make-variable-buffer-local 'find-tag-default-function)
     (setq find-tag-default-function (lambda () (current-word t t)))
     ))
  ;; xref for purescript works a bit weird with qualified identifiers
  ;; (define-key purescript-mode-map (kbd "M-.")
  ;; #'(lambda () (interactive) (xref-find-definitions (current-word t t))))
  )

;; This needs to exist in custom/
(use-package custom-purescript-font-lock
  :after purescript-mode)

;; copy these into the purescript-mode definition
;; (setq-local font-lock-defaults
;;             '((purescript-font-lock-keywords)
;;               nil nil nil nil
;;               (font-lock-syntactic-face-function
;;                . purescript-syntactic-face-function)
;;               (parse-sexp-lookup-properties . t)
;;               (font-lock-extra-managed-props . (composition purescript-type))))
;; (setq-local font-lock-multiline t)
#+END_SRC

* Python

#+BEGIN_SRC emacs-lisp
(use-package pyvenv
  :ensure t
  :commands (pyvenv-workon))

(use-package blacken
  :if (executable-find "black")
  :ensure t
  :commands (blacken-mode blacken-buffer)
  :init
  (setq blacken-line-length 80)
  :config
  (defun my/python-format-and-save ()
    (interactive)
    (blacken-buffer)
    (save-buffer))
  (my/define-major-mode-key 'python-mode "s" 'my/python-format-and-save))

(defun eshell/workon (arg) (pyvenv-workon arg))
(defun eshell/deactivate () (pyvenv-deactivate))

(setq python-shell-prompt-detect-failure-warning nil)

(defun my/mode-line-venv ()
  (if (string= major-mode "python-mode")
      (let ((venv (if (null pyvenv-virtual-env-name)
                      "-"
                    pyvenv-virtual-env-name)))
        (concat
         "["
         (propertize venv 'face '(:underline t))
         "] "))
    ""))

(use-package anaconda-mode
  :ensure t
  :defer t
  :diminish anaconda-mode
  :diminish anaconda-eldoc-mode)

(add-hook 'python-mode-hook
          (lambda ()
            (anaconda-mode)
            (anaconda-eldoc-mode)
            (define-key python-mode-map (kbd "C-c C-j") 'counsel-imenu)
            (setq-default flycheck-disabled-checkers
                          (append flycheck-disabled-checkers
                                  '(python-pycompile)))))
#+END_SRC

