docs/index.html

<div id="outline-container-org4908add" class="outline-2">
<h2 id="org4908add"><span class="section-number-2">17</span> Purescript</h2>
<div class="outline-text-2" id="text-17">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defvar</span> <span class="org-variable-name">my/purescript-align-stuff</span> t)

(<span class="org-keyword">defun</span> <span class="org-function-name">my/purescript-sort-and-align-imports</span> ()
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">save-excursion</span>
    (goto-line <span class="org-highlight-numbers-number">1</span>)
    (<span class="org-keyword">while</span> (purescript-navigate-imports)
      (<span class="org-keyword">progn</span>
        (purescript-sort-imports)
        (<span class="org-keyword">when</span> my/purescript-align-stuff (purescript-align-imports))))
    (purescript-navigate-imports-return)))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/purescript-format-and-save</span> ()
  <span class="org-doc">"Formats the import statements using haskell-stylish and saves</span>
<span class="org-doc">the current file."</span>
  (<span class="org-keyword">interactive</span>)
  (my/purescript-sort-and-align-imports)
  (save-buffer))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> <span class="org-constant">purescript-mode</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:mode</span> (<span class="org-string">"\\.purs\\'"</span> . purescript-mode)
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">setq</span> purescript-indent-offset <span class="org-highlight-numbers-number">2</span>
        purescript-align-imports-pad-after-name t)
  <span class="org-builtin">:config</span>
  (my/define-major-mode-key 'purescript-mode <span class="org-string">"a"</span> 'my/purescript-sort-and-align-imports)
  (my/define-major-mode-key 'purescript-mode <span class="org-string">"i"</span> 'purescript-navigate-imports)
  (my/define-major-mode-key 'purescript-mode <span class="org-string">"s"</span> 'my/purescript-format-and-save)
  (my/define-major-mode-key 'purescript-mode <span class="org-string">"/"</span> 'engine/search-pursuit)
  (add-hook
   'purescript-mode-hook
   (<span class="org-keyword">lambda</span> ()
     (<span class="org-keyword">setq</span> evil-shift-width <span class="org-highlight-numbers-number">2</span>)
     (turn-on-purescript-indentation)
     (turn-on-purescript-decl-scan)
     <span class="org-comment-delimiter">;; </span><span class="org-comment">(turn-on-purescript-font-lock)</span>
     (<span class="org-keyword">push</span> '(?# . (<span class="org-string">"{- "</span> . <span class="org-string">" -}"</span>)) evil-surround-pairs-alist)
     (subword-mode <span class="org-highlight-numbers-number">1</span>)
     (make-variable-buffer-local 'find-tag-default-function)
     (<span class="org-keyword">setq</span> find-tag-default-function (<span class="org-keyword">lambda</span> () (current-word t t)))
     ))
  <span class="org-comment-delimiter">;; </span><span class="org-comment">xref for purescript works a bit weird with qualified identifiers</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">(define-key purescript-mode-map (kbd "M-.")</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">#'(lambda () (interactive) (xref-find-definitions (current-word t t))))</span>
  )

<span class="org-comment-delimiter">;; </span><span class="org-comment">This needs to exist in custom/</span>
(<span class="org-keyword">use-package</span> <span class="org-constant">custom-purescript-font-lock</span>
  <span class="org-builtin">:after</span> purescript-mode)

<span class="org-comment-delimiter">;; </span><span class="org-comment">copy these into the purescript-mode definition</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">(setq-local font-lock-defaults</span>
<span class="org-comment-delimiter">;;             </span><span class="org-comment">'((purescript-font-lock-keywords)</span>
<span class="org-comment-delimiter">;;               </span><span class="org-comment">nil nil nil nil</span>
<span class="org-comment-delimiter">;;               </span><span class="org-comment">(font-lock-syntactic-face-function</span>
<span class="org-comment-delimiter">;;                </span><span class="org-comment">. purescript-syntactic-face-function)</span>
<span class="org-comment-delimiter">;;               </span><span class="org-comment">(parse-sexp-lookup-properties . t)</span>
<span class="org-comment-delimiter">;;               </span><span class="org-comment">(font-lock-extra-managed-props . (composition purescript-type))))</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">(setq-local font-lock-multiline t)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb390042" class="outline-2">
<h2 id="orgb390042"><span class="section-number-2">18</span> Python</h2>
<div class="outline-text-2" id="text-18">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> <span class="org-constant">python</span>
  <span class="org-builtin">:mode</span> (<span class="org-string">"\\.py\\'"</span> . python-mode)
  <span class="org-builtin">:bind</span> (<span class="org-builtin">:map</span> python-mode-map
              (<span class="org-string">"C-c C-j"</span> . counsel-imenu))
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">setq</span> python-shell-prompt-detect-failure-warning nil)
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">my/add-hooks</span>
   '(python-mode-hook)
   (<span class="org-keyword">setq-default</span> flycheck-disabled-checkers
                 (append flycheck-disabled-checkers
                         '(python-pycompile)))))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/mode-line-venv</span> ())
(<span class="org-keyword">use-package</span> <span class="org-constant">pyvenv</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:after</span> python
  <span class="org-builtin">:commands</span> (pyvenv-workon)
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">defun</span> <span class="org-function-name">my/mode-line-venv</span> ()
    (<span class="org-keyword">if</span> (string= major-mode <span class="org-string">"python-mode"</span>)
        (<span class="org-keyword">let</span> ((venv (<span class="org-keyword">if</span> (null pyvenv-virtual-env-name)
                        <span class="org-string">"-"</span>
                      pyvenv-virtual-env-name)))
          (concat
           <span class="org-string">"["</span>
           (propertize venv 'face '(<span class="org-builtin">:underline</span> t))
           <span class="org-string">"] "</span>))
      <span class="org-string">""</span>)))

(<span class="org-keyword">use-package</span> <span class="org-constant">blacken</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:if</span> (executable-find <span class="org-string">"black"</span>)
  <span class="org-builtin">:after</span> python
  <span class="org-builtin">:commands</span> (blacken-mode blacken-buffer)
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">setq</span> blacken-line-length <span class="org-highlight-numbers-number">80</span>)
  (<span class="org-keyword">defun</span> <span class="org-function-name">my/python-format-and-save</span> ()
    (<span class="org-keyword">interactive</span>)
    (blacken-buffer)
    (save-buffer))
  (my/define-major-mode-key 'python-mode <span class="org-string">"s"</span> 'my/python-format-and-save))

(<span class="org-keyword">use-package</span> <span class="org-constant">anaconda-mode</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:defer</span> t
  <span class="org-builtin">:hook</span> ((python-mode . anaconda-mode)
         (python-mode . anaconda-eldoc-mode)
         )
  <span class="org-builtin">:diminish</span> anaconda-mode
  <span class="org-builtin">:diminish</span> anaconda-eldoc-mode)

(<span class="org-keyword">defun</span> <span class="org-function-name">eshell/workon</span> (arg) (pyvenv-workon arg))
(<span class="org-keyword">defun</span> <span class="org-function-name">eshell/deactivate</span> () (pyvenv-deactivate))
</pre>
</div>
</div>
</div>
