configuration.org
* Markdown

#+BEGIN_SRC emacs-lisp
(use-package markdown-mode
  :ensure t
  :commands (markdown-mode gfm-mode)
  :mode (("README\\.md\\'" . gfm-mode)
         ("\\.md\\'" . markdown-mode)
         ("\\.markdown\\'" . markdown-mode)
         ("\\.page\\'" . gfm-mode))
  :config
  (if (executable-find "marked")
      (setq markdown-command "marked"))
  (setq markdown-asymmetric-header t
        markdown-gfm-use-electric-backquote nil
        markdown-css-paths
        (list (expand-file-name (concat user-emacs-directory "static/github.css")))
        )
  (my/add-hooks
   '(markdown-mode-hook)
   (auto-fill-mode 1)
   (whitespace-mode +1)
   ;; (orgtbl-mode +1)
   (push '(?# . ("<!-- " . " -->")) evil-surround-pairs-alist))
  (define-key markdown-mode-map (kbd "M-a") 'beginning-of-defun)
  (define-key markdown-mode-map (kbd "M-e") 'end-of-defun)

  (defun my/markdown-toggle-heading ()
    (interactive)
    (when (markdown-heading-at-point)
      (outline-toggle-children)))
  (define-key markdown-mode-map (kbd "TAB") 'my/markdown-toggle-heading)
  (define-key markdown-mode-map (kbd "<tab>") 'my/markdown-toggle-heading)

  (defun markdown-org-table-align-advice ()
    "Replace \"+\" sign with \"|\" in tables."
    (when (member major-mode '(markdown-mode gfm-mode))
      (save-excursion
        (save-restriction
          (narrow-to-region (org-table-begin) (org-table-end))
          (goto-char (point-min))
          (while (search-forward "-+-" nil t)
            (replace-match "-|-"))))))
  (advice-add 'org-table-align :after 'markdown-org-table-align-advice)
  )

(use-package markdown-toc
  :ensure t
  :after markdown-mode
  :commands (markdown-toc-refresh-toc
             markdown-toc-generate-toc
             markdown-toc-generate-or-refresh-toc)
  :init
  (defalias 'mtoc 'markdown-toc-generate-or-refresh-toc))

(use-package grip-mode
  :ensure t
  :defer t
  :if (executable-find "grip")
  :after markdown-mode
  :commands (grip-mode)
  :init
  (my/define-major-mode-key 'markdown-mode "p" #'grip-mode)
  (define-key markdown-mode-command-map (kbd "g") #'grip-mode))
#+END_SRC

* Other prog modes
** Idris

#+BEGIN_SRC emacs-lisp
(use-package idris-mode
  :ensure t
  :mode ("\\.idr\\'" . idris-mode))
#+END_SRC

** Agda

#+BEGIN_SRC emacs-lisp
(defvar my/agda-mode-path
  (expand-file-name
   (concat user-emacs-directory "lisp/agda-mode")))

(defvar my/agda-path "agda")

(use-package agda2-mode
  :if (and (file-directory-p my/agda-mode-path)
           (executable-find my/agda-path))
  :load-path my/agda-mode-path
  :mode ("\\.l?agda\\'" . agda2-mode)
  :init
  (setq agda2-program-name my/agda-path))
#+END_SRC

** Coq

#+BEGIN_SRC emacs-lisp
(use-package proof-general
  :ensure t
  :init
  (setq proof-splash-enable nil
        proof-script-fly-past-comments t)
  (setq coq-one-command-per-line nil
        coq-compile-before-require t)
  :config
  (add-hook 'coq-mode-hook
            (lambda ()
              (setq evil-shift-width 2)
              (undo-tree-mode 1)
              (whitespace-mode 1)
              )))
#+END_SRC

** Rust

#+BEGIN_SRC emacs-lisp :tangle no
(use-package racer
  :ensure t
  :hook (rust-mode . racer-mode))

(use-package cargo
  :ensure t
  :hook (rust-mode . cargo-minor-mode))

(use-package flycheck-rust
  :ensure t
  :hook (flycheck-mode . flycheck-rust-setup))

(use-package rust-mode
  :ensure t
  :mode ("\\.rs\\'" . rust-mode)
  :init
  (defvar my/rust-sysroot  "~/.rustup/toolchains/stable-x86_64-unknown-linux-gnu")
  (defvar my/rust-src-path (concat my/rust-sysroot "/lib/rustlib/src/rust/src"))
  (setq racer-cmd "~/.cargo/bin/racer")
  (setq racer-rust-src-path my/rust-src-path)
  (setenv "RUST_SRC_PATH" my/rust-src-path)
  (setq cargo-process--custom-path-to-bin "~/.cargo/bin")
  :config
  (add-hook 'rust-mode-hook 'eldoc-mode)
  (my/define-major-mode-key 'rust-mode "f" 'rust-format-buffer)
  (my/define-major-mode-key 'rust-mode "s" 'my/rust-format-and-save))

(defun my/rust-format-and-save ()
  (interactive)
  (call-interactively 'rust-format-buffer)
  (save-buffer))
#+END_SRC

** c/c++

#+BEGIN_SRC emacs-lisp
(setq c-default-style "linux"
      c-basic-offset 4)
#+END_SRC

** html & css

#+BEGIN_SRC emacs-lisp
(use-package web-mode
  :ensure t
  :mode ("\\.html\\'" . web-mode))

(with-eval-after-load 'css-mode
  (setq css-fontify-colors nil))

(use-package emmet-mode
  :ensure t
  :after web-mode
  :commands (emmet-expand-line)
  :bind (("<C-return>" . emmet-expand-line))
  :hook ((web-mode html-mode css-mode) . emmet-mode))
#+END_SRC

