docs/index.html

<div id="outline-container-org789c7c3" class="outline-2">
<h2 id="org789c7c3"><span class="section-number-2">21</span> Markdown</h2>
<div class="outline-text-2" id="text-21">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> <span class="org-constant">markdown-mode</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:commands</span> (markdown-mode gfm-mode)
  <span class="org-builtin">:bind</span> (<span class="org-builtin">:map</span> markdown-mode-map
              (<span class="org-string">"M-a"</span> . beginning-of-defun)
              (<span class="org-string">"M-e"</span> . end-of-defun)
              (<span class="org-string">"TAB"</span> . my/markdown-toggle-heading)
              (<span class="org-string">"&lt;tab&gt;"</span> . my/markdown-toggle-heading))
  <span class="org-builtin">:mode</span> ((<span class="org-string">"README\\.md\\'"</span> . gfm-mode)
         (<span class="org-string">"\\.md\\'"</span> . markdown-mode)
         (<span class="org-string">"\\.markdown\\'"</span> . markdown-mode)
         (<span class="org-string">"\\.page\\'"</span> . gfm-mode))
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">if</span> (executable-find <span class="org-string">"marked"</span>)
      (<span class="org-keyword">setq</span> markdown-command <span class="org-string">"marked"</span>))
  (<span class="org-keyword">setq</span> markdown-asymmetric-header t
        markdown-gfm-use-electric-backquote nil
        markdown-css-paths
        (list (expand-file-name (concat user-emacs-directory <span class="org-string">"static/github.css"</span>)))
        )
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">my/add-hooks</span>
   '(markdown-mode-hook)
   (auto-fill-mode <span class="org-highlight-numbers-number">1</span>)
   (whitespace-mode <span class="org-highlight-numbers-number">+1</span>)
   <span class="org-comment-delimiter">;; </span><span class="org-comment">(orgtbl-mode +1)</span>
   (<span class="org-keyword">push</span> '(?# . (<span class="org-string">"&lt;!-- "</span> . <span class="org-string">" --&gt;"</span>)) evil-surround-pairs-alist))

  (<span class="org-keyword">defun</span> <span class="org-function-name">markdown-org-table-align-advice</span> ()
    <span class="org-doc">"Replace \"+\" sign with \"|\" in tables."</span>
    (<span class="org-keyword">when</span> (member major-mode '(markdown-mode gfm-mode))
      (<span class="org-keyword">save-excursion</span>
        (<span class="org-keyword">save-restriction</span>
          (narrow-to-region (org-table-begin) (org-table-end))
          (goto-char (point-min))
          (<span class="org-keyword">while</span> (search-forward <span class="org-string">"-+-"</span> nil t)
            (replace-match <span class="org-string">"-|-"</span>))))))
  (advice-add 'org-table-align <span class="org-builtin">:after</span> 'markdown-org-table-align-advice)

  (<span class="org-keyword">defun</span> <span class="org-function-name">my/markdown-toggle-heading</span> ()
    (<span class="org-keyword">interactive</span>)
    (<span class="org-keyword">when</span> (markdown-heading-at-point)
      (outline-toggle-children))))

(<span class="org-keyword">use-package</span> <span class="org-constant">markdown-toc</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:after</span> markdown-mode
  <span class="org-builtin">:commands</span> (markdown-toc-refresh-toc
             markdown-toc-generate-toc
             markdown-toc-generate-or-refresh-toc)
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">defalias</span> '<span class="org-function-name">mtoc</span> 'markdown-toc-generate-or-refresh-toc))

(<span class="org-keyword">use-package</span> <span class="org-constant">grip-mode</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:defer</span> t
  <span class="org-builtin">:if</span> (executable-find <span class="org-string">"grip"</span>)
  <span class="org-builtin">:after</span> markdown-mode
  <span class="org-builtin">:commands</span> (grip-mode)
  <span class="org-builtin">:init</span>
  (my/define-major-mode-key 'markdown-mode <span class="org-string">"p"</span> #'grip-mode)
  (define-key markdown-mode-command-map (kbd <span class="org-string">"g"</span>) #'grip-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-org9982d52" class="outline-2">
<h2 id="org9982d52"><span class="section-number-2">22</span> Other prog modes</h2>
<div class="outline-text-2" id="text-22">
</div>
<div id="outline-container-orgcb9c9bf" class="outline-3">
<h3 id="orgcb9c9bf"><span class="section-number-3">22.1</span> Idris</h3>
<div class="outline-text-3" id="text-22-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> <span class="org-constant">idris-mode</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:mode</span> (<span class="org-string">"\\.idr\\'"</span> . idris-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf6ba755" class="outline-3">
<h3 id="orgf6ba755"><span class="section-number-3">22.2</span> Agda</h3>
<div class="outline-text-3" id="text-22-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defvar</span> <span class="org-variable-name">my/agda-mode-path</span>
  (expand-file-name
   (concat user-emacs-directory <span class="org-string">"lisp/agda-mode"</span>)))

(<span class="org-keyword">defvar</span> <span class="org-variable-name">my/agda-path</span> <span class="org-string">"agda"</span>)

(<span class="org-keyword">use-package</span> <span class="org-constant">agda2-mode</span>
  <span class="org-builtin">:if</span> (<span class="org-keyword">and</span> (file-directory-p my/agda-mode-path)
           (executable-find my/agda-path))
  <span class="org-builtin">:load-path</span> my/agda-mode-path
  <span class="org-builtin">:mode</span> (<span class="org-string">"\\.l?agda\\'"</span> . agda2-mode)
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">setq</span> agda2-program-name my/agda-path))
</pre>
</div>
</div>
</div>

<div id="outline-container-org2a53d6e" class="outline-3">
<h3 id="org2a53d6e"><span class="section-number-3">22.3</span> Coq</h3>
<div class="outline-text-3" id="text-22-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> <span class="org-constant">proof-general</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">setq</span> proof-splash-enable nil
        proof-script-fly-past-comments t
        coq-one-command-per-line nil
        coq-compile-before-require t)
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">my/add-hooks</span>
   '(coq-mode-hook)
   (<span class="org-keyword">setq</span> evil-shift-width <span class="org-highlight-numbers-number">2</span>)
   (undo-tree-mode <span class="org-highlight-numbers-number">1</span>)
   (whitespace-mode <span class="org-highlight-numbers-number">1</span>)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org5cde184" class="outline-3">
<h3 id="org5cde184"><span class="section-number-3">22.4</span> Rust</h3>
<div class="outline-text-3" id="text-22-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> <span class="org-constant">rust-mode</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:mode</span> (<span class="org-string">"\\.rs\\'"</span> . rust-mode)
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">defvar</span> <span class="org-variable-name">my/rust-sysroot</span>  <span class="org-string">"~/.rustup/toolchains/stable-x86_64-unknown-linux-gnu"</span>)
  (<span class="org-keyword">defvar</span> <span class="org-variable-name">my/rust-src-path</span> (concat my/rust-sysroot <span class="org-string">"/lib/rustlib/src/rust/src"</span>))
  (<span class="org-keyword">setq</span> racer-cmd <span class="org-string">"~/.cargo/bin/racer"</span>)
  (<span class="org-keyword">setq</span> racer-rust-src-path my/rust-src-path)
  (setenv <span class="org-string">"RUST_SRC_PATH"</span> my/rust-src-path)
  (<span class="org-keyword">setq</span> cargo-process--custom-path-to-bin <span class="org-string">"~/.cargo/bin"</span>)
  <span class="org-builtin">:config</span>
  (add-hook 'rust-mode-hook 'eldoc-mode)
  (my/define-major-mode-key 'rust-mode <span class="org-string">"f"</span> 'rust-format-buffer)
  (my/define-major-mode-key 'rust-mode <span class="org-string">"s"</span> 'my/rust-format-and-save))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/rust-format-and-save</span> ()
  (<span class="org-keyword">interactive</span>)
  (call-interactively 'rust-format-buffer)
  (save-buffer))

(<span class="org-keyword">use-package</span> <span class="org-constant">racer</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:after</span> rust-mode
  <span class="org-builtin">:hook</span> (rust-mode . racer-mode))

(<span class="org-keyword">use-package</span> <span class="org-constant">cargo</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:after</span> rust-mode
  <span class="org-builtin">:hook</span> (rust-mode . cargo-minor-mode))

(<span class="org-keyword">use-package</span> <span class="org-constant">flycheck-rust</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:after</span> (flycheck rust-mode)
  <span class="org-builtin">:hook</span> (flycheck-mode . flycheck-rust-setup))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf570467" class="outline-3">
<h3 id="orgf570467"><span class="section-number-3">22.5</span> c/c++</h3>
<div class="outline-text-3" id="text-22-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> c-default-style <span class="org-string">"linux"</span>
      c-basic-offset <span class="org-highlight-numbers-number">4</span>)
</pre>
</div>
</div>
</div>
