configuration.org
** dhall

#+BEGIN_SRC emacs-lisp
(use-package dhall-mode
  :ensure t
  :mode ("\\.dhall\\'" . dhall-mode)
  :init
  (setq dhall-format-at-save nil)
  :config
  (add-hook 'dhall-mode-hook (lambda () (setq indent-tabs-mode nil)))
  (my/define-major-mode-key 'dhall-mode "s" #'my/dhall-format-and-save))

(defun my/dhall-format-and-save ()
  (interactive)
  (if (executable-find "dhall")
      (dhall-format-buffer)
    (user-error "`dhall' executable not found"))
  (save-buffer))
#+END_SRC

** bazel

#+begin_src emacs-lisp
(use-package bazel-mode
  :ensure t
  :mode (("\\.bazel\\'" . bazel-mode)
         ("\\.bzl\\'" . bazel-mode))
  :config
  (my/define-major-mode-key 'bazel-mode "s" #'my/bazel-format-and-save))

(defun my/bazel-format-and-save ()
  (interactive)
  (let* ((fn (file-name-nondirectory buffer-file-name))
         (ext (file-name-extension fn))
         (tp (cond
              ((string= fn "BUILD.bazel") "build")
              ((string= ext "bzl") "bzl")
              (t (user-error (format "Not a bazel file extension: %s" ext)))))
         )
    (my/format-and-save "buildifier" "--type" tp))
  (save-buffer))
#+end_src

** nginx

#+begin_src emacs-lisp
(use-package nginx-mode
  :ensure t
  :mode (("nginx\\.conf\\'" . nginx-mode)
         ("nginx\\.conf\\.template\\'" . nginx-mode)))
#+end_src

** terraform

#+begin_src emacs-lisp
(use-package terraform-mode
  :ensure t
  :mode ("\\.tf\\'" . terraform-mode)
  :config
  (my/define-major-mode-key 'terraform-mode "s" #'my/terraform-format-and-save))

(defun my/terraform-format-and-save ()
  (interactive)
  (terraform-format-buffer)
  (save-buffer))
#+end_src

** docker

#+BEGIN_SRC emacs-lisp
(use-package dockerfile-mode
  :ensure t
  :mode ("Dockerfile.*" . dockerfile-mode))
#+END_SRC

** elasticsearch

#+begin_src emacs-lisp
(add-to-list 'auto-mode-alist '(".es\\'" . js-mode))
#+end_src

** json

#+BEGIN_SRC emacs-lisp
(use-package json-mode
  :ensure t
  :mode (("\\.json\\'" . json-mode)
         ("\\.json.tmpl\\'" . json-mode))
  :config
  (my/define-major-mode-key 'json-mode "s" #'my/json-format-and-save))

(defun my/json-format-and-save ()
  (interactive)
  (json-mode-beautify)
  (save-buffer))
#+END_SRC

** yaml

#+BEGIN_SRC emacs-lisp
(use-package yaml-mode
  :ensure t
  :mode (("\\.yaml\\'" . yaml-mode)
         ("\\.yml\\'" . yaml-mode)
         ("\\.yaml.template\\'" . yaml-mode)
         ("\\.yml.template\\'" . yaml-mode)))

(use-package flycheck-yamllint
  :ensure t
  :after (flycheck yaml-mode)
  :commands (flycheck-yamllint-setup)
  :hook (yaml-mode . flycheck-yamllint-setup))
#+END_SRC

** asciidoc

#+BEGIN_SRC emacs-lisp
(use-package adoc-mode
  :ensure t
  :mode ("\\.adoc\\'" . adoc-mode))
#+END_SRC

* Other major modes
