docs/index.html

<div id="outline-container-org01c8377" class="outline-3">
<h3 id="org01c8377"><span class="section-number-3">22.6</span> dhall</h3>
<div class="outline-text-3" id="text-22-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> <span class="org-constant">dhall-mode</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:mode</span> (<span class="org-string">"\\.dhall\\'"</span> . dhall-mode)
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">setq</span> dhall-format-at-save nil)
  <span class="org-builtin">:config</span>
  (add-hook 'dhall-mode-hook (<span class="org-keyword">lambda</span> () (<span class="org-keyword">setq</span> indent-tabs-mode nil)))
  (my/define-major-mode-key 'dhall-mode <span class="org-string">"s"</span> #'my/dhall-format-and-save))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/dhall-format-and-save</span> ()
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">if</span> (executable-find <span class="org-string">"dhall"</span>)
      (dhall-format-buffer)
    (<span class="org-warning">user-error</span> <span class="org-string">"`</span><span class="org-string"><span class="org-constant">dhall</span></span><span class="org-string">' executable not found"</span>))
  (save-buffer))
</pre>
</div>
</div>
</div>

<div id="outline-container-org08e247e" class="outline-3">
<h3 id="org08e247e"><span class="section-number-3">22.7</span> bazel</h3>
<div class="outline-text-3" id="text-22-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> <span class="org-constant">bazel-mode</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:mode</span> ((<span class="org-string">"\\.bazel\\'"</span> . bazel-mode)
         (<span class="org-string">"\\.bzl\\'"</span> . bazel-mode))
  <span class="org-builtin">:config</span>
  (my/define-major-mode-key 'bazel-mode <span class="org-string">"s"</span> #'my/bazel-format-and-save))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/bazel-format-and-save</span> ()
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">let*</span> ((fn (file-name-nondirectory buffer-file-name))
         (ext (file-name-extension fn))
         (tp (<span class="org-keyword">cond</span>
              ((string= fn <span class="org-string">"BUILD.bazel"</span>) <span class="org-string">"build"</span>)
              ((string= ext <span class="org-string">"bzl"</span>) <span class="org-string">"bzl"</span>)
              (t (<span class="org-warning">user-error</span> (format <span class="org-string">"Not a bazel file extension: %s"</span> ext))))))
    (my/format-and-save <span class="org-string">"buildifier"</span> <span class="org-string">"--type"</span> tp))
  (save-buffer))
</pre>
</div>
</div>
</div>

<div id="outline-container-org726e045" class="outline-3">
<h3 id="org726e045"><span class="section-number-3">22.8</span> nginx</h3>
<div class="outline-text-3" id="text-22-8">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> <span class="org-constant">nginx-mode</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:mode</span> ((<span class="org-string">"nginx\\.conf\\'"</span> . nginx-mode)
         (<span class="org-string">"nginx\\.conf\\.template\\'"</span> . nginx-mode)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org004ff52" class="outline-3">
<h3 id="org004ff52"><span class="section-number-3">22.9</span> terraform</h3>
<div class="outline-text-3" id="text-22-9">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> <span class="org-constant">terraform-mode</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:mode</span> (<span class="org-string">"\\.tf\\'"</span> . terraform-mode)
  <span class="org-builtin">:config</span>
  (my/define-major-mode-key 'terraform-mode <span class="org-string">"s"</span> #'my/terraform-format-and-save))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/terraform-format-and-save</span> ()
  (<span class="org-keyword">interactive</span>)
  (terraform-format-buffer)
  (save-buffer))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc380e02" class="outline-3">
<h3 id="orgc380e02"><span class="section-number-3">22.10</span> docker</h3>
<div class="outline-text-3" id="text-22-10">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> <span class="org-constant">dockerfile-mode</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:mode</span> (<span class="org-string">"Dockerfile.*"</span> . dockerfile-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-org29cf92a" class="outline-3">
<h3 id="org29cf92a"><span class="section-number-3">22.11</span> elasticsearch</h3>
<div class="outline-text-3" id="text-22-11">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-to-list 'auto-mode-alist '(<span class="org-string">".es\\'"</span> . js-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-orga8f4bae" class="outline-3">
<h3 id="orga8f4bae"><span class="section-number-3">22.12</span> json</h3>
<div class="outline-text-3" id="text-22-12">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> <span class="org-constant">json-mode</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:mode</span> ((<span class="org-string">"\\.json\\'"</span> . json-mode)
         (<span class="org-string">"\\.json.tmpl\\'"</span> . json-mode))
  <span class="org-builtin">:config</span>
  (my/define-major-mode-key 'json-mode <span class="org-string">"s"</span> #'my/json-format-and-save))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/json-format-and-save</span> ()
  (<span class="org-keyword">interactive</span>)
  (json-mode-beautify)
  (save-buffer))
</pre>
</div>
</div>
</div>

<div id="outline-container-org4421de8" class="outline-3">
<h3 id="org4421de8"><span class="section-number-3">22.13</span> yaml</h3>
<div class="outline-text-3" id="text-22-13">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> <span class="org-constant">yaml-mode</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:mode</span> ((<span class="org-string">"\\.yaml\\'"</span> . yaml-mode)
         (<span class="org-string">"\\.yml\\'"</span> . yaml-mode)
         (<span class="org-string">"\\.yaml.template\\'"</span> . yaml-mode)
         (<span class="org-string">"\\.yml.template\\'"</span> . yaml-mode)))

(<span class="org-keyword">use-package</span> <span class="org-constant">flycheck-yamllint</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:after</span> (flycheck yaml-mode)
  <span class="org-builtin">:commands</span> (flycheck-yamllint-setup)
  <span class="org-builtin">:hook</span> (yaml-mode . flycheck-yamllint-setup))
</pre>
</div>
</div>
</div>

<div id="outline-container-org3a806cb" class="outline-3">
<h3 id="org3a806cb"><span class="section-number-3">22.14</span> asciidoc</h3>
<div class="outline-text-3" id="text-22-14">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> <span class="org-constant">adoc-mode</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:mode</span> (<span class="org-string">"\\.adoc\\'"</span> . adoc-mode))
</pre>
</div>
</div>
</div>
