configuration.org
** deft

#+begin_src emacs-lisp
(use-package deft
  :ensure t
  :bind ("<f8>" . deft)
  :commands (deft deft-cache-initialize deft-parse-title)
  :init
  (setq deft-extensions '("md" "org" "txt")
        deft-markdown-mode-title-level 1
        deft-use-filter-string-for-filename t
        deft-directory (concat my/dropbox-dir "deft")
        deft-recursive t
        deft-file-naming-rules '((noslash . "_")
                                 (nospace . "_")
                                 (case-fn . downcase)))
  (with-eval-after-load 'markdown-mode
    (define-key markdown-mode-map (kbd "C-c <f8>") 'my/generate-deft-link)))

(defun my/get-deft-file-by-title ()
  (if (or (not (boundp 'deft-hash-mtimes)) (null deft-hash-mtimes))
      (deft-cache-initialize)
    (deft-cache-update-all))
  (let* ((files (deft-find-all-files))
         (titles (mapcar 'deft-file-title files))
         (cands (-zip titles files))
         (title (completing-read "Deft file: " titles)))
    (assoc title cands)))

(defun my/get-deft-file-by-filename ()
  (let* ((name (completing-read "Deft file: " (deft-find-all-files-no-prefix)))
         (dir (expand-file-name deft-directory))
         (path (concat dir "/" name))
         (contents (with-temp-buffer
                     (insert-file-contents path)
                     (buffer-string)))
         (title (deft-parse-title path contents)))
    `(,title . ,path)))

(defun my/generate-deft-link (by-filename)
  "Interactively generate a relative markdown link to a deft file.

With prefix arg or non-nil BY-FILENAME the completion shows the filenames
instead of the title as seen by deft."
  (interactive "P")
  (when (or (null (buffer-file-name))
            (not (string-prefix-p (expand-file-name deft-directory)
                                  (file-name-directory (buffer-file-name)))))
    (user-error "Not currently editing a deft file"))
  (let* ((info (if by-filename (my/get-deft-file-by-filename) (my/get-deft-file-by-title)))
         (title (car info))
         (path (cdr info))
         (prompt (format "Link text [%s]: " title))
         (link-text (read-string prompt nil nil title))
         (curdir (file-name-directory (buffer-file-name)))
         (link-path (file-relative-name path curdir)))
    (insert (format "[%s](%s)" link-text link-path))))
#+end_src

** elfeed

#+BEGIN_SRC emacs-lisp
(use-package elfeed-web
  :ensure t
  :commands (elfeed-web-start)
  :after elfeed)

(use-package elfeed
  :ensure t
  :commands (elfeed)
  :init
  (setq elfeed-db-directory (concat my/dropbox-dir "elfeed"))
  :config

  (defun my/elfeed-hide-images (tog)
    (interactive "P")
    (let ((shr-inhibit-images (not tog)))
      (elfeed-show-refresh)))

  (define-key elfeed-search-mode-map (kbd "U") #'elfeed-update)
  (define-key elfeed-show-mode-map (kbd "i") #'my/elfeed-hide-images)
  (my/vim-navigation elfeed-show-mode-map t)
  (add-hook 'elfeed-show-mode-hook #'(lambda () (setq-local shr-width 100)))

  (setq elfeed-search-filter "@10-days-ago +unread"
        elfeed-db-directory (concat my/dropbox-dir "elfeed"))

  (add-hook 'elfeed-new-entry-hook
            (elfeed-make-tagger :before "2 weeks ago"
                                :remove 'unread))

  (add-hook 'elfeed-search-update-hook #'elfeed-db-save)
  (add-hook 'elfeed-update-init-hooks #'elfeed-db-save)

  (defface my/elfeed-important
    '((t (:foreground "salmon")))
    "Elfeed unread"
    :group 'my/faces)
  (push '(important my/elfeed-important) elfeed-search-face-alist)

  ;; get feeds from personal dir
  (load-file (concat my/dropbox-dir "lisp/elfeed-feeds.el")))
#+END_SRC

** pdf tools

#+BEGIN_SRC emacs-lisp
(use-package pdf-tools
  :ensure t
  :defer t
  :magic ("%PDF" . pdf-view-mode)
  :bind (:map pdf-view-mode-map
              ("j" . pdf-view-next-line-or-next-page)
              ("k" . pdf-view-previous-line-or-previous-page)
              ("h" . image-backward-hscroll)
              ("l" . image-forward-hscroll)
              ("C-s" . isearch-forward))
  :init
  (setq pdf-view-display-size 'fit-page
        pdf-view-midnight-colors '("#b3dfdd" . "#0a3749"))
  :config
  (pdf-tools-install :no-query))

(use-package pdf-outline
  :defer t
  :bind (:map pdf-outline-buffer-mode-map
              ("<backtab>" . outline-hide-sublevels)))
#+END_SRC

