docs/index.html

<div id="outline-container-org310028a" class="outline-3">
<h3 id="org310028a"><span class="section-number-3">22.15</span> reStructuredText</h3>
<div class="outline-text-3" id="text-22-15">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> <span class="org-constant">rst</span>
  <span class="org-builtin">:mode</span> (<span class="org-string">"\\.rst\\'"</span> . rst-mode)
  <span class="org-builtin">:bind</span> (<span class="org-builtin">:map</span> rst-mode-map
              (<span class="org-string">"M-a"</span> . rst-backward-section)
              (<span class="org-string">"M-e"</span> . rst-forward-section))
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">setq</span> rst-indent-width <span class="org-highlight-numbers-number">2</span>)
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">my/add-hooks</span>
   '(rst-mode-hook)
   (<span class="org-keyword">setq</span> evil-shift-width rst-indent-width)))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgadfe4db" class="outline-2">
<h2 id="orgadfe4db"><span class="section-number-2">23</span> Other major modes</h2>
<div class="outline-text-2" id="text-23">
</div>
<div id="outline-container-org5f16b0d" class="outline-3">
<h3 id="org5f16b0d"><span class="section-number-3">23.1</span> deft</h3>
<div class="outline-text-3" id="text-23-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> <span class="org-constant">deft</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:bind</span> (<span class="org-string">"&lt;f8&gt;"</span> . deft)
  <span class="org-builtin">:commands</span> (deft deft-cache-initialize deft-parse-title)
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">setq</span> deft-extensions '(<span class="org-string">"md"</span> <span class="org-string">"org"</span> <span class="org-string">"txt"</span>)
        deft-markdown-mode-title-level <span class="org-highlight-numbers-number">1</span>
        deft-use-filter-string-for-filename t
        deft-directory (concat my/dropbox-dir <span class="org-string">"deft"</span>)
        deft-recursive t
        deft-file-naming-rules '((noslash . <span class="org-string">"_"</span>)
                                 (nospace . <span class="org-string">"_"</span>)
                                 (case-fn . downcase)))
  (<span class="org-keyword">with-eval-after-load</span> 'markdown-mode
    (define-key markdown-mode-map (kbd <span class="org-string">"C-c &lt;f8&gt;"</span>) 'my/generate-deft-link)))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/get-deft-file-by-title</span> ()
  (<span class="org-keyword">if</span> (<span class="org-keyword">or</span> (not (boundp 'deft-hash-mtimes)) (null deft-hash-mtimes))
      (deft-cache-initialize)
    (deft-cache-update-all))
  (<span class="org-keyword">let*</span> ((files (deft-find-all-files))
         (titles (mapcar 'deft-file-title files))
         (cands (-zip titles files))
         (title (completing-read <span class="org-string">"Deft file: "</span> titles)))
    (assoc title cands)))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/get-deft-file-by-filename</span> ()
  (<span class="org-keyword">let*</span> ((name (completing-read <span class="org-string">"Deft file: "</span> (deft-find-all-files-no-prefix)))
         (dir (expand-file-name deft-directory))
         (path (concat dir <span class="org-string">"/"</span> name))
         (contents (<span class="org-keyword">with-temp-buffer</span>
                     (insert-file-contents path)
                     (buffer-string)))
         (title (deft-parse-title path contents)))
    `(,title . ,path)))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/generate-deft-link</span> (by-filename)
  <span class="org-doc">"Interactively generate a relative markdown link to a deft file.</span>

<span class="org-doc">With prefix arg or non-nil BY-FILENAME the completion shows the filenames</span>
<span class="org-doc">instead of the title as seen by deft."</span>
  (<span class="org-keyword">interactive</span> <span class="org-string">"P"</span>)
  (<span class="org-keyword">when</span> (<span class="org-keyword">or</span> (null (buffer-file-name))
            (not (string-prefix-p (expand-file-name deft-directory)
                                  (file-name-directory (buffer-file-name)))))
    (<span class="org-warning">user-error</span> <span class="org-string">"Not currently editing a deft file"</span>))
  (<span class="org-keyword">let*</span> ((info (<span class="org-keyword">if</span> by-filename (my/get-deft-file-by-filename) (my/get-deft-file-by-title)))
         (title (car info))
         (path (cdr info))
         (prompt (format <span class="org-string">"Link text [%s]: "</span> title))
         (link-text (read-string prompt nil nil title))
         (curdir (file-name-directory (buffer-file-name)))
         (link-path (file-relative-name path curdir)))
    (insert (format <span class="org-string">"[%s](%s)"</span> link-text link-path))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb88e9fa" class="outline-3">
<h3 id="orgb88e9fa"><span class="section-number-3">23.2</span> elfeed</h3>
<div class="outline-text-3" id="text-23-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> <span class="org-constant">elfeed-web</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:commands</span> (elfeed-web-start)
  <span class="org-builtin">:after</span> elfeed)

(<span class="org-keyword">use-package</span> <span class="org-constant">elfeed</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:commands</span> (elfeed)
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">setq</span> elfeed-db-directory (concat my/dropbox-dir <span class="org-string">"elfeed"</span>))
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">defun</span> <span class="org-function-name">my/elfeed-hide-images</span> (tog)
    (<span class="org-keyword">interactive</span> <span class="org-string">"P"</span>)
    (<span class="org-keyword">let</span> ((shr-inhibit-images (not tog)))
      (elfeed-show-refresh)))

  (define-key elfeed-search-mode-map (kbd <span class="org-string">"U"</span>) #'elfeed-update)
  (define-key elfeed-show-mode-map (kbd <span class="org-string">"i"</span>) #'my/elfeed-hide-images)
  (my/vim-navigation elfeed-show-mode-map t)
  (add-hook 'elfeed-show-mode-hook #'(lambda () (<span class="org-keyword">setq-local</span> shr-width <span class="org-highlight-numbers-number">100</span>)))

  (<span class="org-keyword">setq</span> elfeed-search-filter <span class="org-string">"@10-days-ago +unread"</span>
        elfeed-db-directory (concat my/dropbox-dir <span class="org-string">"elfeed"</span>))

  (add-hook 'elfeed-new-entry-hook
            (elfeed-make-tagger <span class="org-builtin">:before</span> <span class="org-string">"2 weeks ago"</span>
                                <span class="org-builtin">:remove</span> 'unread))

  (add-hook 'elfeed-search-update-hook #'elfeed-db-save)
  (add-hook 'elfeed-update-init-hooks #'elfeed-db-save)

  (<span class="org-keyword">defface</span> <span class="org-variable-name">my/elfeed-important</span>
    '((t (<span class="org-builtin">:foreground</span> <span class="org-string">"salmon"</span>)))
    <span class="org-doc">"Elfeed unread"</span>
    <span class="org-builtin">:group</span> 'my/faces)
  (<span class="org-keyword">push</span> '(important my/elfeed-important) elfeed-search-face-alist)

  <span class="org-comment-delimiter">;; </span><span class="org-comment">get feeds from personal dir</span>
  (load-file (concat my/dropbox-dir <span class="org-string">"lisp/elfeed-feeds.el"</span>)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org6640377" class="outline-3">
<h3 id="org6640377"><span class="section-number-3">23.3</span> pdf tools</h3>
<div class="outline-text-3" id="text-23-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> <span class="org-constant">pdf-tools</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:defer</span> t
  <span class="org-builtin">:magic</span> (<span class="org-string">"%PDF"</span> . pdf-view-mode)
  <span class="org-builtin">:bind</span> (<span class="org-builtin">:map</span> pdf-view-mode-map
              (<span class="org-string">"j"</span> . pdf-view-next-line-or-next-page)
              (<span class="org-string">"k"</span> . pdf-view-previous-line-or-previous-page)
              (<span class="org-string">"h"</span> . image-backward-hscroll)
              (<span class="org-string">"l"</span> . image-forward-hscroll)
              (<span class="org-string">"C-s"</span> . isearch-forward))
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">setq</span> pdf-view-display-size 'fit-page
        pdf-view-midnight-colors '(<span class="org-string">"#b3dfdd"</span> . <span class="org-string">"#0a3749"</span>))
  <span class="org-builtin">:config</span>
  (pdf-tools-install <span class="org-builtin">:no-query</span>))

(<span class="org-keyword">use-package</span> <span class="org-constant">pdf-outline</span>
  <span class="org-builtin">:defer</span> t
  <span class="org-builtin">:bind</span> (<span class="org-builtin">:map</span> pdf-outline-buffer-mode-map
              (<span class="org-string">"&lt;backtab&gt;"</span> . outline-hide-sublevels)))
</pre>
</div>
</div>
</div>
