docs/index.html

<div id="outline-container-orga926c82" class="outline-3">
<h3 id="orga926c82"><span class="section-number-3">23.4</span> erc</h3>
<div class="outline-text-3" id="text-23-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> <span class="org-constant">erc</span>
  <span class="org-builtin">:defer</span> t
  <span class="org-builtin">:commands</span> (erc my/erc-freenode)
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">setq</span> erc-rename-buffers t
        erc-prompt-for-nickserv-password nil
        erc-autojoin-timing 'ident
        erc-fill-function 'erc-fill-static
        erc-fill-static-center <span class="org-highlight-numbers-number">22</span>
        erc-server-reconnect-attempts <span class="org-highlight-numbers-number">5</span>
        erc-server-reconnect-timeout <span class="org-highlight-numbers-number">3</span>
        erc-interpret-mirc-color t
        erc-lurker-hide-list '(<span class="org-string">"JOIN"</span> <span class="org-string">"PART"</span> <span class="org-string">"QUIT"</span>)
        erc-autojoin-channels-alist '((<span class="org-string">"freenode.net"</span> <span class="org-string">"#haskell"</span>))
        erc-fill-column <span class="org-highlight-numbers-number">80</span>
        my/erc-default-nick <span class="org-string">"runforestrun"</span>
        )
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">defun</span> <span class="org-function-name">my/erc-freenode</span> (select-nick)
    (<span class="org-keyword">interactive</span> <span class="org-string">"P"</span>)
    (<span class="org-keyword">let</span> ((nick
           (<span class="org-keyword">if</span> select-nick
               (read-string <span class="org-string">"Nick: "</span>)
             my/erc-default-nick)))
      (erc <span class="org-builtin">:server</span> <span class="org-string">"irc.freenode.net"</span> <span class="org-builtin">:port</span> <span class="org-highlight-numbers-number">6667</span> <span class="org-builtin">:nick</span> nick)))

  (<span class="org-keyword">defun</span> <span class="org-function-name">my/erc-preprocess</span> (string)
    <span class="org-doc">"Avoids channel flooding."</span>
    (<span class="org-keyword">setq</span> str
          (string-trim
           (replace-regexp-in-string <span class="org-string">"\n+"</span> <span class="org-string">" "</span> str))))

  (<span class="org-keyword">defun</span> <span class="org-function-name">my/erc-switch-to-buffer</span> ()
    (<span class="org-keyword">interactive</span>)
    (<span class="org-keyword">let</span> ((read-buffer-function nil))
      (call-interactively 'erc-switch-to-buffer)))
  (define-key erc-mode-map (kbd <span class="org-string">"C-c C-b"</span>) 'my/erc-switch-to-buffer))

<span class="org-comment-delimiter">;; </span><span class="org-comment">put a bar after the last read message in erc</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">https://www.emacswiki.org/emacs/ErcBar</span>
(<span class="org-keyword">use-package</span> <span class="org-constant">erc-track</span>
  <span class="org-builtin">:after</span> erc
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">defun</span> <span class="org-function-name">erc-bar-move-back</span> (n)
    <span class="org-doc">"Moves back n message lines. Ignores wrapping, and server messages."</span>
    (<span class="org-keyword">interactive</span> <span class="org-string">"nHow many lines ? "</span>)
    (re-search-backward <span class="org-string">"^.*&lt;.*&gt;"</span> nil t n))

  (<span class="org-keyword">defun</span> <span class="org-function-name">erc-bar-update-overlay</span> ()
    <span class="org-doc">"Update the overlay for current buffer, based on the content of</span>
<span class="org-doc">erc-modified-channels-alist. Should be executed on window change."</span>
    (<span class="org-keyword">interactive</span>)
    (<span class="org-keyword">let*</span> ((info (assq (current-buffer) erc-modified-channels-alist))
           (count (cadr info)))
      (<span class="org-keyword">if</span> (<span class="org-keyword">and</span> info (&gt; count erc-bar-threshold))
          (<span class="org-keyword">save-excursion</span>
            (end-of-buffer)
            (<span class="org-keyword">when</span> (erc-bar-move-back count)
              (<span class="org-keyword">let</span> ((inhibit-field-text-motion t))
                (move-overlay erc-bar-overlay
                              (line-beginning-position)
                              (line-end-position)
                              (current-buffer)))))
        (delete-overlay erc-bar-overlay))))

  (<span class="org-keyword">defvar</span> <span class="org-variable-name">erc-bar-threshold</span> <span class="org-highlight-numbers-number">0</span>
    <span class="org-doc">"Display bar when there are more than erc-bar-threshold unread messages."</span>)
  (<span class="org-keyword">defvar</span> <span class="org-variable-name">erc-bar-overlay</span> nil
    <span class="org-doc">"Overlay used to set bar"</span>)
  (<span class="org-keyword">setq</span> erc-bar-overlay (make-overlay <span class="org-highlight-numbers-number">0</span> <span class="org-highlight-numbers-number">0</span>))
  (overlay-put erc-bar-overlay 'face '(<span class="org-builtin">:overline</span> <span class="org-string">"grey40"</span>))
  <span class="org-comment-delimiter">;;</span><span class="org-comment">put the hook before erc-modified-channels-update</span>
  (<span class="org-keyword">defadvice</span> <span class="org-function-name">erc-track-mode</span> (after erc-bar-setup-hook
                                   (<span class="org-type">&amp;rest</span> args) activate)
    <span class="org-comment-delimiter">;;</span><span class="org-comment">remove and add, so we know it's in the first place</span>
    (remove-hook 'window-configuration-change-hook 'erc-bar-update-overlay)
    (add-hook 'window-configuration-change-hook 'erc-bar-update-overlay))
  (add-hook 'erc-send-completed-hook (<span class="org-keyword">lambda</span> (str)
                                       (erc-bar-update-overlay))))

<span class="org-comment-delimiter">;; </span><span class="org-comment">https://www.reddit.com/r/emacs/comments/8ml6na/tip_how_to_make_erc_fun_to_use/</span>
(<span class="org-keyword">use-package</span> <span class="org-constant">erc-hl-nicks</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:after</span> erc
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">setq</span> erc-hl-nicks-skip-nicks '(<span class="org-string">"so"</span> <span class="org-string">"So"</span> <span class="org-string">"bind"</span> <span class="org-string">"hackage"</span>)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org6dcd2eb" class="outline-3">
<h3 id="org6dcd2eb"><span class="section-number-3">23.5</span> restclient</h3>
<div class="outline-text-3" id="text-23-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> <span class="org-constant">restclient</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:mode</span> (<span class="org-string">"\\.http\\'"</span> . restclient-mode)
  <span class="org-builtin">:config</span>
  (add-hook 'restclient-mode-hook 'evil-local-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-org3b5c0af" class="outline-3">
<h3 id="org3b5c0af"><span class="section-number-3">23.6</span> ledger</h3>
<div class="outline-text-3" id="text-23-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> <span class="org-constant">ledger-mode</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:mode</span> (<span class="org-string">"\\.hledger\\..*\\'"</span> . ledger-mode)
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">setq</span> ledger-mode-should-check-version nil
        ledger-report-links-in-register nil
        ledger-binary-path <span class="org-string">"hledger"</span>))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org93669ca" class="outline-2">
<h2 id="org93669ca"><span class="section-number-2">24</span> Company</h2>
<div class="outline-text-2" id="text-24">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> <span class="org-constant">company</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:diminish</span> company-mode
  <span class="org-builtin">:bind</span> ((<span class="org-string">"C-M-i"</span> . company-complete)
         <span class="org-builtin">:map</span> company-active-map
         (<span class="org-string">"C-p"</span> . company-select-previous)
         (<span class="org-string">"C-n"</span> . company-select-next)
         (<span class="org-string">"C-f"</span> . company-show-location)
         (<span class="org-string">"TAB"</span> . company-complete-common-or-cycle)
         (<span class="org-string">"&lt;tab&gt;"</span> . company-complete-common-or-cycle)
         (<span class="org-string">"&lt;escape&gt;"</span> . company-abort))
  <span class="org-builtin">:hook</span> ((after-init . global-company-mode)
         (global-company-mode . company-quickhelp-mode))
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">setq</span> company-dabbrev-downcase nil
        company-minimum-prefix-length <span class="org-highlight-numbers-number">3</span>
        company-idle-delay <span class="org-highlight-numbers-number">0.4</span>)
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">setq</span> company-backends (delete 'company-dabbrev company-backends))
  (add-to-list 'company-backends 'company-anaconda)
  (add-to-list 'company-backends 'company-files))

(<span class="org-keyword">use-package</span> <span class="org-constant">company-quickhelp</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:after</span> company)

(<span class="org-keyword">use-package</span> <span class="org-constant">company-anaconda</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:after</span> (company anaconda-mode))
</pre>
</div>
</div>
</div>
