configuration.org
** isearch

#+BEGIN_SRC emacs-lisp
(use-package isearch
  :init
  (setq search-whitespace-regexp ".*?"  ;; spaces match anything
        isearch-lax-whitespace t  ;; the default
        isearch-regex-lax-whitespace nil
        isearch-lazy-count t  ;; show match count and current match index
        lazy-count-prefix-format "(%s/%s) "
        lazy-count-suffix-format nil)
  :config
  (define-key isearch-mode-map
    (kbd "M-s M-s")
    (lambda () (interactive) (isearch-exit) (swiper isearch-string))))
#+END_SRC

** rg

#+BEGIN_SRC emacs-lisp
(use-package rg
  :ensure t
  :commands (rg)
  :init
  (setq rg-group-result t
        rg-ignore-case 'smart)
  :config
  (rg-define-toggle "--multiline --multiline-dotall" "u")
  (define-key rg-mode-map "m" #'rg-menu)
  (define-key rg-mode-map "N" #'my/rg-open-ace-window))

(defun my/rg-open-ace-window (&optional event)
  (interactive)
  (flet ((pop-to-buffer (buf &rest args)
                        (let ((pop-up-windows nil))
                          (if (get-buffer-window buf)
                              (while (not (equal buf (current-buffer)))
                                (other-window 1))
                            (progn
                              (ace-window nil)
                              (switch-to-buffer buf))))))
        (compile-goto-error event)))
#+END_SRC

