docs/index.html

<div id="outline-container-orga56d6f0" class="outline-2">
<h2 id="orga56d6f0"><span class="section-number-2">27</span> Searching</h2>
<div class="outline-text-2" id="text-27">
</div>
<div id="outline-container-orge56bd76" class="outline-3">
<h3 id="orge56bd76"><span class="section-number-3">27.1</span> isearch</h3>
<div class="outline-text-3" id="text-27-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> <span class="org-constant">isearch</span>
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">setq</span> search-whitespace-regexp <span class="org-string">".*?"</span>  <span class="org-comment-delimiter">;; </span><span class="org-comment">spaces match anything</span>
        isearch-lax-whitespace t  <span class="org-comment-delimiter">;; </span><span class="org-comment">the default</span>
        isearch-regex-lax-whitespace nil
        isearch-lazy-count t  <span class="org-comment-delimiter">;; </span><span class="org-comment">show match count and current match index</span>
        lazy-count-prefix-format <span class="org-string">"(%s/%s) "</span>
        lazy-count-suffix-format nil)
  <span class="org-builtin">:config</span>
  (define-key isearch-mode-map
    (kbd <span class="org-string">"M-s M-s"</span>)
    (<span class="org-keyword">lambda</span> () (<span class="org-keyword">interactive</span>) (isearch-exit) (swiper isearch-string))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgff98a6b" class="outline-3">
<h3 id="orgff98a6b"><span class="section-number-3">27.2</span> rg</h3>
<div class="outline-text-3" id="text-27-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> <span class="org-constant">rg</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:commands</span> (rg)
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">setq</span> rg-group-result t
        rg-ignore-case 'smart)
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">rg-define-toggle</span> <span class="org-string">"--multiline --multiline-dotall"</span> <span class="org-string">"u"</span>)
  (define-key rg-mode-map <span class="org-string">"m"</span> #'rg-menu)
  (define-key rg-mode-map <span class="org-string">"N"</span> #'my/rg-open-ace-window))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/rg-open-ace-window</span> (<span class="org-type">&amp;optional</span> event)
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">flet</span> ((pop-to-buffer (buf <span class="org-type">&amp;rest</span> args)
                        (<span class="org-keyword">let</span> ((pop-up-windows nil))
                          (<span class="org-keyword">if</span> (get-buffer-window buf)
                              (<span class="org-keyword">while</span> (not (equal buf (current-buffer)))
                                (other-window <span class="org-highlight-numbers-number">1</span>))
                            (<span class="org-keyword">progn</span>
                              (ace-window nil)
                              (switch-to-buffer buf))))))
        (compile-goto-error event)))
</pre>
</div>
</div>
</div>
</div>
