configuration.org
* Ivy/Counsel/Swiper

#+BEGIN_SRC emacs-lisp
(use-package counsel-projectile
  :ensure t
  :bind (:map projectile-command-map
              ("f" . counsel-projectile-find-file)
              ("s" . counsel-projectile-rg)
              ("b" . counsel-projectile-switch-to-buffer))
  :init
  (setq projectile-switch-project-action 'counsel-projectile-find-file))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(defun my/swiper (fuzzy)
  (interactive "P")
  (if fuzzy
      (let* ((temp-builders
              (copy-alist ivy-re-builders-alist))
             (ivy-re-builders-alist
              (add-to-list 'temp-builders
                           '(swiper . ivy--regex-fuzzy))))
        (swiper))
    (swiper)))

(defun my/swiper-isearch (fuzzy)
  (interactive "P")
  (if fuzzy
      (let* ((temp-builders
              (copy-alist ivy-re-builders-alist))
             (ivy-re-builders-alist
              (add-to-list 'temp-builders
                           '(swiper-isearch . ivy--regex-fuzzy))))
        (swiper-isearch))
    (swiper-isearch)))

(use-package ivy-xref  ;; currently in lisp/ because of patches
  :config (setq xref-show-xrefs-function 'ivy-xref-show-xrefs)
  :after ivy)

(use-package swiper
  :ensure t
  ;; :bind ("C-s" . my/swiper)
  :bind ("C-s" . my/swiper-isearch)
  :commands (swiper swiper-isearch swiper-all swiper-multi))

;; better fuzzy matching
(use-package flx
  :ensure t
  :after ivy)

;; mostly to bring recently used M-x targets at the top
(use-package smex
  :ensure t
  :after ivy
  :init
  (setq smex-history-length 12))

(defun my/ivy-reset-builders ()
  (setq ivy-re-builders-alist
        '((swiper               . ivy--regex-plus)
          (swiper-isearch       . ivy--regex-plus)
          (ivy-bibtex           . ivy--regex-ignore-order)
          (counsel-unicode-char . ivy--regex-ignore-order)
          (insert-char          . ivy--regex-ignore-order)
          (ucs-insert           . ivy--regex-ignore-order)
          (counsel-unicode-char . ivy--regex-ignore-order)
          (counsel-ag           . ivy--regex-ignore-order)  ;; NOTE: testing
          (counsel-rg           . ivy--regex-ignore-order)
          (t                    . ivy--regex-fuzzy))))

(use-package counsel
  :ensure t
  :bind (("M-x" . counsel-M-x)
         ("M-i" . counsel-imenu)
         ("M-I" . counsel-outline)
         ("C-x C-f" . counsel-find-file)
         ("C-x f" . counsel-file-jump)
         ("C-x r b" . counsel-bookmark)
         ("C-x C-a" . counsel-recentf))
  :after ivy
  :init
  (setq counsel-ag-base-command "ag --vimgrep --nocolor --nogroup %s"
        counsel-rg-base-command "rg --with-filename --no-heading --line-number --color never -S %s")
  :config
  (my/ivy-reset-builders)
  (setq ivy-initial-inputs-alist nil) ;; no ^ initially
  ;; counsel-ag
  ;; S-SPC doesn't work properly in counsel-ag anyway
  ;; NOTE: this also applies to rg
  (define-key counsel-ag-map (kbd "S-SPC") nil)
  ;; counsel-rg
  ;; NOTE: testing this (added `-S' for smart case in ivy-occur buffers)
  (global-set-key (kbd "C-c s")
                  (lambda ()
                    (interactive)
                    (counsel-rg nil (read-directory-name "rg in: ") "")))

  (defun my/counsel-file-jump-temp-root (reset)
    (interactive "P")
    (my/get-or-set-temp-root reset)
    (let ((current-prefix-arg nil))
      (counsel-file-jump nil my/temp-project-root)))

  (global-set-key (kbd "C-S-p") #'my/counsel-file-jump-temp-root)

  (defun my/counsel-rg-temp-root (reset)
    (interactive "P")
    (my/get-or-set-temp-root reset)
    (let ((current-prefix-arg nil))
      (counsel-rg "" my/temp-project-root)))

  (global-set-key (kbd "C-S-s") #'my/counsel-rg-temp-root)

  (defun my/counsel-file-jump-from-here (path)
    (interactive)
    (let ((dir (if (file-directory-p path)
                   path
                 (file-name-directory path))))
      (counsel-file-jump "" dir)))

  (defun my/set-temp-root-and-jump (dir)
    (setq my/temp-project-root dir)
    (my/counsel-file-jump-temp-root nil))

  (dolist (action '(counsel-find-file counsel-file-jump counsel-recentf))
    (ivy-set-actions
     action
     `(
       ("s"
        ,(my/control-function-window-split
          find-file-other-window
          0 nil)
        "split horizontally")
       ("v"
        ,(my/control-function-window-split
          find-file-other-window
          nil 0)
        "split vertically")
       ("n"
        ,(my/execute-f-with-hook
          find-file
          ace-select-window)
        "select window")
       ("e"
        my/eshell-in-dir
        "eshell")
       ("j"
        my/counsel-file-jump-from-here
        "jump")
       ("J"
        my/set-temp-root-and-jump
        "set temp root and jump")
       ("r"
        (lambda (dir) (counsel-rg nil dir))
        "counsel-rg")
       )))

  (dolist (action '(counsel-projectile-find-file projectile-recentf))
    (ivy-set-actions
     action
     `(("s"
        ,(my/control-function-window-split
          counsel-projectile-find-file-action-other-window
          0 nil)
        "split horizontally")
       ("v"
        ,(my/control-function-window-split
          counsel-projectile-find-file-action-other-window
          nil 0)
        "split vertically")
       ("n"
        ,(my/execute-f-with-hook
          counsel-projectile-find-file-action
          ace-select-window)
        "select window")
       ("R"
        (lambda (f) (projectile-recentf))
        "recent files")
       ("e"
        (lambda (f) (my/eshell-in-dir (projectile-expand-root f)))
        "eshell")
       )))

  ;; also applies to counsel-projectile-ag
  (dolist (action '(counsel-ag counsel-rg))
    (ivy-set-actions
     action
     '(("v"
        (lambda (x) (split-window-right) (windmove-right) (counsel-git-grep-action x))
        "split vertically")
       ("s"
        (lambda (x) (split-window-below) (windmove-down) (counsel-git-grep-action x))
        "split horizontally")
       ("n"
        (lambda (x) (ace-select-window) (counsel-git-grep-action x))
        "select window")
       ("I"
        (lambda (x)
          (insert
           (if (stringp x)
               (replace-regexp-in-string "^[^:]+:[^:]+:[^:]+:" "" x)
             (car x))))
        "insert just content"))))

  (defvar my/todo-search-string
    "TODO|NOTE|FIXME|XXX|DONE|HACK")

  (defun my/counsel-projectile-ag-todos ()
    (interactive)
    (let ((counsel-projectile-ag-initial-input my/todo-search-string))
      (counsel-projectile-ag)))

  (defun my/counsel-ag-todos-global ()
    (interactive)
    (my/try-exec-in-project 'my/counsel-projectile-ag-todos 'my/counsel-ag-todos))
  )

(use-package ivy
  :ensure t
  :diminish ivy-mode
  :hook (after-init . ivy-mode)
  :bind (("C-c r" . ivy-resume)
         ("C-x b" . ivy-switch-buffer)
         :map ivy-minibuffer-map
         ("C-l" . ivy-call-and-recenter))
  :init
  (setq ivy-use-virtual-buffers nil
        ivy-count-format "(%d/%d) "
        ivy-magic-tilde nil)
  :config
  (my/ivy-reset-builders)
  (setq ivy-initial-inputs-alist nil) ;; no ^ initially
  (define-key ivy-minibuffer-map (kbd "C-l") 'ivy-call-and-recenter)

  (defun my/ivy-yank-current-region-or-word (&optional qual)
    "Insert current region, if it's active, otherwise the current word,into
the minibuffer."
    (interactive "P")
    (let (text)
      (with-ivy-window
        (unwind-protect
            (setq text
                  (if (region-active-p)
                      (buffer-substring-no-properties (region-beginning) (region-end))
                    (current-word t (not qual))))))
      (when text (insert text))))
  (define-key ivy-minibuffer-map (kbd "M-j") 'my/ivy-yank-current-region-or-word)
  ;; TODO: something's up with rotation
  (define-key ivy-minibuffer-map (kbd "M-r") 'ivy-rotate-preferred-builders)

  (defun my/ivy-minibuffer-grow ()
    (interactive)
    (let* ((prefix (prefix-numeric-value current-prefix-arg))
           (nlines (cond
                    ((= prefix 1) 1)
                    ((= prefix 4) (/ (frame-height) 2))
                    (t (- (frame-height) 5))))
           (current-prefix-arg nil))
      (while (> nlines 0)
        (ivy-minibuffer-grow)
        (setq nlines (1- nlines)))))

  (define-key ivy-minibuffer-map (kbd "C-o") #'my/ivy-minibuffer-grow)

  ;; minibuffer actions for specific commands

  (ivy-set-actions
   'ivy-switch-buffer
   `(("s"
      ,(my/control-function-window-split
        ivy--switch-buffer-other-window-action
        0 nil)
      "split horizontally")
     ("v"
      ,(my/control-function-window-split
        ivy--switch-buffer-other-window-action
        nil 0)
      "split vertically")
     ("n"
      ,(my/execute-f-with-hook
        (lambda (b) (switch-to-buffer b nil 'force-same-window))
        ace-select-window)
      "select window")
     ("k" kill-buffer "kill buffer")
     ))

  (ivy-set-actions
   'projectile-switch-project
   '(("d"
      dired
      "Open Dired in project's directory")
     ("v"
      projectile-vc
      "Open project root in vc-dir or magit")
     ("r"
      projectile-remove-known-project
      "Remove project(s)")))
  )
#+END_SRC

