docs/index.html

<div id="outline-container-org2524774" class="outline-2">
<h2 id="org2524774"><span class="section-number-2">28</span> Ivy/Counsel/Swiper</h2>
<div class="outline-text-2" id="text-28">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> <span class="org-constant">counsel-projectile</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:bind</span> (<span class="org-builtin">:map</span> projectile-command-map
              (<span class="org-string">"f"</span> . counsel-projectile-find-file)
              (<span class="org-string">"s"</span> . counsel-projectile-rg)
              (<span class="org-string">"b"</span> . counsel-projectile-switch-to-buffer))
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">setq</span> projectile-switch-project-action 'counsel-projectile-find-file))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">my/swiper</span> (fuzzy)
  (<span class="org-keyword">interactive</span> <span class="org-string">"P"</span>)
  (<span class="org-keyword">if</span> fuzzy
      (<span class="org-keyword">let*</span> ((temp-builders
              (copy-alist ivy-re-builders-alist))
             (ivy-re-builders-alist
              (add-to-list 'temp-builders
                           '(swiper . ivy--regex-fuzzy))))
        (swiper))
    (swiper)))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/swiper-isearch</span> (fuzzy)
  (<span class="org-keyword">interactive</span> <span class="org-string">"P"</span>)
  (<span class="org-keyword">if</span> fuzzy
      (<span class="org-keyword">let*</span> ((temp-builders
              (copy-alist ivy-re-builders-alist))
             (ivy-re-builders-alist
              (add-to-list 'temp-builders
                           '(swiper-isearch . ivy--regex-fuzzy))))
        (swiper-isearch))
    (swiper-isearch)))

(<span class="org-keyword">use-package</span> <span class="org-constant">ivy-xref</span>  <span class="org-comment-delimiter">;; </span><span class="org-comment">currently in lisp/ because of patches</span>
  <span class="org-builtin">:config</span> (<span class="org-keyword">setq</span> xref-show-xrefs-function 'ivy-xref-show-xrefs)
  <span class="org-builtin">:after</span> ivy)

(<span class="org-keyword">use-package</span> <span class="org-constant">swiper</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-comment-delimiter">;; </span><span class="org-comment">:bind ("C-s" . my/swiper)</span>
  <span class="org-builtin">:bind</span> (<span class="org-string">"C-s"</span> . my/swiper-isearch)
  <span class="org-builtin">:commands</span> (swiper swiper-isearch swiper-all swiper-multi))

<span class="org-comment-delimiter">;; </span><span class="org-comment">better fuzzy matching</span>
(<span class="org-keyword">use-package</span> <span class="org-constant">flx</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:after</span> ivy)

<span class="org-comment-delimiter">;; </span><span class="org-comment">mostly to bring recently used M-x targets at the top</span>
(<span class="org-keyword">use-package</span> <span class="org-constant">smex</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:after</span> ivy
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">setq</span> smex-history-length <span class="org-highlight-numbers-number">12</span>))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/ivy-reset-builders</span> ()
  (<span class="org-keyword">setq</span> ivy-re-builders-alist
        '((swiper               . ivy--regex-plus)
          (swiper-isearch       . ivy--regex-plus)
          (ivy-bibtex           . ivy--regex-ignore-order)
          (counsel-unicode-char . ivy--regex-ignore-order)
          (insert-char          . ivy--regex-ignore-order)
          (ucs-insert           . ivy--regex-ignore-order)
          (counsel-unicode-char . ivy--regex-ignore-order)
          (counsel-ag           . ivy--regex-ignore-order)  <span class="org-comment-delimiter">;; </span><span class="org-comment"><span class="org-myXspecial-comment-keyword">NOTE</span></span><span class="org-comment">: testing</span>
          (counsel-rg           . ivy--regex-ignore-order)
          (t                    . ivy--regex-fuzzy))))

(<span class="org-keyword">use-package</span> <span class="org-constant">counsel</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:bind</span> ((<span class="org-string">"M-x"</span> . counsel-M-x)
         (<span class="org-string">"M-i"</span> . counsel-imenu)
         (<span class="org-string">"M-I"</span> . counsel-outline)
         (<span class="org-string">"C-x C-f"</span> . counsel-find-file)
         (<span class="org-string">"C-x f"</span> . counsel-file-jump)
         (<span class="org-string">"C-x r b"</span> . counsel-bookmark)
         (<span class="org-string">"C-x C-a"</span> . counsel-recentf))
  <span class="org-builtin">:after</span> ivy
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">setq</span> counsel-ag-base-command <span class="org-string">"ag --vimgrep --nocolor --nogroup %s"</span>
        counsel-rg-base-command <span class="org-string">"rg --with-filename --no-heading --line-number --color never -S %s"</span>)
  <span class="org-builtin">:config</span>
  (my/ivy-reset-builders)
  (<span class="org-keyword">setq</span> ivy-initial-inputs-alist nil) <span class="org-comment-delimiter">;; </span><span class="org-comment">no ^ initially</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">counsel-ag</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">S-SPC doesn't work properly in counsel-ag anyway</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment"><span class="org-myXspecial-comment-keyword">NOTE</span></span><span class="org-comment">: this also applies to rg</span>
  (define-key counsel-ag-map (kbd <span class="org-string">"S-SPC"</span>) nil)
  <span class="org-comment-delimiter">;; </span><span class="org-comment">counsel-rg</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment"><span class="org-myXspecial-comment-keyword">NOTE</span></span><span class="org-comment">: testing this (added `</span><span class="org-comment"><span class="org-constant">-S</span></span><span class="org-comment">' for smart case in ivy-occur buffers)</span>
  (global-set-key (kbd <span class="org-string">"C-c s"</span>)
                  (<span class="org-keyword">lambda</span> ()
                    (<span class="org-keyword">interactive</span>)
                    (counsel-rg nil (read-directory-name <span class="org-string">"rg in: "</span>) <span class="org-string">""</span>)))

  (<span class="org-keyword">defun</span> <span class="org-function-name">my/counsel-file-jump-temp-root</span> (reset)
    (<span class="org-keyword">interactive</span> <span class="org-string">"P"</span>)
    (my/get-or-set-temp-root reset)
    (<span class="org-keyword">let</span> ((current-prefix-arg nil))
      (counsel-file-jump nil my/temp-project-root)))

  (global-set-key (kbd <span class="org-string">"C-S-p"</span>) #'my/counsel-file-jump-temp-root)

  (<span class="org-keyword">defun</span> <span class="org-function-name">my/counsel-rg-temp-root</span> (reset)
    (<span class="org-keyword">interactive</span> <span class="org-string">"P"</span>)
    (my/get-or-set-temp-root reset)
    (<span class="org-keyword">let</span> ((current-prefix-arg nil))
      (counsel-rg <span class="org-string">""</span> my/temp-project-root)))

  (global-set-key (kbd <span class="org-string">"C-S-s"</span>) #'my/counsel-rg-temp-root)

  (<span class="org-keyword">defun</span> <span class="org-function-name">my/counsel-file-jump-from-here</span> (path)
    (<span class="org-keyword">interactive</span>)
    (<span class="org-keyword">let</span> ((dir (<span class="org-keyword">if</span> (file-directory-p path)
                   path
                 (file-name-directory path))))
      (counsel-file-jump <span class="org-string">""</span> dir)))

  (<span class="org-keyword">defun</span> <span class="org-function-name">my/set-temp-root-and-jump</span> (dir)
    (<span class="org-keyword">setq</span> my/temp-project-root dir)
    (my/counsel-file-jump-temp-root nil))

  (<span class="org-keyword">dolist</span> (action '(counsel-find-file counsel-file-jump counsel-recentf))
    (ivy-set-actions
     action
     `(
       (<span class="org-string">"s"</span>
        ,(<span class="org-keyword">my/control-function-window-split</span>
          find-file-other-window
          <span class="org-highlight-numbers-number">0</span> nil)
        <span class="org-string">"split horizontally"</span>)
       (<span class="org-string">"v"</span>
        ,(<span class="org-keyword">my/control-function-window-split</span>
          find-file-other-window
          nil <span class="org-highlight-numbers-number">0</span>)
        <span class="org-string">"split vertically"</span>)
       (<span class="org-string">"n"</span>
        ,(<span class="org-keyword">my/execute-f-with-hook</span>
          find-file
          ace-select-window)
        <span class="org-string">"select window"</span>)
       (<span class="org-string">"e"</span>
        my/eshell-in-dir
        <span class="org-string">"eshell"</span>)
       (<span class="org-string">"j"</span>
        my/counsel-file-jump-from-here
        <span class="org-string">"jump"</span>)
       (<span class="org-string">"J"</span>
        my/set-temp-root-and-jump
        <span class="org-string">"set temp root and jump"</span>)
       (<span class="org-string">"r"</span>
        (<span class="org-keyword">lambda</span> (dir) (counsel-rg nil dir))
        <span class="org-string">"counsel-rg"</span>)
       )))

  (<span class="org-keyword">dolist</span> (action '(counsel-projectile-find-file projectile-recentf))
    (ivy-set-actions
     action
     `((<span class="org-string">"s"</span>
        ,(<span class="org-keyword">my/control-function-window-split</span>
          counsel-projectile-find-file-action-other-window
          <span class="org-highlight-numbers-number">0</span> nil)
        <span class="org-string">"split horizontally"</span>)
       (<span class="org-string">"v"</span>
        ,(<span class="org-keyword">my/control-function-window-split</span>
          counsel-projectile-find-file-action-other-window
          nil <span class="org-highlight-numbers-number">0</span>)
        <span class="org-string">"split vertically"</span>)
       (<span class="org-string">"n"</span>
        ,(<span class="org-keyword">my/execute-f-with-hook</span>
          counsel-projectile-find-file-action
          ace-select-window)
        <span class="org-string">"select window"</span>)
       (<span class="org-string">"R"</span>
        (<span class="org-keyword">lambda</span> (f) (projectile-recentf))
        <span class="org-string">"recent files"</span>)
       (<span class="org-string">"e"</span>
        (<span class="org-keyword">lambda</span> (f) (my/eshell-in-dir (projectile-expand-root f)))
        <span class="org-string">"eshell"</span>)
       )))

  <span class="org-comment-delimiter">;; </span><span class="org-comment">also applies to counsel-projectile-ag</span>
  (<span class="org-keyword">dolist</span> (action '(counsel-ag counsel-rg))
    (ivy-set-actions
     action
     '((<span class="org-string">"v"</span>
        (<span class="org-keyword">lambda</span> (x) (split-window-right) (windmove-right) (counsel-git-grep-action x))
        <span class="org-string">"split vertically"</span>)
       (<span class="org-string">"s"</span>
        (<span class="org-keyword">lambda</span> (x) (split-window-below) (windmove-down) (counsel-git-grep-action x))
        <span class="org-string">"split horizontally"</span>)
       (<span class="org-string">"n"</span>
        (<span class="org-keyword">lambda</span> (x) (ace-select-window) (counsel-git-grep-action x))
        <span class="org-string">"select window"</span>)
       )))
  )

(<span class="org-keyword">use-package</span> <span class="org-constant">ivy</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:diminish</span> ivy-mode
  <span class="org-builtin">:hook</span> (after-init . ivy-mode)
  <span class="org-builtin">:bind</span> ((<span class="org-string">"C-c r"</span> . ivy-resume)
         (<span class="org-string">"C-x b"</span> . ivy-switch-buffer)
         <span class="org-builtin">:map</span> ivy-minibuffer-map
         (<span class="org-string">"C-l"</span> . ivy-call-and-recenter))
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">setq</span> ivy-use-virtual-buffers nil
        ivy-count-format <span class="org-string">"(%d/%d) "</span>
        ivy-magic-tilde nil)
  <span class="org-builtin">:config</span>
  (my/ivy-reset-builders)
  (<span class="org-keyword">setq</span> ivy-initial-inputs-alist nil) <span class="org-comment-delimiter">;; </span><span class="org-comment">no ^ initially</span>
  (define-key ivy-minibuffer-map (kbd <span class="org-string">"C-l"</span>) 'ivy-call-and-recenter)

  (<span class="org-keyword">defun</span> <span class="org-function-name">my/ivy-yank-current-region-or-word</span> (<span class="org-type">&amp;optional</span> qual)
    <span class="org-doc">"Insert current region, if it's active, otherwise the current word,into</span>
<span class="org-doc">the minibuffer."</span>
    (<span class="org-keyword">interactive</span> <span class="org-string">"P"</span>)
    (<span class="org-keyword">let</span> (text)
      (with-ivy-window
        (<span class="org-keyword">unwind-protect</span>
            (<span class="org-keyword">setq</span> text
                  (<span class="org-keyword">if</span> (region-active-p)
                      (buffer-substring-no-properties (region-beginning) (region-end))
                    (current-word t (not qual))))))
      (<span class="org-keyword">when</span> text (insert text))))
  (define-key ivy-minibuffer-map (kbd <span class="org-string">"M-j"</span>) 'my/ivy-yank-current-region-or-word)
  <span class="org-comment-delimiter">;; </span><span class="org-comment"><span class="org-myXspecial-comment-keyword">TODO</span></span><span class="org-comment">: something's up with rotation</span>
  (define-key ivy-minibuffer-map (kbd <span class="org-string">"M-r"</span>) 'ivy-rotate-preferred-builders)

  (<span class="org-keyword">defun</span> <span class="org-function-name">my/ivy-minibuffer-grow</span> ()
    (<span class="org-keyword">interactive</span>)
    (<span class="org-keyword">let*</span> ((prefix (prefix-numeric-value current-prefix-arg))
           (nlines (<span class="org-keyword">cond</span>
                    ((= prefix <span class="org-highlight-numbers-number">1</span>) <span class="org-highlight-numbers-number">1</span>)
                    ((= prefix <span class="org-highlight-numbers-number">4</span>) (/ (frame-height) <span class="org-highlight-numbers-number">2</span>))
                    (t (- (frame-height) <span class="org-highlight-numbers-number">5</span>))))
           (current-prefix-arg nil))
      (<span class="org-keyword">while</span> (&gt; nlines <span class="org-highlight-numbers-number">0</span>)
        (ivy-minibuffer-grow)
        (<span class="org-keyword">setq</span> nlines (1- nlines)))))

  (define-key ivy-minibuffer-map (kbd <span class="org-string">"C-o"</span>) #'my/ivy-minibuffer-grow)

  <span class="org-comment-delimiter">;; </span><span class="org-comment">minibuffer actions for specific commands</span>

  (ivy-set-actions
   'ivy-switch-buffer
   `((<span class="org-string">"s"</span>
      ,(<span class="org-keyword">my/control-function-window-split</span>
        ivy--switch-buffer-other-window-action
        <span class="org-highlight-numbers-number">0</span> nil)
      <span class="org-string">"split horizontally"</span>)
     (<span class="org-string">"v"</span>
      ,(<span class="org-keyword">my/control-function-window-split</span>
        ivy--switch-buffer-other-window-action
        nil <span class="org-highlight-numbers-number">0</span>)
      <span class="org-string">"split vertically"</span>)
     (<span class="org-string">"n"</span>
      ,(<span class="org-keyword">my/execute-f-with-hook</span>
        (<span class="org-keyword">lambda</span> (b) (switch-to-buffer b nil 'force-same-window))
        ace-select-window)
      <span class="org-string">"select window"</span>)
     (<span class="org-string">"k"</span> kill-buffer <span class="org-string">"kill buffer"</span>)
     ))

  (ivy-set-actions
   'projectile-switch-project
   '((<span class="org-string">"d"</span>
      dired
      <span class="org-string">"Open Dired in project's directory"</span>)
     (<span class="org-string">"v"</span>
      projectile-vc
      <span class="org-string">"Open project root in vc-dir or magit"</span>)
     (<span class="org-string">"r"</span>
      projectile-remove-known-project
      <span class="org-string">"Remove project(s)"</span>)))
  )
</pre>
</div>
</div>
</div>
