configuration.org
* Yasnippet

#+BEGIN_SRC emacs-lisp
(use-package yasnippet-snippets
  :ensure t
  :after yasnippet
  :config
  (yas-reload-all))

(use-package yasnippet
  :ensure t
  :commands (yas-expand)
  :diminish yas-minor-mode
  :init
  ;; setup keys in `prog-mode-map' initially ...
  (define-key prog-mode-map (kbd "<C-return>") 'yas-expand)
  (define-key prog-mode-map (kbd "C-c y") 'yas-expand)
  :config
  ;; ... remove them from `prog-mode-map' when mode is initialized ...
  (define-key prog-mode-map (kbd "<C-return>") nil)
  (define-key prog-mode-map (kbd "C-c y") nil)
  ;; ... and add them to `yas-minor-mode-map'
  (define-key yas-minor-mode-map (kbd "<C-return>") 'yas-expand)
  (define-key yas-minor-mode-map (kbd "C-c y") 'yas-expand)
  ;; this will run once (since it's in :config)
  (when (derived-mode-p 'prog-mode)
    (yas-minor-mode))
  (add-hook 'prog-mode-hook #'yas-minor-mode))
#+END_SRC

* Other window management
** Dired

#+BEGIN_SRC emacs-lisp
(use-package dired-subtree
  :ensure t
  :after dired
  :bind (:map dired-mode-map
              ("<tab>" . dired-subtree-toggle)
              ("TAB" . dired-subtree-toggle)))

(use-package dired-filter
  :ensure t
  :after dired)

(use-package dired-git-info
  :ensure t
  :after dired
  :bind (:map dired-mode-map (")" . dired-git-info-mode))
  :commands (dired-git-info-mode))

(defun my/dired-find-file-ace ()
  (interactive)
  (let ((find-file-run-dired t)
        (fname (dired-get-file-for-visit)))
    (if (ace-select-window)
        (find-file fname))))

(defun my/dired-file-jump-from-here ()
  (interactive)
  (let ((find-file-run-dired t)
        (fname (dired-get-file-for-visit)))
    (my/counsel-file-jump-from-here fname)))

(defun my/dired-persistent-buffer ()
  (interactive)
  (call-interactively 'dired)
  (use-local-map (copy-keymap dired-mode-map))
  (local-set-key (kbd "RET") #'my/dired-find-file-ace))

(defun my/dired-kill-all-buffers ()
  (interactive)
  (mapc (lambda (buf)
          (when (eq 'dired-mode
                    (buffer-local-value 'major-mode buf))
            (kill-buffer buf)))
        (buffer-list)))

(use-package dired-x
  :after dired
  :init
  (if is-mac (setq dired-use-ls-dired nil)))

(use-package dired
  :bind (:map dired-mode-map
              ("j" . dired-next-line)
              ("J" . dired-next-dirline)
              ("k" . dired-previous-line)
              ("K" . dired-prev-dirline)
              ("h" . backward-char)
              ("l" . forward-char)
              ("C-c n" . my/dired-find-file-ace)
              ("N" . my/dired-find-file-ace)
              ("M-n" . my/dired-find-file-ace)
              ("M-j" . my/dired-file-jump-from-here)
              ("M-u" . dired-up-directory)
              ("C-c q" . my/dired-kill-all-buffers))
  :init
  ;; hide files being edited + flycheck files from dired
  (setq dired-omit-files "\\`[.]?#\\|\\`.flycheck_"
        dired-omit-verbose nil)
  :config
  (add-hook 'dired-mode-hook #'auto-revert-mode)
  (add-hook 'dired-mode-hook #'dired-omit-mode)

  (define-key dired-mode-map
    (kbd "C-c v")
    (my/control-function-window-split
     dired-find-file-other-window
     nil 0))
  (define-key dired-mode-map
    (kbd "C-c s")
    (my/control-function-window-split
     dired-find-file-other-window
     0 nil))
  )
#+END_SRC

#+begin_src emacs-lisp
;; https://gist.github.com/surajacharya/4127526
(defun my/git-grep-dired (repo wildcards regexp)
  "Find Git-controlled files in DIR with a name like WILDCARDS containing a regexp REGEXP and start Dired on output."
  (interactive "DGit-grep (directory): \nsGit-grep (filename wildcard(s), e.g. *.xml): \nsGit-grep (grep regexp): ")
  (setq repo (file-name-as-directory (expand-file-name repo)))
  (switch-to-buffer (concat "*Git Grep " repo "*"))
  (fundamental-mode)
  (setq buffer-read-only nil)
  (erase-buffer)
  (setq default-directory repo)
  (let ((cmd (format "git --git-dir %s/.git ls-files -z%s | xargs -0 grep -lZ -- %s | xargs -0 ls -l"
                     repo
                     (apply 'concat (mapcar (lambda (s) (concat " " (shell-quote-argument s))) (split-string wildcards)))
                     (shell-quote-argument regexp))))
    (insert " " cmd "\n " repo ":\n")
    (call-process-shell-command (concat cmd " | sed -e 's/^/ /g'") nil t))
  (dired-mode)

  ;; (dired-build-subdir-alist)
  ;; From find-dired:
  ;; Set subdir-alist so that Tree Dired will work:
  (if (fboundp 'dired-simple-subdir-alist)
      ;; will work even with nested dired format (dired-nstd.el,v 1.15
      ;; and later)
      (dired-simple-subdir-alist)
    ;; else we have an ancient tree dired (or classic dired, where
    ;; this does no harm)
    (set (make-local-variable 'dired-subdir-alist)
         (list (cons default-directory (point-min-marker)))))
  (goto-line 2))
#+end_src

