docs/index.html

<div id="outline-container-orgf33c03c" class="outline-2">
<h2 id="orgf33c03c"><span class="section-number-2">29</span> Yasnippet</h2>
<div class="outline-text-2" id="text-29">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> <span class="org-constant">yasnippet-snippets</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:after</span> yasnippet
  <span class="org-builtin">:config</span>
  (yas-reload-all))

(<span class="org-keyword">use-package</span> <span class="org-constant">yasnippet</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:commands</span> (yas-expand)
  <span class="org-builtin">:diminish</span> yas-minor-mode
  <span class="org-builtin">:init</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">setup keys in `</span><span class="org-comment"><span class="org-constant">prog-mode-map</span></span><span class="org-comment">' initially ...</span>
  (define-key prog-mode-map (kbd <span class="org-string">"&lt;C-return&gt;"</span>) 'yas-expand)
  (define-key prog-mode-map (kbd <span class="org-string">"C-c y"</span>) 'yas-expand)
  <span class="org-builtin">:config</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">... remove them from `</span><span class="org-comment"><span class="org-constant">prog-mode-map</span></span><span class="org-comment">' when mode is initialized ...</span>
  (define-key prog-mode-map (kbd <span class="org-string">"&lt;C-return&gt;"</span>) nil)
  (define-key prog-mode-map (kbd <span class="org-string">"C-c y"</span>) nil)
  <span class="org-comment-delimiter">;; </span><span class="org-comment">... and add them to `</span><span class="org-comment"><span class="org-constant">yas-minor-mode-map</span></span><span class="org-comment">'</span>
  (define-key yas-minor-mode-map (kbd <span class="org-string">"&lt;C-return&gt;"</span>) 'yas-expand)
  (define-key yas-minor-mode-map (kbd <span class="org-string">"C-c y"</span>) 'yas-expand)
  <span class="org-comment-delimiter">;; </span><span class="org-comment">this will run once (since it's in :config)</span>
  (<span class="org-keyword">when</span> (derived-mode-p 'prog-mode)
    (yas-minor-mode))
  (add-hook 'prog-mode-hook #'yas-minor-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-org252602d" class="outline-2">
<h2 id="org252602d"><span class="section-number-2">30</span> Other window management</h2>
<div class="outline-text-2" id="text-30">
</div>
<div id="outline-container-orgffc37a9" class="outline-3">
<h3 id="orgffc37a9"><span class="section-number-3">30.1</span> Dired</h3>
<div class="outline-text-3" id="text-30-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> <span class="org-constant">dired-subtree</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:after</span> dired
  <span class="org-builtin">:bind</span> (<span class="org-builtin">:map</span> dired-mode-map
              (<span class="org-string">"&lt;tab&gt;"</span> . dired-subtree-toggle)
              (<span class="org-string">"TAB"</span> . dired-subtree-toggle)))

(<span class="org-keyword">use-package</span> <span class="org-constant">dired-filter</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:after</span> dired)

(<span class="org-keyword">use-package</span> <span class="org-constant">dired-git-info</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:after</span> dired
  <span class="org-builtin">:bind</span> (<span class="org-builtin">:map</span> dired-mode-map (<span class="org-string">")"</span> . dired-git-info-mode))
  <span class="org-builtin">:commands</span> (dired-git-info-mode))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/dired-find-file-ace</span> ()
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">let</span> ((find-file-run-dired t)
        (fname (dired-get-file-for-visit)))
    (<span class="org-keyword">if</span> (ace-select-window)
        (find-file fname))))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/dired-file-jump-from-here</span> ()
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">let</span> ((find-file-run-dired t)
        (fname (dired-get-file-for-visit)))
    (my/counsel-file-jump-from-here fname)))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/dired-persistent-buffer</span> ()
  (<span class="org-keyword">interactive</span>)
  (call-interactively 'dired)
  (use-local-map (copy-keymap dired-mode-map))
  (local-set-key (kbd <span class="org-string">"RET"</span>) #'my/dired-find-file-ace))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/dired-kill-all-buffers</span> ()
  (<span class="org-keyword">interactive</span>)
  (mapc (<span class="org-keyword">lambda</span> (buf)
          (<span class="org-keyword">when</span> (eq 'dired-mode
                    (buffer-local-value 'major-mode buf))
            (kill-buffer buf)))
        (buffer-list)))

(<span class="org-keyword">use-package</span> <span class="org-constant">dired-x</span>
  <span class="org-builtin">:after</span> dired
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">if</span> is-mac (<span class="org-keyword">setq</span> dired-use-ls-dired nil)))

(<span class="org-keyword">use-package</span> <span class="org-constant">dired</span>
  <span class="org-builtin">:bind</span> (<span class="org-builtin">:map</span> dired-mode-map
              (<span class="org-string">"j"</span> . dired-next-line)
              (<span class="org-string">"J"</span> . dired-next-dirline)
              (<span class="org-string">"k"</span> . dired-previous-line)
              (<span class="org-string">"K"</span> . dired-prev-dirline)
              (<span class="org-string">"h"</span> . backward-char)
              (<span class="org-string">"l"</span> . forward-char)
              (<span class="org-string">"C-c n"</span> . my/dired-find-file-ace)
              (<span class="org-string">"N"</span> . my/dired-find-file-ace)
              (<span class="org-string">"M-n"</span> . my/dired-find-file-ace)
              (<span class="org-string">"M-j"</span> . my/dired-file-jump-from-here)
              (<span class="org-string">"M-u"</span> . dired-up-directory)
              (<span class="org-string">"C-c q"</span> . my/dired-kill-all-buffers))
  <span class="org-builtin">:init</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">hide files being edited + flycheck files from dired</span>
  (<span class="org-keyword">setq</span> dired-omit-files <span class="org-string">"\\`[.]?#</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">|</span></span><span class="org-string">\\`.flycheck_"</span>
        dired-omit-verbose nil)
  <span class="org-builtin">:config</span>
  (add-hook 'dired-mode-hook #'auto-revert-mode)
  (add-hook 'dired-mode-hook #'dired-omit-mode)

  (define-key dired-mode-map
    (kbd <span class="org-string">"C-c v"</span>)
    (<span class="org-keyword">my/control-function-window-split</span>
     dired-find-file-other-window
     nil <span class="org-highlight-numbers-number">0</span>))
  (define-key dired-mode-map
    (kbd <span class="org-string">"C-c s"</span>)
    (<span class="org-keyword">my/control-function-window-split</span>
     dired-find-file-other-window
     <span class="org-highlight-numbers-number">0</span> nil))
  )
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">https://gist.github.com/surajacharya/4127526</span>
(<span class="org-keyword">defun</span> <span class="org-function-name">my/git-grep-dired</span> (repo wildcards regexp)
  <span class="org-doc">"Find Git-controlled files in DIR with a name like WILDCARDS containing a regexp REGEXP and start Dired on output."</span>
  (<span class="org-keyword">interactive</span> <span class="org-string">"DGit-grep (directory): \nsGit-grep (filename wildcard(s), e.g. *.xml): \nsGit-grep (grep regexp): "</span>)
  (<span class="org-keyword">setq</span> repo (file-name-as-directory (expand-file-name repo)))
  (switch-to-buffer (concat <span class="org-string">"*Git Grep "</span> repo <span class="org-string">"*"</span>))
  (fundamental-mode)
  (<span class="org-keyword">setq</span> buffer-read-only nil)
  (erase-buffer)
  (<span class="org-keyword">setq</span> default-directory repo)
  (<span class="org-keyword">let</span> ((cmd (format <span class="org-string">"git --git-dir %s/.git ls-files -z%s | xargs -0 grep -lZ -- %s | xargs -0 ls -l"</span>
                     repo
                     (apply 'concat (mapcar (<span class="org-keyword">lambda</span> (s) (concat <span class="org-string">" "</span> (shell-quote-argument s))) (split-string wildcards)))
                     (shell-quote-argument regexp))))
    (insert <span class="org-string">" "</span> cmd <span class="org-string">"\n "</span> repo <span class="org-string">":\n"</span>)
    (call-process-shell-command (concat cmd <span class="org-string">" | sed -e 's/^/ /g'"</span>) nil t))
  (dired-mode)

  <span class="org-comment-delimiter">;; </span><span class="org-comment">(dired-build-subdir-alist)</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">From find-dired:</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Set subdir-alist so that Tree Dired will work:</span>
  (<span class="org-keyword">if</span> (fboundp 'dired-simple-subdir-alist)
      <span class="org-comment-delimiter">;; </span><span class="org-comment">will work even with nested dired format (dired-nstd.el,v 1.15</span>
      <span class="org-comment-delimiter">;; </span><span class="org-comment">and later)</span>
      (dired-simple-subdir-alist)
    <span class="org-comment-delimiter">;; </span><span class="org-comment">else we have an ancient tree dired (or classic dired, where</span>
    <span class="org-comment-delimiter">;; </span><span class="org-comment">this does no harm)</span>
    (set (make-local-variable 'dired-subdir-alist)
         (list (cons default-directory (point-min-marker)))))
  (goto-line <span class="org-highlight-numbers-number">2</span>))
</pre>
</div>
</div>
</div>
