configuration.org
** ibuffer

#+begin_src emacs-lisp
(use-package ibuffer
  :init
  ;; `/ R` to toggle showing these groups
  ;; `/ \` to disable
  (setq-default ibuffer-saved-filter-groups
                `(("Default"
                   ("rg" (name . "\*rg.*\*"))
                   ("Dired" (mode . dired-mode))
                   ("Scratch" (name . "\*scratch.*"))
                   ("Temporary" (name . "\*.*\*"))
                   )))
  (setq ibuffer-show-empty-filter-groups nil)
  :config
  (define-key ibuffer-mode-map (kbd "M-o") nil)
  (global-set-key (kbd "C-x C-b") 'ibuffer)
  (add-hook 'ibuffer-mode-hook #'(lambda () (ibuffer-auto-mode 1))))
#+end_src

** Avy

#+BEGIN_SRC emacs-lisp
(use-package avy
  :ensure t
  :bind ("C-c i" . avy-goto-line))
#+END_SRC

** Ace-window

#+BEGIN_SRC emacs-lisp
(use-package ace-window
  :ensure t
  :bind ("C-c o" . ace-window)
  :init
  (setq aw-dispatch-always nil
        aw-keys (string-to-list "asdfghjkl;"))
  :config
  (custom-set-faces
   '(aw-leading-char-face ((t (:foreground "magenta" :background "gray16" :weight bold :height 1.8))))))
#+END_SRC

** buffer-move

#+BEGIN_SRC emacs-lisp
(use-package buffer-move
  :ensure t
  :bind (("<C-S-up>" . buf-move-up)
         ("<C-S-down>" . buf-move-down)
         ("<C-S-left>" . buf-move-left)
         ("<C-S-right>" . buf-move-right)))
#+END_SRC

** zoom

#+begin_src emacs-lisp
(use-package zoom
  :ensure t
  :bind ("M-+" . zoom)
  :init
  (setq zoom-size '(190 . 92)))
#+end_src

* Modeline
** Regular modeline

# Copied from spacemacs

#+BEGIN_SRC emacs-lisp
(defface modeline-flycheck-error
  '((t (:foreground "#e05e5e" :distant-foreground "#e05e5e")))
  "Face for flycheck error feedback in the modeline."
  :group 'modeline-flycheck)
(defface modeline-flycheck-warning
  '((t (:foreground "#bfb03d" :distant-foreground "#bfb03d")))
  "Face for flycheck warning feedback in the modeline."
  :group 'modeline-flycheck)
(defface modeline-flycheck-info
  '((t (:foreground "DeepSkyBlue3" :distant-foreground "DeepSkyBlue3")))
  "Face for flycheck info feedback in the modeline."
  :group 'modeline-flycheck)
(defface modeline-flycheck-ok
  '((t (:foreground "SeaGreen3" :distant-foreground "SeaGreen3")))
  "Face for flycheck ok feedback in the modeline."
  :group 'modeline-flycheck)

(defun my/modeline-flycheck-darker-faces ()
  (custom-theme-set-faces
   my/theme
   '(modeline-flycheck-error ((t (:foreground "#c63d3d" :distant-foreground "#c63d3d"))))
   '(modeline-flycheck-warning ((t (:foreground "#84781a" :distant-foreground "#84781a"))))
   '(modeline-flycheck-info ((t (:foreground "DeepSkyBlue4" :distant-foreground "DeepSkyBlue4"))))
   ))

(defvar modeline-flycheck-bullet "•%s")

(defun my/mode-line-flycheck-state (state)
  (let* ((counts (flycheck-count-errors flycheck-current-errors))
         (errorp (flycheck-has-current-errors-p state))
         (err (or (cdr (assq state counts)) "?"))
         (running (eq 'running flycheck-last-status-change))
         (face (intern (format "modeline-flycheck-%S" state))))
    (if (or errorp running)
        (propertize (format modeline-flycheck-bullet err) 'face face))))

(defun my/mode-line-flycheck ()
  (let* ((ml-error (my/mode-line-flycheck-state 'error))
         (ml-warning (my/mode-line-flycheck-state 'warning))
         (ml-info (my/mode-line-flycheck-state 'info))
         (ml-status (concat ml-error ml-warning ml-info)))
    (if (null ml-status) "" (concat " " ml-status " "))))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(setq-default mode-line-format
              '("%e"
                mode-line-front-space
                ;; evil-mode-line-tag
                mode-line-mule-info
                mode-line-client mode-line-modified mode-line-remote
                mode-line-frame-identification mode-line-buffer-identification " "
                mode-line-position
                (vc-mode vc-mode)
                (:eval (my/mode-line-flycheck))
                (:eval (my/mode-line-venv))
                mode-line-modes mode-line-misc-info mode-line-end-spaces))

(setq mode-line-misc-info
      (cons '(:eval (if (window-dedicated-p) "× " "")) mode-line-misc-info))
#+END_SRC

** Experimental new modeline

#+BEGIN_SRC emacs-lisp :tangle no
(use-package powerline :ensure t)

(defun my/split-mode-line-render (left right)
  "Return a string of `window-width' length containing LEFT, and RIGHT aligned respectively."
  (let* ((available-width (- (window-total-width)
                             (+ (length (format-mode-line left))
                                (length (format-mode-line right))))))
    (append left
            (list
             (format
              (format "%%%ds" available-width) ""))
            right)))

(defun my/mode-line-hud ()
  (let* ((active (eq my/-selected-window (selected-window)))
         (face0 (if active 'powerline-active0 'powerline-inactive0))
         (face2 (if active 'powerline-active2 'powerline-inactive2)))
    (pl/render (powerline-hud face0 face2))))

(setq global-mode-string (delete '(:eval (persp-mode-line)) global-mode-string))

(setq-default
 mode-line-format
 '((:eval
    (my/split-mode-line-render
     ;; left
     (quote
      ("%e"
       evil-mode-line-tag " "
       mode-line-mule-info
       mode-line-client mode-line-modified mode-line-remote "  "
       mode-line-buffer-identification " "
       mode-line-position
       ;; (vc-mode vc-mode)
       (:eval (my/mode-line-flycheck))
       (:eval (my/mode-line-venv))
       mode-line-modes
       mode-line-misc-info
       ))
     ;; right
     (quote
      (
       (:eval (frame-parameter nil 'persp--modestring)) " "
       ;; (:eval (pl/render (powerline-hud 'powerline-active0 'powerline-active2)))
       (:eval (my/mode-line-hud))
       "  "
       ))
     ))))
#+END_SRC

