docs/index.html

<div id="outline-container-org46f1464" class="outline-3">
<h3 id="org46f1464"><span class="section-number-3">30.2</span> ibuffer</h3>
<div class="outline-text-3" id="text-30-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> <span class="org-constant">ibuffer</span>
  <span class="org-builtin">:init</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">`/ R` to toggle showing these groups</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">`/ \` to disable</span>
  (<span class="org-keyword">setq-default</span> ibuffer-saved-filter-groups
                `((<span class="org-string">"Default"</span>
                   (<span class="org-string">"rg"</span> (name . <span class="org-string">"</span><span class="org-string"><span class="org-warning">\</span></span><span class="org-string">*rg.*</span><span class="org-string"><span class="org-warning">\</span></span><span class="org-string">*"</span>))
                   (<span class="org-string">"Dired"</span> (mode . dired-mode))
                   (<span class="org-string">"Scratch"</span> (name . <span class="org-string">"</span><span class="org-string"><span class="org-warning">\</span></span><span class="org-string">*scratch.*"</span>))
                   (<span class="org-string">"Temporary"</span> (name . <span class="org-string">"</span><span class="org-string"><span class="org-warning">\</span></span><span class="org-string">*.*</span><span class="org-string"><span class="org-warning">\</span></span><span class="org-string">*"</span>))
                   )))
  (<span class="org-keyword">setq</span> ibuffer-show-empty-filter-groups nil)
  <span class="org-builtin">:config</span>
  (define-key ibuffer-mode-map (kbd <span class="org-string">"M-o"</span>) nil)
  (global-set-key (kbd <span class="org-string">"C-x C-b"</span>) 'ibuffer)
  (add-hook 'ibuffer-mode-hook #'(lambda () (ibuffer-auto-mode <span class="org-highlight-numbers-number">1</span>))))
</pre>
</div>
</div>
</div>

<div id="outline-container-org10dff13" class="outline-3">
<h3 id="org10dff13"><span class="section-number-3">30.3</span> Avy</h3>
<div class="outline-text-3" id="text-30-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> <span class="org-constant">avy</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:bind</span> (<span class="org-string">"C-c i"</span> . avy-goto-line))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgeeae128" class="outline-3">
<h3 id="orgeeae128"><span class="section-number-3">30.4</span> Ace-window</h3>
<div class="outline-text-3" id="text-30-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> <span class="org-constant">ace-window</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:bind</span> (<span class="org-string">"C-c o"</span> . ace-window)
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">setq</span> aw-dispatch-always nil
        aw-keys (string-to-list <span class="org-string">"asdfghjkl;"</span>))
  <span class="org-builtin">:config</span>
  (custom-set-faces
   '(aw-leading-char-face ((t (<span class="org-builtin">:foreground</span> <span class="org-string">"magenta"</span> <span class="org-builtin">:background</span> <span class="org-string">"gray16"</span> <span class="org-builtin">:weight</span> bold <span class="org-builtin">:height</span> <span class="org-highlight-numbers-number">1.8</span>))))))
</pre>
</div>
</div>
</div>

<div id="outline-container-org92016ee" class="outline-3">
<h3 id="org92016ee"><span class="section-number-3">30.5</span> buffer-move</h3>
<div class="outline-text-3" id="text-30-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> <span class="org-constant">buffer-move</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:bind</span> ((<span class="org-string">"&lt;C-S-up&gt;"</span> . buf-move-up)
         (<span class="org-string">"&lt;C-S-down&gt;"</span> . buf-move-down)
         (<span class="org-string">"&lt;C-S-left&gt;"</span> . buf-move-left)
         (<span class="org-string">"&lt;C-S-right&gt;"</span> . buf-move-right)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orge426ac0" class="outline-3">
<h3 id="orge426ac0"><span class="section-number-3">30.6</span> zoom</h3>
<div class="outline-text-3" id="text-30-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> <span class="org-constant">zoom</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:bind</span> (<span class="org-string">"M-+"</span> . zoom)
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">setq</span> zoom-size '(<span class="org-highlight-numbers-number">190</span> . <span class="org-highlight-numbers-number">92</span>)))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orge5cd9ce" class="outline-2">
<h2 id="orge5cd9ce"><span class="section-number-2">31</span> Modeline</h2>
<div class="outline-text-2" id="text-31">
</div>
<div id="outline-container-org9a035d5" class="outline-3">
<h3 id="org9a035d5"><span class="section-number-3">31.1</span> Regular modeline</h3>
<div class="outline-text-3" id="text-31-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq-default</span> mode-line-format
              '(<span class="org-string">"%e"</span>
                mode-line-front-space
                <span class="org-comment-delimiter">;; </span><span class="org-comment">evil-mode-line-tag</span>
                mode-line-mule-info
                mode-line-client mode-line-modified mode-line-remote
                mode-line-frame-identification mode-line-buffer-identification <span class="org-string">" "</span>
                mode-line-position
                (vc-mode vc-mode)
                (<span class="org-builtin">:eval</span> (my/mode-line-flycheck))
                (<span class="org-builtin">:eval</span> (my/mode-line-venv))
                mode-line-modes mode-line-misc-info mode-line-end-spaces))

(<span class="org-keyword">setq</span> mode-line-misc-info
      (cons '(<span class="org-builtin">:eval</span> (<span class="org-keyword">if</span> (window-dedicated-p) <span class="org-string">"&#215; "</span> <span class="org-string">""</span>)) mode-line-misc-info))
</pre>
</div>
</div>
</div>

<div id="outline-container-org1e75d04" class="outline-3">
<h3 id="org1e75d04"><span class="section-number-3">31.2</span> Experimental new modeline</h3>
<div class="outline-text-3" id="text-31-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> <span class="org-constant">powerline</span> <span class="org-builtin">:ensure</span> t)

(<span class="org-keyword">defun</span> <span class="org-function-name">my/split-mode-line-render</span> (left right)
  (<span class="org-keyword">let*</span> ((available-width (- (window-total-width)
                             (+ (length (format-mode-line left))
                                (length (format-mode-line right))))))
    (append left
            (list (format (format <span class="org-string">"%%%ds"</span> available-width) <span class="org-string">""</span>))
            right)))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/mode-line-hud</span> ()
  (<span class="org-keyword">let*</span> ((active (eq my/-selected-window (selected-window)))
         (face0 (<span class="org-keyword">if</span> active 'powerline-active0 'powerline-inactive0))
         (face2 (<span class="org-keyword">if</span> active 'powerline-active2 'powerline-inactive2)))
    (pl/render (powerline-hud face0 face2))))

(<span class="org-keyword">setq</span> global-mode-string (delete '(<span class="org-builtin">:eval</span> (persp-mode-line)) global-mode-string))

(<span class="org-keyword">setq-default</span>
 mode-line-format
 '((<span class="org-builtin">:eval</span>
    (my/split-mode-line-render
     <span class="org-comment-delimiter">;; </span><span class="org-comment">left</span>
     (<span class="org-keyword">quote</span>
      (<span class="org-string">"%e"</span>
       evil-mode-line-tag <span class="org-string">" "</span>
       mode-line-mule-info
       mode-line-client mode-line-modified mode-line-remote <span class="org-string">"  "</span>
       mode-line-buffer-identification <span class="org-string">" "</span>
       mode-line-position
       (vc-mode vc-mode)
       (<span class="org-builtin">:eval</span> (my/mode-line-flycheck))
       (<span class="org-builtin">:eval</span> (my/mode-line-venv))
       mode-line-modes
       mode-line-misc-info
       ))
     <span class="org-comment-delimiter">;; </span><span class="org-comment">right</span>
     (<span class="org-keyword">quote</span>
      (
       (<span class="org-builtin">:eval</span> (frame-parameter nil 'persp--modestring)) <span class="org-string">" "</span>
       (<span class="org-builtin">:eval</span> (my/mode-line-hud))
       <span class="org-string">"  "</span>
       ))
     ))))
</pre>
</div>
</div>
</div>
