configuration.org
** Powerline

#+BEGIN_SRC emacs-lisp
(use-package powerline
  :ensure t
  :after flycheck
  :if is-gui
  :init
  (setq powerline-display-buffer-size nil)
  (setq powerline-display-mule-info nil)
  (setq flycheck-mode-line '(:eval (my/mode-line-flycheck)))
  (setq global-mode-string
        (append global-mode-string '((:eval (my/mode-line-venv)))))
  (setq global-mode-string
        (cons '(:eval (if (window-dedicated-p) "× " "")) global-mode-string))
  :config
  (powerline-default-theme)
  (diminish-undo 'flycheck-mode)
  (add-hook 'my/after-set-theme-hook 'powerline-reset)
  (add-hook 'my/after-set-font-hook 'powerline-reset))

;; is window selected?
(defvar my/-selected-window nil)
;; (add-hook 'post-command-hook '(lambda () (setq my/-selected-window (selected-window))))
(add-hook 'post-command-hook
          '(lambda ()
             (when (not (minibuffer-window-active-p (selected-window)))
               (setq my/-selected-window (selected-window)))))
(add-hook 'buffer-list-update-hook '(lambda () (force-mode-line-update t)))

;; is emacs focused?
(defvar my/-focused-in t)
(add-hook 'focus-in-hook '(lambda () (setq my/-focused-in t)))
(add-hook 'focus-out-hook '(lambda () (setq my/-focused-in nil)))

(defun my/current-window-active-p ()
  (and my/-focused-in
       (eq my/-selected-window (selected-window))))

;; Try this to see if it fixes powerline hiccups
(defun powerline-selected-window-active ()
  "Return whether the current window is active."
  (my/current-window-active-p))
#+END_SRC

* Org-mode

#+BEGIN_SRC emacs-lisp
(use-package org-mode
  :mode ("\\.org\\'" . org-mode)
  :bind (("C-c a" . org-agenda)
         ("C-c b" . org-iswitchb)
         ("C-c c" . org-capture)
         ("C-c l" . org-store-link)
         )
  :init
  (setq org-log-done 'time
        org-confirm-babel-evaluate nil
        org-clock-into-drawer nil
        org-src-fontify-natively t
        org-src-preserve-indentation t
        org-src-tab-acts-natively t
        org-src-window-setup 'other-window
        org-adapt-indentation nil
        org-directory (expand-file-name "~/org/")
        org-default-notes-file (concat org-directory "notes.org")
        org-ellipsis "…"
        org-todo-keywords '((sequence "TODO" "IN PROGRESS" "|" "DONE"))
        org-todo-keyword-faces '(("IN PROGRESS" . (:foreground "DarkOrange3" :weight bold)))
        )

  ;; org-capture
  (setq org-capture-templates
        '(("c"
           "Code comment"
           entry
           (file+headline org-default-notes-file "Code comments")
           "\n\n* %?\n\n#+BEGIN_SRC %^{Language}\n%i\n#+END_SRC\n\n%a\n")))

  ;; format string used when creating CLOCKSUM lines and when generating a
  ;; time duration (avoid showing days)
  (setq org-time-clocksum-format
        '(:hours "%d" :require-hours t :minutes ":%02d" :require-minutes t))

  (defun my/org-insert-template ()
    (interactive)
    (let* ((templ-dir (expand-file-name (concat user-emacs-directory "org-templates/")))
           (ls (directory-files templ-dir nil "^[^.]"))
           (file (completing-read "Template: " ls))
           (path (concat templ-dir file)))
      (insert-file-contents path)))

  (add-hook 'org-babel-after-execute-hook 'org-display-inline-images 'append)
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((python . t)
     (sql . t)
     ;; (dot . t)
     ;; (restclient . t)
     ))
  :config
  (my/add-hooks
   '(org-mode-hook)
   (define-key org-mode-map (kbd "TAB") 'org-cycle)
   (define-key org-mode-map (kbd "<tab>") 'org-cycle)
   (define-key evil-normal-state-map (kbd "TAB") 'org-cycle)
   (my/set-mode-fill-width 'org-mode-hook 100)
   )
  )

(defun my/org-set-src-faces (&optional light-bg th)
  (let* ((func (if light-bg 'color-darken-name 'color-lighten-name))
         (rfunc (if light-bg 'color-lighten-name 'color-darken-name))
         (bg (face-attribute 'default :background))
         (bg+ (funcall func bg 1))
         (bg++ (funcall func bg 4.5))
         (fg (face-attribute 'default :foreground))
         (theme (if th th my/theme))
         (cur-line-fg (face-attribute 'org-block-begin-line :foreground nil t))
         (cur-block-fg (funcall rfunc (face-attribute 'default :foreground nil t) 11))
         )
    (custom-theme-set-faces
     theme
     `(org-block ((t (:background ,bg+ :foreground ,cur-block-fg))))
     `(org-block-begin-line ((t (:background ,bg++ :foreground ,cur-line-fg))))
     `(org-block-end-line ((t (:background ,bg++ :foreground ,cur-line-fg)))))))

(use-package org-bullets
  :ensure t
  :if is-gui
  :after org
  :hook (org-mode . org-bullets-mode)
  :init
  (setq org-hide-leading-stars t))

;; auto-generated if a heading has a :TOC: tag
(use-package toc-org
  :ensure t
  :after org
  :hook (org-mode . toc-org-mode))

(use-package htmlize
  :ensure t
  :defer t
  :init
  (setq org-html-htmlize-output-type 'css))
#+END_SRC

* Setup
