docs/index.html

<div id="outline-container-orgc7d86ef" class="outline-3">
<h3 id="orgc7d86ef"><span class="section-number-3">31.3</span> Powerline</h3>
<div class="outline-text-3" id="text-31-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> <span class="org-constant">powerline</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:after</span> flycheck
  <span class="org-builtin">:if</span> is-gui
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">setq</span> powerline-display-buffer-size nil)
  (<span class="org-keyword">setq</span> powerline-display-mule-info nil)
  (<span class="org-keyword">setq</span> flycheck-mode-line '(<span class="org-builtin">:eval</span> (my/mode-line-flycheck)))
  (<span class="org-keyword">setq</span> global-mode-string
        (append global-mode-string '((<span class="org-builtin">:eval</span> (my/mode-line-venv)))))
  (<span class="org-keyword">setq</span> global-mode-string
        (cons '(<span class="org-builtin">:eval</span> (<span class="org-keyword">if</span> (window-dedicated-p) <span class="org-string">"&#215; "</span> <span class="org-string">""</span>)) global-mode-string))
  <span class="org-builtin">:config</span>
  (powerline-default-theme)
  (diminish-undo 'flycheck-mode)
  (add-hook 'my/after-set-theme-hook 'powerline-reset)
  (add-hook 'my/after-set-font-hook 'powerline-reset))

<span class="org-comment-delimiter">;; </span><span class="org-comment">is window selected?</span>
(<span class="org-keyword">defvar</span> <span class="org-variable-name">my/-selected-window</span> nil)
<span class="org-comment-delimiter">;; </span><span class="org-comment">(add-hook 'post-command-hook '(lambda () (setq my/-selected-window (selected-window))))</span>
(add-hook 'post-command-hook
          '(lambda ()
             (<span class="org-keyword">when</span> (not (minibuffer-window-active-p (selected-window)))
               (<span class="org-keyword">setq</span> my/-selected-window (selected-window)))))
(add-hook 'buffer-list-update-hook '(lambda () (force-mode-line-update t)))

<span class="org-comment-delimiter">;; </span><span class="org-comment">is emacs focused?</span>
(<span class="org-keyword">defvar</span> <span class="org-variable-name">my/-focused-in</span> t)
(add-hook 'focus-in-hook '(lambda () (<span class="org-keyword">setq</span> my/-focused-in t)))
(add-hook 'focus-out-hook '(lambda () (<span class="org-keyword">setq</span> my/-focused-in nil)))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/current-window-active-p</span> ()
  (<span class="org-keyword">and</span> my/-focused-in
       (eq my/-selected-window (selected-window))))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Try this to see if it fixes powerline hiccups</span>
(<span class="org-keyword">defun</span> <span class="org-function-name">powerline-selected-window-active</span> ()
  <span class="org-doc">"Return whether the current window is active."</span>
  (my/current-window-active-p))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orge575ec3" class="outline-2">
<h2 id="orge575ec3"><span class="section-number-2">32</span> Org-mode</h2>
<div class="outline-text-2" id="text-32">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">this is the same as doing org-babel-load-languages</span>
(<span class="org-keyword">use-package</span> <span class="org-constant">ob-python</span> <span class="org-builtin">:commands</span> (org-babel-execute:python))
(<span class="org-keyword">use-package</span> <span class="org-constant">ob-sql</span> <span class="org-builtin">:commands</span> (org-babel-execute:sql))

(<span class="org-keyword">use-package</span> <span class="org-constant">org-mode</span>
  <span class="org-builtin">:mode</span> (<span class="org-string">"\\.org\\'"</span> . org-mode)
  <span class="org-builtin">:bind</span> ((<span class="org-string">"C-c a"</span> . org-agenda)
         (<span class="org-string">"C-c b"</span> . org-iswitchb)
         (<span class="org-string">"C-c c"</span> . org-capture)
         (<span class="org-string">"C-c l"</span> . org-store-link)
         )
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">setq</span> org-log-done 'time
        org-confirm-babel-evaluate nil
        org-clock-into-drawer nil
        org-src-fontify-natively t
        org-src-preserve-indentation t
        org-src-tab-acts-natively t
        org-src-window-setup 'other-window
        org-adapt-indentation nil
        org-directory (expand-file-name <span class="org-string">"~/org/"</span>)
        org-default-notes-file (concat org-directory <span class="org-string">"notes.org"</span>)
        org-ellipsis <span class="org-string">"&#8230;"</span>
        org-todo-keywords '((sequence <span class="org-string">"</span><span class="org-string"><span class="org-myXspecial-comment-keyword">TODO</span></span><span class="org-string">"</span> <span class="org-string">"IN PROGRESS"</span> <span class="org-string">"|"</span> <span class="org-string">"</span><span class="org-string"><span class="org-myXspecial-comment-keyword">DONE</span></span><span class="org-string">"</span>))
        org-todo-keyword-faces '((<span class="org-string">"IN PROGRESS"</span> . (<span class="org-builtin">:foreground</span> <span class="org-string">"DarkOrange3"</span> <span class="org-builtin">:weight</span> bold)))
        )

  <span class="org-comment-delimiter">;; </span><span class="org-comment">org-capture</span>
  (<span class="org-keyword">setq</span> org-capture-templates
        '((<span class="org-string">"c"</span>
           <span class="org-string">"Code comment"</span>
           entry
           (file+headline org-default-notes-file <span class="org-string">"Code comments"</span>)
           <span class="org-string">"\n\n* %?\n\n#+BEGIN_SRC %^{Language}\n%i\n#+END_SRC\n\n%a\n"</span>)))

  <span class="org-comment-delimiter">;; </span><span class="org-comment">format string used when creating CLOCKSUM lines and when generating a</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">time duration (avoid showing days)</span>
  (<span class="org-keyword">setq</span> org-time-clocksum-format
        '(<span class="org-builtin">:hours</span> <span class="org-string">"%d"</span> <span class="org-builtin">:require-hours</span> t <span class="org-builtin">:minutes</span> <span class="org-string">":%02d"</span> <span class="org-builtin">:require-minutes</span> t))

  (<span class="org-keyword">defun</span> <span class="org-function-name">my/org-insert-template</span> ()
    (<span class="org-keyword">interactive</span>)
    (<span class="org-keyword">let*</span> ((templ-dir (expand-file-name (concat user-emacs-directory <span class="org-string">"org-templates/"</span>)))
           (ls (directory-files templ-dir nil <span class="org-string">"^[</span><span class="org-string"><span class="org-negation-char">^</span></span><span class="org-string">.]"</span>))
           (file (completing-read <span class="org-string">"Template: "</span> ls))
           (path (concat templ-dir file)))
      (insert-file-contents path)))

  <span class="org-builtin">:config</span>
  (add-hook 'org-babel-after-execute-hook 'org-display-inline-images 'append)
  (<span class="org-keyword">my/add-hooks</span>
   '(org-mode-hook)
   (define-key org-mode-map (kbd <span class="org-string">"TAB"</span>) 'org-cycle)
   (define-key org-mode-map (kbd <span class="org-string">"&lt;tab&gt;"</span>) 'org-cycle)
   (define-key evil-normal-state-map (kbd <span class="org-string">"TAB"</span>) 'org-cycle)
   (my/set-mode-fill-width 'org-mode-hook <span class="org-highlight-numbers-number">100</span>)
   )
  )

(<span class="org-keyword">defun</span> <span class="org-function-name">my/org-set-src-faces</span> (<span class="org-type">&amp;optional</span> light-bg th)
  (<span class="org-keyword">let*</span> ((func (<span class="org-keyword">if</span> light-bg 'color-darken-name 'color-lighten-name))
         (rfunc (<span class="org-keyword">if</span> light-bg 'color-lighten-name 'color-darken-name))
         (bg (face-attribute 'default <span class="org-builtin">:background</span>))
         (bg+ (funcall func bg <span class="org-highlight-numbers-number">1</span>))
         (bg++ (funcall func bg <span class="org-highlight-numbers-number">4.5</span>))
         (fg (face-attribute 'default <span class="org-builtin">:foreground</span>))
         (theme (<span class="org-keyword">if</span> th th my/theme))
         (cur-line-fg (face-attribute 'org-block-begin-line <span class="org-builtin">:foreground</span> nil t))
         (cur-block-fg (funcall rfunc (face-attribute 'default <span class="org-builtin">:foreground</span> nil t) <span class="org-highlight-numbers-number">11</span>))
         )
    (custom-theme-set-faces
     theme
     `(org-block ((t (<span class="org-builtin">:background</span> ,bg+ <span class="org-builtin">:foreground</span> ,cur-block-fg))))
     `(org-block-begin-line ((t (<span class="org-builtin">:background</span> ,bg++ <span class="org-builtin">:foreground</span> ,cur-line-fg))))
     `(org-block-end-line ((t (<span class="org-builtin">:background</span> ,bg++ <span class="org-builtin">:foreground</span> ,cur-line-fg)))))))

(<span class="org-keyword">use-package</span> <span class="org-constant">org-bullets</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:if</span> is-gui
  <span class="org-builtin">:after</span> org
  <span class="org-builtin">:hook</span> (org-mode . org-bullets-mode)
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">setq</span> org-hide-leading-stars t))

<span class="org-comment-delimiter">;; </span><span class="org-comment">auto-generated if a heading has a :TOC: tag</span>
(<span class="org-keyword">use-package</span> <span class="org-constant">toc-org</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:after</span> org
  <span class="org-builtin">:hook</span> (org-mode . toc-org-mode))

(<span class="org-keyword">use-package</span> <span class="org-constant">htmlize</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:defer</span> t
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">setq</span> org-html-htmlize-output-type 'css))
</pre>
</div>
</div>
</div>
