configuration.org
** Per-workstation setup

#+BEGIN_SRC emacs-lisp
(defvar my/after-init-hook nil "Hook called after initialization")
#+END_SRC

#+BEGIN_SRC emacs-lisp
;; these have to be paths to projects that projectile recognizes (e.g. git)
(defvar my/start-up-projects '())

(defun my/open-start-up-projects ()
  (unless (null my/start-up-projects)
    (let ((projectile-switch-project-action 'projectile-dired))
      (dolist (proj my/start-up-projects)
        (projectile-persp-switch-project proj)))
    (persp-switch "main")))

(add-hook 'my/after-init-hook 'my/open-start-up-projects)

;; usage:
;; (add-to-list 'my/start-up-projects "/path/to/some/project")
#+END_SRC

# thanks Nicolas Petton
#+BEGIN_SRC emacs-lisp
(defvar my/hosts-dir (expand-file-name (concat user-emacs-directory "hosts/")))
(defvar my/hostname (substring (shell-command-to-string "hostname") 0 -1))
(let* ((host-file (concat my/hosts-dir "init-" my/hostname ".el")))
  (load-file host-file))
#+END_SRC

** Performance

#+BEGIN_SRC emacs-lisp
;; stolen from doom
(defun my/defer-garbage-collection-h ()
  (setq gc-cons-threshold 100000000))

(defun my/restore-garbage-collection-h ()
  ;; Defer it so that commands launched immediately after will enjoy the
  ;; benefits.
  (run-at-time
   1 nil (lambda () (setq gc-cons-threshold 800000))))

(add-hook 'minibuffer-setup-hook #'my/defer-garbage-collection-h)
(add-hook 'minibuffer-exit-hook #'my/restore-garbage-collection-h)
#+END_SRC

** Global setup

#+BEGIN_SRC emacs-lisp
(setq custom-file (concat user-emacs-directory "custom.el"))
;; (load custom-file 'noerror)

(setq x-underline-at-descent-line t)

(custom-set-faces
 '(anzu-mode-line ((t (:inherit mode-line :foreground "magenta" :weight bold))))
 '(anzu-mode-line-no-match ((t (:inherit mode-line :foreground "red" :weight bold))))
 '(fixed-pitch ((t nil)))
 '(flycheck-error ((t (:underline (:color "red1" :style wave)))))
 '(flycheck-fringe-error ((t (:foreground "#FB4933"))))
 '(flycheck-fringe-info ((t (:foreground "DeepSkyBlue2"))))
 '(flycheck-fringe-warning ((t (:foreground "orange1"))))
 '(flycheck-info ((t (:underline (:color "DeepSkyBlue2" :style wave)))))
 '(flycheck-warning ((t (:underline (:color "orange1" :style wave)))))
 '(whitespace-trailing ((t (:background "#602020")))))

(dolist (val '((eval . (setq flycheck-disabled-checkers
                             (append flycheck-disabled-checkers
                                     (quote
                                      (intero)))))
               (haskell-hoogle-command . "stack hoogle -- --count=100")
               (projectile-tags-command . "npm run etags")
               (projectile-tags-command . "fast-tags -e -R .")
               (projectile-tags-command . "fast-tags -e -R -o %s --exclude=\"%s\" \"%s\"")
               (psc-ide-output-directory . "build/")
               (my/use-intero . t)
               (my/haskell-align-stuff . nil)
               (my/haskell-use-ormolu . t)
               (my/purescript-align-stuff . nil)
               ))
  (add-to-list 'safe-local-variable-values val))

(my/set-theme)
(my/set-font)

(setq linum-format 'dynamic)

(setq default-input-method "TeX")

(hybrid-mode)
(winner-mode)

(run-hooks 'my/after-init-hook)
#+END_SRC

# end of configuration.org
