docs/index.html

<div id="outline-container-org9c2072d" class="outline-2">
<h2 id="org9c2072d"><span class="section-number-2">33</span> Setup</h2>
<div class="outline-text-2" id="text-33">
</div>
<div id="outline-container-org4919423" class="outline-3">
<h3 id="org4919423"><span class="section-number-3">33.1</span> Per-workstation setup</h3>
<div class="outline-text-3" id="text-33-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defvar</span> <span class="org-variable-name">my/after-init-hook</span> nil <span class="org-doc">"Hook called after initialization"</span>)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">these have to be paths to projects that projectile recognizes (e.g. git)</span>
(<span class="org-keyword">defvar</span> <span class="org-variable-name">my/start-up-projects</span> '())

(<span class="org-keyword">defun</span> <span class="org-function-name">my/open-start-up-projects</span> ()
  (<span class="org-keyword">unless</span> (null my/start-up-projects)
    (<span class="org-keyword">let</span> ((projectile-switch-project-action 'projectile-dired))
      (<span class="org-keyword">dolist</span> (proj my/start-up-projects)
        (projectile-persp-switch-project proj)))
    (persp-switch <span class="org-string">"main"</span>)))

(add-hook 'my/after-init-hook 'my/open-start-up-projects)

<span class="org-comment-delimiter">;; </span><span class="org-comment">usage:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">(add-to-list 'my/start-up-projects "/path/to/some/project")</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defvar</span> <span class="org-variable-name">my/hosts-dir</span> (expand-file-name (concat user-emacs-directory <span class="org-string">"hosts/"</span>)))
(<span class="org-keyword">defvar</span> <span class="org-variable-name">my/hostname</span> (substring (shell-command-to-string <span class="org-string">"hostname"</span>) <span class="org-highlight-numbers-number">0</span> <span class="org-highlight-numbers-number">-1</span>))
(<span class="org-keyword">let*</span> ((host-file (concat my/hosts-dir <span class="org-string">"init-"</span> my/hostname <span class="org-string">".el"</span>)))
  (load-file host-file))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd34a5f0" class="outline-3">
<h3 id="orgd34a5f0"><span class="section-number-3">33.2</span> Performance</h3>
<div class="outline-text-3" id="text-33-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">stolen from doom</span>
(<span class="org-keyword">defun</span> <span class="org-function-name">my/defer-garbage-collection-h</span> ()
  (<span class="org-keyword">setq</span> gc-cons-threshold <span class="org-highlight-numbers-number">100000000</span>))

(<span class="org-keyword">defun</span> <span class="org-function-name">my/restore-garbage-collection-h</span> ()
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Defer it so that commands launched immediately after will enjoy the</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">benefits.</span>
  (run-at-time
   <span class="org-highlight-numbers-number">1</span> nil (<span class="org-keyword">lambda</span> () (<span class="org-keyword">setq</span> gc-cons-threshold <span class="org-highlight-numbers-number">800000</span>))))

(add-hook 'minibuffer-setup-hook #'my/defer-garbage-collection-h)
(add-hook 'minibuffer-exit-hook #'my/restore-garbage-collection-h)
</pre>
</div>
</div>
</div>

<div id="outline-container-org0704bbd" class="outline-3">
<h3 id="org0704bbd"><span class="section-number-3">33.3</span> Global setup</h3>
<div class="outline-text-3" id="text-33-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> custom-file (concat user-emacs-directory <span class="org-string">"custom.el"</span>))
<span class="org-comment-delimiter">;; </span><span class="org-comment">(load custom-file 'noerror)</span>

(<span class="org-keyword">setq</span> x-underline-at-descent-line t)

(custom-set-faces
 '(anzu-mode-line ((t (<span class="org-builtin">:inherit</span> mode-line <span class="org-builtin">:foreground</span> <span class="org-string">"magenta"</span> <span class="org-builtin">:weight</span> bold))))
 '(anzu-mode-line-no-match ((t (<span class="org-builtin">:inherit</span> mode-line <span class="org-builtin">:foreground</span> <span class="org-string">"red"</span> <span class="org-builtin">:weight</span> bold))))
 '(fixed-pitch ((t nil)))
 '(flycheck-error ((t (<span class="org-builtin">:underline</span> (<span class="org-builtin">:color</span> <span class="org-string">"red1"</span> <span class="org-builtin">:style</span> wave)))))
 '(flycheck-fringe-error ((t (<span class="org-builtin">:foreground</span> <span class="org-string">"#FB4933"</span>))))
 '(flycheck-fringe-info ((t (<span class="org-builtin">:foreground</span> <span class="org-string">"DeepSkyBlue2"</span>))))
 '(flycheck-fringe-warning ((t (<span class="org-builtin">:foreground</span> <span class="org-string">"orange1"</span>))))
 '(flycheck-info ((t (<span class="org-builtin">:underline</span> (<span class="org-builtin">:color</span> <span class="org-string">"DeepSkyBlue2"</span> <span class="org-builtin">:style</span> wave)))))
 '(flycheck-warning ((t (<span class="org-builtin">:underline</span> (<span class="org-builtin">:color</span> <span class="org-string">"orange1"</span> <span class="org-builtin">:style</span> wave)))))
 '(whitespace-trailing ((t (<span class="org-builtin">:background</span> <span class="org-string">"#602020"</span>)))))

(<span class="org-keyword">dolist</span> (val '((eval . (<span class="org-keyword">setq</span> flycheck-disabled-checkers
                             (append flycheck-disabled-checkers
                                     (<span class="org-keyword">quote</span>
                                      (intero)))))
               (haskell-hoogle-command . <span class="org-string">"stack hoogle -- --count=100"</span>)
               (projectile-tags-command . <span class="org-string">"npm run etags"</span>)
               (projectile-tags-command . <span class="org-string">"fast-tags -e -R ."</span>)
               (projectile-tags-command . <span class="org-string">"fast-tags -e -R -o %s --exclude=\"%s\" \"%s\""</span>)
               (psc-ide-output-directory . <span class="org-string">"build/"</span>)
               (my/use-intero . t)
               (my/haskell-align-stuff . nil)
               (my/haskell-use-ormolu . t)
               (my/purescript-align-stuff . nil)
               ))
  (add-to-list 'safe-local-variable-values val))

(my/set-theme)
(my/set-font)

(<span class="org-keyword">setq</span> linum-format 'dynamic)

(<span class="org-keyword">setq</span> default-input-method <span class="org-string">"TeX"</span>)

(hybrid-mode)
(winner-mode)

(run-hooks 'my/after-init-hook)
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Alex Peitsinis</p>
<p class="date">Created: 2020-03-16 Mon 13:19</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
